[Timeout] ConditionalExpression
commons/diagram/filter/FilterByTag.tsx:20:19
   const eventGraph = useUnit($eventGraph);
   const filterTags = useUnit($filterTags);
 
-  const options = eventGraph && eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];
+  const options = true ? new SimpleValues(...eventGraph.tags) : [];
 
   return (

[Survived] ConditionalExpression
commons/diagram/filter/FilterByTag.tsx:20:19
   const eventGraph = useUnit($eventGraph);
   const filterTags = useUnit($filterTags);
 
-  const options = eventGraph && eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];
+  const options = false ? new SimpleValues(...eventGraph.tags) : [];
 
   return (

[Survived] ArrayDeclaration
commons/diagram/filter/FilterByTag.tsx:28:21
       notFoundContent={<NotFoundContentFilterStub />}
       dropdownStyle={{borderRadius: '3px'}}
       isAllowClear
-      defaultValue={[]}
+      defaultValue={["Stryker was here"]}
       maxTagTextLength={8}
       maxTagCount={2}

[Survived] ObjectLiteral
commons/diagram/filter/FilterByTag.tsx:33:14
       maxTagCount={2}
       mode="multiple"
       placeholder="Filter"
-      style={{borderRadius: '3px '}}
+      style={{}}
       onSelect={() => {}}
       options={options}
