[NoCoverage] BlockStatement
commons/diagram/modals/EditHttpNodeModal.tsx:30:70
   const requestBodyRef = useRef<ResizableTextAreaRef>(null);
   const responseBodyRef = useRef<ResizableTextAreaRef>(null);
 
-  const handleCopy = (ref: React.RefObject<ResizableTextAreaRef>) => {
-    if (ref.current) {
-      copyToClipboard(ref.current.resizableTextArea.textArea.textContent);
-    }
-  };
+  const handleCopy = (ref: React.RefObject<ResizableTextAreaRef>) => {};
 
   const editHttpNodeModal = useUnit($editHttpNodeModal);

[NoCoverage] ConditionalExpression
commons/diagram/modals/EditHttpNodeModal.tsx:31:9
   const responseBodyRef = useRef<ResizableTextAreaRef>(null);
 
   const handleCopy = (ref: React.RefObject<ResizableTextAreaRef>) => {
-    if (ref.current) {
+    if (false) {
       copyToClipboard(ref.current.resizableTextArea.textArea.textContent);
     }

[NoCoverage] ConditionalExpression
commons/diagram/modals/EditHttpNodeModal.tsx:31:9
   const responseBodyRef = useRef<ResizableTextAreaRef>(null);
 
   const handleCopy = (ref: React.RefObject<ResizableTextAreaRef>) => {
-    if (ref.current) {
+    if (true) {
       copyToClipboard(ref.current.resizableTextArea.textArea.textContent);
     }

[Survived] BlockStatement
commons/diagram/modals/EditHttpNodeModal.tsx:50:19
     methodType: 'GET',
   });
 
-  useEffect(() => {
-    if (isOpen && eventGraph) {
-      const node = eventGraph.nodes.find(n => n.id === nodeId);
-      if (node) {
-        setNodeData(node);
-      }
-    }
-  }, [isOpen, eventGraph, nodeId]);
+  useEffect(() => {}, [isOpen, eventGraph, nodeId]);
 
   const handleChange =

[Survived] ConditionalExpression
commons/diagram/modals/EditHttpNodeModal.tsx:51:9
   });
 
   useEffect(() => {
-    if (isOpen && eventGraph) {
+    if (true) {
       const node = eventGraph.nodes.find(n => n.id === nodeId);
       if (node) {

[Survived] ConditionalExpression
commons/diagram/modals/EditHttpNodeModal.tsx:51:9
   });
 
   useEffect(() => {
-    if (isOpen && eventGraph) {
+    if (false) {
       const node = eventGraph.nodes.find(n => n.id === nodeId);
       if (node) {

[NoCoverage] ArrowFunction
commons/diagram/modals/EditHttpNodeModal.tsx:52:42
 
   useEffect(() => {
     if (isOpen && eventGraph) {
-      const node = eventGraph.nodes.find(n => n.id === nodeId);
+      const node = eventGraph.nodes.find(() => undefined);
       if (node) {
         setNodeData(node);

[NoCoverage] EqualityOperator
commons/diagram/modals/EditHttpNodeModal.tsx:52:47
 
   useEffect(() => {
     if (isOpen && eventGraph) {
-      const node = eventGraph.nodes.find(n => n.id === nodeId);
+      const node = eventGraph.nodes.find(n => n.id !== nodeId);
       if (node) {
         setNodeData(node);

[NoCoverage] ConditionalExpression
commons/diagram/modals/EditHttpNodeModal.tsx:53:11
   useEffect(() => {
     if (isOpen && eventGraph) {
       const node = eventGraph.nodes.find(n => n.id === nodeId);
-      if (node) {
+      if (true) {
         setNodeData(node);
       }

[NoCoverage] BlockStatement
commons/diagram/modals/EditHttpNodeModal.tsx:53:17
   useEffect(() => {
     if (isOpen && eventGraph) {
       const node = eventGraph.nodes.find(n => n.id === nodeId);
-      if (node) {
-        setNodeData(node);
-      }
+      if (node) {}
     }
   }, [isOpen, eventGraph, nodeId]);

[Survived] ArrayDeclaration
commons/diagram/modals/EditHttpNodeModal.tsx:57:6
         setNodeData(node);
       }
     }
-  }, [isOpen, eventGraph, nodeId]);
+  }, []);
 
   const handleChange =

[NoCoverage] BlockStatement
commons/diagram/modals/EditHttpNodeModal.tsx:60:106
   }, [isOpen, eventGraph, nodeId]);
 
   const handleChange =
-    (field: keyof NodeDTO) => (e: React.ChangeEvent<HTMLInputElement | HTMLTextAreaElement> | string) => {
-      if (typeof e === 'string') {
-        setNodeData({...nodeData, [field]: e});
-      } else {
-        setNodeData({...nodeData, [field]: e.target.value});
-      }
-    };
+    (field: keyof NodeDTO) => (e: React.ChangeEvent<HTMLInputElement | HTMLTextAreaElement> | string) => {};
 
   const handleSave = () => {

[NoCoverage] BlockStatement
commons/diagram/modals/EditHttpNodeModal.tsx:61:34
 
   const handleChange =
     (field: keyof NodeDTO) => (e: React.ChangeEvent<HTMLInputElement | HTMLTextAreaElement> | string) => {
-      if (typeof e === 'string') {
-        setNodeData({...nodeData, [field]: e});
-      } else {
+      if (typeof e === 'string') {} else {
         setNodeData({...nodeData, [field]: e.target.value});
       }

[NoCoverage] BlockStatement
commons/diagram/modals/EditHttpNodeModal.tsx:63:14
     (field: keyof NodeDTO) => (e: React.ChangeEvent<HTMLInputElement | HTMLTextAreaElement> | string) => {
       if (typeof e === 'string') {
         setNodeData({...nodeData, [field]: e});
-      } else {
-        setNodeData({...nodeData, [field]: e.target.value});
-      }
+      } else {}
     };
 

[NoCoverage] BlockStatement
commons/diagram/modals/EditHttpNodeModal.tsx:68:28
       }
     };
 
-  const handleSave = () => {
-    editNode({id: nodeId, updates: nodeData});
-    closeEditHttpNodeModal();
-  };
+  const handleSave = () => {};
 
   return (

[Survived] StringLiteral
commons/diagram/modals/EditHttpNodeModal.tsx:81:24
       onClose={closeEditHttpNodeModal}
       placement="right"
       defaultFooterProps={{
-        cancelBtnText: 'Cancel',
+        cancelBtnText: "",
         acceptBtnText: 'Save',
         onAccept: handleSave,

[Survived] StringLiteral
commons/diagram/modals/EditHttpNodeModal.tsx:130:33
             Request body
             <span className="flex gap-3">
               <Copy
-                className={clsx('cursor-pointer hover:opacity-70', 'flex h-6 w-6 items-center justify-center p-1')}
+                className={clsx("", 'flex h-6 w-6 items-center justify-center p-1')}
                 size={14}
                 onClick={() => handleCopy(requestBodyRef)}

[Survived] ArrowFunction
commons/diagram/modals/EditHttpNodeModal.tsx:132:26
               <Copy
                 className={clsx('cursor-pointer hover:opacity-70', 'flex h-6 w-6 items-center justify-center p-1')}
                 size={14}
-                onClick={() => handleCopy(requestBodyRef)}
+                onClick={() => undefined}
               />
               <ExternalLink

[Survived] ArrowFunction
commons/diagram/modals/EditHttpNodeModal.tsx:155:26
               <Copy
                 className={clsx('cursor-pointer hover:opacity-70', 'flex h-6 w-6 items-center justify-center p-1')}
                 size={14}
-                onClick={() => handleCopy(responseBodyRef)}
+                onClick={() => undefined}
               />
               <ExternalLink

[Survived] StringLiteral
commons/diagram/modals/EditHttpNodeModal.tsx:158:33
                 onClick={() => handleCopy(responseBodyRef)}
               />
               <ExternalLink
-                className={clsx('cursor-pointer hover:opacity-70', 'flex h-6 w-6 items-center justify-center p-1')}
+                className={clsx("", 'flex h-6 w-6 items-center justify-center p-1')}
                 size={14}
               />

[Survived] StringLiteral
commons/diagram/modals/EditHttpNodeModal.tsx:158:68
                 onClick={() => handleCopy(responseBodyRef)}
               />
               <ExternalLink
-                className={clsx('cursor-pointer hover:opacity-70', 'flex h-6 w-6 items-center justify-center p-1')}
+                className={clsx('cursor-pointer hover:opacity-70', "")}
                 size={14}
               />
