[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:17:55
 
 const CollapseDataRow = ({title, value}: {title?: string; value?: string}) => (
   <div className={clsx('max-w-100% flex min-h-[1.25rem] gap-4', 'text-sm-normal align-middle')}>
-    <div className="text-text-tertiary w-[5.625rem]">{title || null}</div>
+    <div className="text-text-tertiary w-[5.625rem]">{true}</div>
     <div className="w-[12.5rem] overflow-hidden text-ellipsis whitespace-nowrap">{value || null}</div>
   </div>

[NoCoverage] LogicalOperator
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:17:55
 
 const CollapseDataRow = ({title, value}: {title?: string; value?: string}) => (
   <div className={clsx('max-w-100% flex min-h-[1.25rem] gap-4', 'text-sm-normal align-middle')}>
-    <div className="text-text-tertiary w-[5.625rem]">{title || null}</div>
+    <div className="text-text-tertiary w-[5.625rem]">{title && null}</div>
     <div className="w-[12.5rem] overflow-hidden text-ellipsis whitespace-nowrap">{value || null}</div>
   </div>

[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:18:83
 const CollapseDataRow = ({title, value}: {title?: string; value?: string}) => (
   <div className={clsx('max-w-100% flex min-h-[1.25rem] gap-4', 'text-sm-normal align-middle')}>
     <div className="text-text-tertiary w-[5.625rem]">{title || null}</div>
-    <div className="w-[12.5rem] overflow-hidden text-ellipsis whitespace-nowrap">{value || null}</div>
+    <div className="w-[12.5rem] overflow-hidden text-ellipsis whitespace-nowrap">{true}</div>
   </div>
 );

[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:18:83
 const CollapseDataRow = ({title, value}: {title?: string; value?: string}) => (
   <div className={clsx('max-w-100% flex min-h-[1.25rem] gap-4', 'text-sm-normal align-middle')}>
     <div className="text-text-tertiary w-[5.625rem]">{title || null}</div>
-    <div className="w-[12.5rem] overflow-hidden text-ellipsis whitespace-nowrap">{value || null}</div>
+    <div className="w-[12.5rem] overflow-hidden text-ellipsis whitespace-nowrap">{false}</div>
   </div>
 );

[NoCoverage] ArrowFunction
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:23:53
 );
 
 export const InfoPanelCollapse: FC<ICollapseProps> = ({data}) => {
-  const items: NCollapse.TCollapseItem[] = data.map(node => ({
-    children: node?.events?.map(event => (
-      <div className="flex flex-col gap-1">
-        <div className="text-sm-strong flex h-[1.375rem] gap-2">
-          <CodeDots size={20} />
-          {event?.name}
-        </div>
-        <div className="flex flex-col align-middle">
-          <CollapseDataRow title="description" value={event?.eventDescription} />
-          <CollapseDataRow title="type" value={event?.eventType} />
-        </div>
-      </div>
-    )),
-    key: node.id,
-    label: (
-      <div className="flex items-center gap-2">
-        <Icon size={20} icon={node.brokerType ? IconMap[node.brokerType] : IconMap[node.type]} />
-        <div className="overflow-hidden text-ellipsis whitespace-nowrap">{node?.name}</div>
-      </div>
-    ),
-    className: 'bg-fill-alter rounded-none',
-  }));
+  const items: NCollapse.TCollapseItem[] = data.map(() => undefined);
 
   return (

[NoCoverage] OptionalChaining
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:24:15
 
 export const InfoPanelCollapse: FC<ICollapseProps> = ({data}) => {
   const items: NCollapse.TCollapseItem[] = data.map(node => ({
-    children: node?.events?.map(event => (
+    children: node.events?.map(event => (
       <div className="flex flex-col gap-1">
         <div className="text-sm-strong flex h-[1.375rem] gap-2">

[NoCoverage] ArrowFunction
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:24:33
 
 export const InfoPanelCollapse: FC<ICollapseProps> = ({data}) => {
   const items: NCollapse.TCollapseItem[] = data.map(node => ({
-    children: node?.events?.map(event => (
-      <div className="flex flex-col gap-1">
-        <div className="text-sm-strong flex h-[1.375rem] gap-2">
-          <CodeDots size={20} />
-          {event?.name}
-        </div>
-        <div className="flex flex-col align-middle">
-          <CollapseDataRow title="description" value={event?.eventDescription} />
-          <CollapseDataRow title="type" value={event?.eventType} />
-        </div>
-      </div>
-    )),
+    children: node?.events?.map(() => undefined),
     key: node.id,
     label: (

[NoCoverage] OptionalChaining
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:28:12
       <div className="flex flex-col gap-1">
         <div className="text-sm-strong flex h-[1.375rem] gap-2">
           <CodeDots size={20} />
-          {event?.name}
+          {event.name}
         </div>
         <div className="flex flex-col align-middle">

[NoCoverage] OptionalChaining
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:31:55
           {event?.name}
         </div>
         <div className="flex flex-col align-middle">
-          <CollapseDataRow title="description" value={event?.eventDescription} />
+          <CollapseDataRow title="description" value={event.eventDescription} />
           <CollapseDataRow title="type" value={event?.eventType} />
         </div>

[NoCoverage] OptionalChaining
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:32:48
         </div>
         <div className="flex flex-col align-middle">
           <CollapseDataRow title="description" value={event?.eventDescription} />
-          <CollapseDataRow title="type" value={event?.eventType} />
+          <CollapseDataRow title="type" value={event.eventType} />
         </div>
       </div>

[NoCoverage] OptionalChaining
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:40:75
     label: (
       <div className="flex items-center gap-2">
         <Icon size={20} icon={node.brokerType ? IconMap[node.brokerType] : IconMap[node.type]} />
-        <div className="overflow-hidden text-ellipsis whitespace-nowrap">{node?.name}</div>
+        <div className="overflow-hidden text-ellipsis whitespace-nowrap">{node.name}</div>
       </div>
     ),

[NoCoverage] StringLiteral
diagram/modals/info-panel-modal/InfoPanelCollapse.tsx:43:16
         <div className="overflow-hidden text-ellipsis whitespace-nowrap">{node?.name}</div>
       </div>
     ),
-    className: 'bg-fill-alter rounded-none',
+    className: "",
   }));
 
