[NoCoverage] ArrowFunction
commons/diagram/model/DiagramModel.ts:44:52
  */
 export const $ghostNodes = createStore<Node[]>([])
   .on(setGhostNodes, (_, nodes) => nodes)
-  .on(removeGhostNode, (nodes, id) => nodes.filter(node => node.id !== id))
+  .on(removeGhostNode, (nodes, id) => nodes.filter(() => undefined))
   .reset(clearGhostNodes);
 

[NoCoverage] ConditionalExpression
commons/diagram/model/DiagramModel.ts:44:60
  */
 export const $ghostNodes = createStore<Node[]>([])
   .on(setGhostNodes, (_, nodes) => nodes)
-  .on(removeGhostNode, (nodes, id) => nodes.filter(node => node.id !== id))
+  .on(removeGhostNode, (nodes, id) => nodes.filter(node => false))
   .reset(clearGhostNodes);
 

[Survived] BlockStatement
commons/diagram/model/DiagramModel.ts:61:81
     const currentNodes = $nodes.getState();
     const ghostNodes = $ghostNodes.getState();
     const expandableItems = $expandableItems.getState();
-    applyLayout(data, currentNodes, expandableItems, ghostNodes).then(result => {
-      setNodes(result.nodes);
-      setEdges(result.edges);
-    });
+    applyLayout(data, currentNodes, expandableItems, ghostNodes).then(result => {});
   } else {
     clearNodes();

[NoCoverage] BlockStatement
commons/diagram/model/DiagramModel.ts:65:10
       setNodes(result.nodes);
       setEdges(result.edges);
     });
-  } else {
-    clearNodes();
-    clearEdges();
-  }
+  } else {}
 });
 

[NoCoverage] ArrowFunction
commons/diagram/model/DiagramModel.ts:76:52
   clock: removeNodes,
   source: $ghostNodes,
   fn: (ghostNodes, deletingNodeIds) => {
-    const deletingNodes = $nodes.getState().filter(node => deletingNodeIds.includes(node.id));
+    const deletingNodes = $nodes.getState().filter(() => undefined);
 
     const adaptedNodes = deletingNodes.map(deletingNode => adaptGhostNode(deletingNode));

[NoCoverage] MethodExpression
commons/diagram/model/DiagramModel.ts:76:27
   clock: removeNodes,
   source: $ghostNodes,
   fn: (ghostNodes, deletingNodeIds) => {
-    const deletingNodes = $nodes.getState().filter(node => deletingNodeIds.includes(node.id));
+    const deletingNodes = $nodes.getState();
 
     const adaptedNodes = deletingNodes.map(deletingNode => adaptGhostNode(deletingNode));

[NoCoverage] ArrowFunction
commons/diagram/model/DiagramModel.ts:78:44
   fn: (ghostNodes, deletingNodeIds) => {
     const deletingNodes = $nodes.getState().filter(node => deletingNodeIds.includes(node.id));
 
-    const adaptedNodes = deletingNodes.map(deletingNode => adaptGhostNode(deletingNode));
+    const adaptedNodes = deletingNodes.map(() => undefined);
 
     return [...ghostNodes, ...adaptedNodes];

[NoCoverage] MethodExpression
commons/diagram/model/DiagramModel.ts:94:27
   },
   fn: ({allEdges, ghostNodes}, deletingLinkIds) => {
     // Получаем связи, которые удаляются
-    const deletingEdges = allEdges.filter(edge => deletingLinkIds.includes(edge.id));
+    const deletingEdges = allEdges;
 
     // Находим все "призрачные" узлы, связанные с удаляемыми связями

[NoCoverage] ArrowFunction
commons/diagram/model/DiagramModel.ts:94:43
   },
   fn: ({allEdges, ghostNodes}, deletingLinkIds) => {
     // Получаем связи, которые удаляются
-    const deletingEdges = allEdges.filter(edge => deletingLinkIds.includes(edge.id));
+    const deletingEdges = allEdges.filter(() => undefined);
 
     // Находим все "призрачные" узлы, связанные с удаляемыми связями

[NoCoverage] MethodExpression
commons/diagram/model/DiagramModel.ts:97:35
     const deletingEdges = allEdges.filter(edge => deletingLinkIds.includes(edge.id));
 
     // Находим все "призрачные" узлы, связанные с удаляемыми связями
-    const potentialGhostNodeIds = deletingEdges
-      .map(edge => getRelatedGhostNodeId(ghostNodes, edge.source, edge.target))
-      .filter(Boolean);
+    const potentialGhostNodeIds = deletingEdges.map(edge => getRelatedGhostNodeId(ghostNodes, edge.source, edge.target));
 
     // Оставляем только те "призрачные" узлы, которые больше нигде не используются

[NoCoverage] ArrowFunction
commons/diagram/model/DiagramModel.ts:98:12
 
     // Находим все "призрачные" узлы, связанные с удаляемыми связями
     const potentialGhostNodeIds = deletingEdges
-      .map(edge => getRelatedGhostNodeId(ghostNodes, edge.source, edge.target))
+      .map(() => undefined)
       .filter(Boolean);
 

[NoCoverage] MethodExpression
commons/diagram/model/DiagramModel.ts:102:32
       .filter(Boolean);
 
     // Оставляем только те "призрачные" узлы, которые больше нигде не используются
-    const unusedGhostNodeIds = potentialGhostNodeIds.filter(
-      ghostId =>
-        !allEdges.some(
-          edge =>
-            !deletingLinkIds.includes(edge.id) && // Не среди удаляемых связей
-            (edge.source === ghostId || edge.target === ghostId) // Используется в других связях
-        )
-    );
+    const unusedGhostNodeIds = potentialGhostNodeIds;
 
     return ghostNodes.filter(node => !unusedGhostNodeIds.includes(node.id));

[NoCoverage] ArrowFunction
commons/diagram/model/DiagramModel.ts:103:7
 
     // Оставляем только те "призрачные" узлы, которые больше нигде не используются
     const unusedGhostNodeIds = potentialGhostNodeIds.filter(
-      ghostId =>
-        !allEdges.some(
-          edge =>
-            !deletingLinkIds.includes(edge.id) && // Не среди удаляемых связей
-            (edge.source === ghostId || edge.target === ghostId) // Используется в других связях
-        )
+      () => undefined
     );
 

[NoCoverage] MethodExpression
commons/diagram/model/DiagramModel.ts:104:10
     // Оставляем только те "призрачные" узлы, которые больше нигде не используются
     const unusedGhostNodeIds = potentialGhostNodeIds.filter(
       ghostId =>
-        !allEdges.some(
-          edge =>
-            !deletingLinkIds.includes(edge.id) && // Не среди удаляемых связей
-            (edge.source === ghostId || edge.target === ghostId) // Используется в других связях
-        )
+        !allEdges.every(edge => !deletingLinkIds.includes(edge.id) && (
+// Не среди удаляемых связей
+edge.source === ghostId || edge.target === ghostId) // Используется в других связях
+)
     );
 

[NoCoverage] BooleanLiteral
commons/diagram/model/DiagramModel.ts:104:9
     // Оставляем только те "призрачные" узлы, которые больше нигде не используются
     const unusedGhostNodeIds = potentialGhostNodeIds.filter(
       ghostId =>
-        !allEdges.some(
-          edge =>
-            !deletingLinkIds.includes(edge.id) && // Не среди удаляемых связей
-            (edge.source === ghostId || edge.target === ghostId) // Используется в других связях
-        )
+        allEdges.some(edge => !deletingLinkIds.includes(edge.id) && (
+// Не среди удаляемых связей
+edge.source === ghostId || edge.target === ghostId) // Используется в других связях
+)
     );
 

[NoCoverage] ArrowFunction
commons/diagram/model/DiagramModel.ts:105:11
     const unusedGhostNodeIds = potentialGhostNodeIds.filter(
       ghostId =>
         !allEdges.some(
-          edge =>
-            !deletingLinkIds.includes(edge.id) && // Не среди удаляемых связей
-            (edge.source === ghostId || edge.target === ghostId) // Используется в других связях
+          () => undefined // Используется в других связях
         )
     );

[NoCoverage] LogicalOperator
commons/diagram/model/DiagramModel.ts:106:13
       ghostId =>
         !allEdges.some(
           edge =>
-            !deletingLinkIds.includes(edge.id) && // Не среди удаляемых связей
-            (edge.source === ghostId || edge.target === ghostId) // Используется в других связях
+            !deletingLinkIds.includes(edge.id) ||
+// Не среди удаляемых связей
+edge.source === ghostId || edge.target === ghostId // Используется в других связях
         )
     );

[NoCoverage] BooleanLiteral
commons/diagram/model/DiagramModel.ts:106:13
       ghostId =>
         !allEdges.some(
           edge =>
-            !deletingLinkIds.includes(edge.id) && // Не среди удаляемых связей
+            deletingLinkIds.includes(edge.id) && // Не среди удаляемых связей
             (edge.source === ghostId || edge.target === ghostId) // Используется в других связях
         )

[NoCoverage] EqualityOperator
commons/diagram/model/DiagramModel.ts:107:14
         !allEdges.some(
           edge =>
             !deletingLinkIds.includes(edge.id) && // Не среди удаляемых связей
-            (edge.source === ghostId || edge.target === ghostId) // Используется в других связях
+            (edge.source !== ghostId || edge.target === ghostId) // Используется в других связях
         )
     );

[NoCoverage] ConditionalExpression
commons/diagram/model/DiagramModel.ts:107:41
         !allEdges.some(
           edge =>
             !deletingLinkIds.includes(edge.id) && // Не среди удаляемых связей
-            (edge.source === ghostId || edge.target === ghostId) // Используется в других связях
+            (edge.source === ghostId || false) // Используется в других связях
         )
     );

[NoCoverage] BooleanLiteral
commons/diagram/model/DiagramModel.ts:111:38
         )
     );
 
-    return ghostNodes.filter(node => !unusedGhostNodeIds.includes(node.id));
+    return ghostNodes.filter(node => unusedGhostNodeIds.includes(node.id));
   },
   target: $ghostNodes,

[NoCoverage] ArrowFunction
commons/diagram/model/DiagramModel.ts:111:30
         )
     );
 
-    return ghostNodes.filter(node => !unusedGhostNodeIds.includes(node.id));
+    return ghostNodes.filter(() => undefined);
   },
   target: $ghostNodes,

[NoCoverage] BlockStatement
commons/diagram/model/DiagramModel.ts:125:27
 sample({
   clock: [expandItemByTopicId, shrinkItemByTopicId],
   source: $eventGraph,
-  fn: async eventGraph => {
-    const currentNodes = $nodes.getState();
-    const expandableItems = $expandableItems.getState();
-    applyLayout(eventGraph, currentNodes, expandableItems).then(result => {
-      setNodes(result.nodes);
-      setEdges(result.edges);
-    });
-  },
+  fn: async eventGraph => {},
 });
 

[NoCoverage] BlockStatement
commons/diagram/model/DiagramModel.ts:128:75
   fn: async eventGraph => {
     const currentNodes = $nodes.getState();
     const expandableItems = $expandableItems.getState();
-    applyLayout(eventGraph, currentNodes, expandableItems).then(result => {
-      setNodes(result.nodes);
-      setEdges(result.edges);
-    });
+    applyLayout(eventGraph, currentNodes, expandableItems).then(result => {});
   },
 });
