[NoCoverage] ConditionalExpression
commons/diagram/model/ExpandableItemsModel.ts:17:32
 export const $expandableItems = createStore<TExpandableItem[]>([])
   .on(setExpandableItem, (_, expandableItems) => expandableItems)
   .on(expandItemByTopicId, (expandableItems, topicId) =>
-    expandableItems.map(el => (el.topicId === topicId ? {...el, isExpanded: true} : el))
+    expandableItems.map(el => (false ? {...el, isExpanded: true} : el))
   )
   .on(shrinkItemByTopicId, (expandableTopics, topicId) =>

[NoCoverage] EqualityOperator
commons/diagram/model/ExpandableItemsModel.ts:17:32
 export const $expandableItems = createStore<TExpandableItem[]>([])
   .on(setExpandableItem, (_, expandableItems) => expandableItems)
   .on(expandItemByTopicId, (expandableItems, topicId) =>
-    expandableItems.map(el => (el.topicId === topicId ? {...el, isExpanded: true} : el))
+    expandableItems.map(el => (el.topicId !== topicId ? {...el, isExpanded: true} : el))
   )
   .on(shrinkItemByTopicId, (expandableTopics, topicId) =>

[NoCoverage] ArrowFunction
commons/diagram/model/ExpandableItemsModel.ts:20:26
     expandableItems.map(el => (el.topicId === topicId ? {...el, isExpanded: true} : el))
   )
   .on(shrinkItemByTopicId, (expandableTopics, topicId) =>
-    expandableTopics.map(el => (el.topicId === topicId ? {...el, isExpanded: false} : el))
+    expandableTopics.map(() => undefined)
   )
   .reset(clearExpandableItems);

[NoCoverage] ConditionalExpression
commons/diagram/model/ExpandableItemsModel.ts:20:33
     expandableItems.map(el => (el.topicId === topicId ? {...el, isExpanded: true} : el))
   )
   .on(shrinkItemByTopicId, (expandableTopics, topicId) =>
-    expandableTopics.map(el => (el.topicId === topicId ? {...el, isExpanded: false} : el))
+    expandableTopics.map(el => (false ? {...el, isExpanded: false} : el))
   )
   .reset(clearExpandableItems);

[Survived] BlockStatement
commons/diagram/model/ExpandableItemsModel.ts:25:27
   .reset(clearExpandableItems);
 
 // При любом изменении графа пересчитываем расширяемые элементы
-$eventGraph.watch(data => {
-  if (data) {
-    const existingExpandableItems = $expandableItems.getState();
-    setExpandableItem(getExpandableItems(data, existingExpandableItems));
-  } else {
-    clearExpandableItems();
-  }
-});
+$eventGraph.watch(data => {});
 

[Survived] ConditionalExpression
commons/diagram/model/ExpandableItemsModel.ts:26:7
 
 // При любом изменении графа пересчитываем расширяемые элементы
 $eventGraph.watch(data => {
-  if (data) {
+  if (true) {
     const existingExpandableItems = $expandableItems.getState();
     setExpandableItem(getExpandableItems(data, existingExpandableItems));

[Survived] ConditionalExpression
commons/diagram/model/ExpandableItemsModel.ts:26:7
 
 // При любом изменении графа пересчитываем расширяемые элементы
 $eventGraph.watch(data => {
-  if (data) {
+  if (false) {
     const existingExpandableItems = $expandableItems.getState();
     setExpandableItem(getExpandableItems(data, existingExpandableItems));

[NoCoverage] BlockStatement
commons/diagram/model/ExpandableItemsModel.ts:29:10
   if (data) {
     const existingExpandableItems = $expandableItems.getState();
     setExpandableItem(getExpandableItems(data, existingExpandableItems));
-  } else {
-    clearExpandableItems();
-  }
+  } else {}
 });
 
