[NoCoverage] ConditionalExpression
commons/diagram/model/FilterTagsModel.ts:11:67
 // Стор состояния фильтра по тегу
 export const $filterTags = createStore<string[]>([])
   .on(addTagToFilter, (tags, payload) => (tags.includes(payload) ? tags : [...tags, payload]))
-  .on(removeTagFromFilter, (tags, payload) => tags.filter(item => item !== payload))
+  .on(removeTagFromFilter, (tags, payload) => tags.filter(item => false))
   .on(setTags, (_, payload) => [...payload])
   .reset(resetFilter);

[NoCoverage] ArrowFunction
commons/diagram/model/FilterTagsModel.ts:11:59
 // Стор состояния фильтра по тегу
 export const $filterTags = createStore<string[]>([])
   .on(addTagToFilter, (tags, payload) => (tags.includes(payload) ? tags : [...tags, payload]))
-  .on(removeTagFromFilter, (tags, payload) => tags.filter(item => item !== payload))
+  .on(removeTagFromFilter, (tags, payload) => tags.filter(() => undefined))
   .on(setTags, (_, payload) => [...payload])
   .reset(resetFilter);
