[NoCoverage] ArrayDeclaration
commons/diagram/model/HiddenItemsModel.ts:17:43
 
 // Стор для отслеживания скрытых элементов. Является массивом id элементов
 export const $hiddenItems = createStore<string[]>([])
-  .on(hideItem, (hiddenItems, payload) => [...hiddenItems, payload])
+  .on(hideItem, (hiddenItems, payload) => [])
   .on(showItem, (hiddenItems, payload) => hiddenItems.filter(item => item !== payload))
   .on(hideItems, (_, payload) => [...payload])

[NoCoverage] ArrowFunction
commons/diagram/model/HiddenItemsModel.ts:18:62
 // Стор для отслеживания скрытых элементов. Является массивом id элементов
 export const $hiddenItems = createStore<string[]>([])
   .on(hideItem, (hiddenItems, payload) => [...hiddenItems, payload])
-  .on(showItem, (hiddenItems, payload) => hiddenItems.filter(item => item !== payload))
+  .on(showItem, (hiddenItems, payload) => hiddenItems.filter(() => undefined))
   .on(hideItems, (_, payload) => [...payload])
   .on(hideNodes, (hiddenItems, payload) => [...hiddenItems, ...payload])

[NoCoverage] ConditionalExpression
commons/diagram/model/HiddenItemsModel.ts:18:70
 // Стор для отслеживания скрытых элементов. Является массивом id элементов
 export const $hiddenItems = createStore<string[]>([])
   .on(hideItem, (hiddenItems, payload) => [...hiddenItems, payload])
-  .on(showItem, (hiddenItems, payload) => hiddenItems.filter(item => item !== payload))
+  .on(showItem, (hiddenItems, payload) => hiddenItems.filter(item => true))
   .on(hideItems, (_, payload) => [...payload])
   .on(hideNodes, (hiddenItems, payload) => [...hiddenItems, ...payload])

[NoCoverage] MethodExpression
commons/diagram/model/HiddenItemsModel.ts:21:44
   .on(showItem, (hiddenItems, payload) => hiddenItems.filter(item => item !== payload))
   .on(hideItems, (_, payload) => [...payload])
   .on(hideNodes, (hiddenItems, payload) => [...hiddenItems, ...payload])
-  .on(showNodes, (hiddenItems, payload) => hiddenItems.filter(item => !payload.includes(item)))
+  .on(showNodes, (hiddenItems, payload) => hiddenItems)
   .reset(showAll);
 

[NoCoverage] ArrowFunction
commons/diagram/model/HiddenItemsModel.ts:21:63
   .on(showItem, (hiddenItems, payload) => hiddenItems.filter(item => item !== payload))
   .on(hideItems, (_, payload) => [...payload])
   .on(hideNodes, (hiddenItems, payload) => [...hiddenItems, ...payload])
-  .on(showNodes, (hiddenItems, payload) => hiddenItems.filter(item => !payload.includes(item)))
+  .on(showNodes, (hiddenItems, payload) => hiddenItems.filter(() => undefined))
   .reset(showAll);
 

[NoCoverage] ConditionalExpression
commons/diagram/model/HiddenItemsModel.ts:26:7
 
 // Вспомогательная функция для проверки совпадения тегов
 const hasMatchingTag = (item: EventDTO | NodeDTO | null, tags: string[]): boolean => {
-  if (!item?.tags) return false;
+  if (false) return false;
 
   // Проверяем, есть ли хотя бы один общий тег между элементом и переданными тегами

[NoCoverage] ConditionalExpression
commons/diagram/model/HiddenItemsModel.ts:26:7
 
 // Вспомогательная функция для проверки совпадения тегов
 const hasMatchingTag = (item: EventDTO | NodeDTO | null, tags: string[]): boolean => {
-  if (!item?.tags) return false;
+  if (true) return false;
 
   // Проверяем, есть ли хотя бы один общий тег между элементом и переданными тегами

[NoCoverage] MethodExpression
commons/diagram/model/HiddenItemsModel.ts:29:10
   if (!item?.tags) return false;
 
   // Проверяем, есть ли хотя бы один общий тег между элементом и переданными тегами
-  return item.tags.some(tag => tags.includes(tag));
+  return item.tags.every(tag => tags.includes(tag));
 };
 

[NoCoverage] ArrowFunction
commons/diagram/model/HiddenItemsModel.ts:29:25
   if (!item?.tags) return false;
 
   // Проверяем, есть ли хотя бы один общий тег между элементом и переданными тегами
-  return item.tags.some(tag => tags.includes(tag));
+  return item.tags.some(() => undefined);
 };
 

[NoCoverage] ConditionalExpression
commons/diagram/model/HiddenItemsModel.ts:37:9
   clock: $filterTags, // Триггерится при изменении фильтра тегов
   source: $eventGraph,
   fn: (graph, tags) => {
-    if (tags.length === 0) return [];
+    if (true) return [];
 
     const filterItems = (items: (NodeDTO | EventDTO | null)[]) =>

[NoCoverage] ConditionalExpression
commons/diagram/model/HiddenItemsModel.ts:37:9
   clock: $filterTags, // Триггерится при изменении фильтра тегов
   source: $eventGraph,
   fn: (graph, tags) => {
-    if (tags.length === 0) return [];
+    if (false) return [];
 
     const filterItems = (items: (NodeDTO | EventDTO | null)[]) =>

[NoCoverage] MethodExpression
commons/diagram/model/HiddenItemsModel.ts:40:7
     if (tags.length === 0) return [];
 
     const filterItems = (items: (NodeDTO | EventDTO | null)[]) =>
-      items.filter(item => item && !hasMatchingTag(item, tags));
+      items;
 
     // Фильтруем узлы и события, оставляя только те, у которых нет нужных тегов

[NoCoverage] BooleanLiteral
commons/diagram/model/HiddenItemsModel.ts:40:36
     if (tags.length === 0) return [];
 
     const filterItems = (items: (NodeDTO | EventDTO | null)[]) =>
-      items.filter(item => item && !hasMatchingTag(item, tags));
+      items.filter(item => item && hasMatchingTag(item, tags));
 
     // Фильтруем узлы и события, оставляя только те, у которых нет нужных тегов

[NoCoverage] ArrowFunction
commons/diagram/model/HiddenItemsModel.ts:46:36
     const nodesWithoutTag = filterItems(graph.nodes);
     const eventsWithoutTag = filterItems(graph.events);
 
-    return [...nodesWithoutTag.map(node => node.id), ...eventsWithoutTag.map(event => event.id)];
+    return [...nodesWithoutTag.map(() => undefined), ...eventsWithoutTag.map(event => event.id)];
   },
   target: hideItems,

[NoCoverage] ArrowFunction
commons/diagram/model/HiddenItemsModel.ts:46:78
     const nodesWithoutTag = filterItems(graph.nodes);
     const eventsWithoutTag = filterItems(graph.events);
 
-    return [...nodesWithoutTag.map(node => node.id), ...eventsWithoutTag.map(event => event.id)];
+    return [...nodesWithoutTag.map(node => node.id), ...eventsWithoutTag.map(() => undefined)];
   },
   target: hideItems,

[NoCoverage] ConditionalExpression
commons/diagram/model/HiddenItemsModel.ts:54:19
 // Эффект для показа всех элементов, когда нет выбранных тегов
 sample({
   clock: $filterTags, // Триггерится при изменении фильтра тегов
-  filter: tags => tags.length === 0,
+  filter: tags => false,
   target: showAll,
 });

[NoCoverage] EqualityOperator
commons/diagram/model/HiddenItemsModel.ts:54:19
 // Эффект для показа всех элементов, когда нет выбранных тегов
 sample({
   clock: $filterTags, // Триггерится при изменении фильтра тегов
-  filter: tags => tags.length === 0,
+  filter: tags => tags.length !== 0,
   target: showAll,
 });
