[NoCoverage] BooleanLiteral
model/modals-models/delete-items-modal/DeleteItemsModalModel.ts:10:13
   isOpen: false,
 })
   .on(openDeleteItemsModal, () => ({
-    isOpen: true,
+    isOpen: false,
   }))
   .reset(closeDeleteItemsModal);
