[NoCoverage] BooleanLiteral
model/modals-models/delete-selected-items-modal/DeleteSelectedItemsModal.ts:11:13
   selectedItemIds: [],
 })
   .on(openDeleteSelectedItemsModal, (_, payload) => ({
-    isOpen: true,
+    isOpen: false,
     selectedItemIds: [...payload],
   }))
