[NoCoverage] BooleanLiteral
model/modals-models/drawer-add-link/DrawerAddLinkModel.ts:11:13
   itemId: '',
 })
   .on(openDrawerAddLink, (_, payload) => ({
-    isOpen: true,
+    isOpen: false,
     itemId: payload,
   }))
