[NoCoverage] BooleanLiteral
model/modals-models/drawer-create-event/DrawerCreateEventModel.ts:11:13
   eventId: null,
 })
   .on(openDrawerCreateEvent, (_, payload) => ({
-    isOpen: true,
+    isOpen: false,
     eventId: payload,
   }))
