[Killed] BooleanLiteral
model/modals-models/drawer-edit-link/DrawerEditLinkModel.ts:11:13
   linkId: '',
 })
   .on(openDrawerEditLink, (_, payload) => ({
-    isOpen: true,
+    isOpen: false,
     linkId: payload,
   }))
killedBy: DrawerEditLink renders component
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="drawer-edit-link"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
