[NoCoverage] BooleanLiteral
model/modals-models/drawer-edit-topic/DrawerEditTopicModel.ts:11:13
   itemId: '',
 })
   .on(openDrawerEditTopic, (_, payload) => ({
-    isOpen: true,
+    isOpen: false,
     itemId: payload,
   }))
