[NoCoverage] BooleanLiteral
model/modals-models/drawer-export/DrawerExportModel.ts:13:13
   isOpen: false,
 })
   .on(openDrawerExport, () => ({
-    isOpen: true,
+    isOpen: false,
   }))
   .reset(closeDrawerExport);

[NoCoverage] BlockStatement
model/modals-models/drawer-export/DrawerExportModel.ts:23:15
     const response = await apiClient.generateSpecPost({eventGraphDTO});
 
     return response.data;
-  } catch (e) {
-    throw new Error(e);
-  }
+  } catch (e) {}
 });
 
