[NoCoverage] BooleanLiteral
model/modals-models/drawer-specification/SpecificationModalModel.ts:17:13
   nodeId: '',
 })
   .on(openSpecificationModal, (_, payload) => ({
-    isOpen: true,
+    isOpen: false,
     nodeId: payload,
   }))

[NoCoverage] BlockStatement
model/modals-models/drawer-specification/SpecificationModalModel.ts:27:17
   async (getServiceSpecificationPostRequest: GetServiceSpecificationPostRequest) => {
     try {
       return await apiClient.getServiceSpecificationPost({getServiceSpecificationPostRequest});
-    } catch (e) {
-      throw new Error(e);
-    }
+    } catch (e) {}
   }
 );
