[NoCoverage] BooleanLiteral
model/modals-models/edit-http-node-modal/EditHttpNodeModalModel.ts:14:13
   nodeId: '',
 })
   .on(openEditHttpNodeModal, (_, payload) => ({
-    isOpen: true,
+    isOpen: false,
     nodeId: payload,
   }))
