[NoCoverage] BooleanLiteral
model/modals-models/info-panel-modal/InfoPanelModalModel.ts:14:13
   itemId: '',
 })
   .on(openInfoPanelModal, (_, payload) => ({
-    isOpen: true,
+    isOpen: false,
     itemId: payload,
   }))
