[NoCoverage] BooleanLiteral
model/modals-models/popover/PopoverMenuModel.ts:11:13
   itemId: '',
 })
   .on(openPopoverMenu, (_, payload) => ({
-    isOpen: true,
+    isOpen: false,
     itemId: payload,
   }))
