[NoCoverage] ArrayDeclaration
commons/diagram/model/SelectedItemsModel.ts:11:91
 export const addMultipleSelection = createEvent<NodeDTO['id']>();
 
 export const $selectedItems = createStore<string[]>([])
-  .on(toggleItemSelection, (selectedItems, payload) => (selectedItems.includes(payload) ? [] : [payload]))
+  .on(toggleItemSelection, (selectedItems, payload) => (selectedItems.includes(payload) ? ["Stryker was here"] : [payload]))
   .on(addMultipleSelection, (selectedItems, payload) =>
     selectedItems.includes(payload) ? selectedItems.filter(item => item !== payload) : [...selectedItems, payload]

[NoCoverage] ArrowFunction
commons/diagram/model/SelectedItemsModel.ts:13:60
 export const $selectedItems = createStore<string[]>([])
   .on(toggleItemSelection, (selectedItems, payload) => (selectedItems.includes(payload) ? [] : [payload]))
   .on(addMultipleSelection, (selectedItems, payload) =>
-    selectedItems.includes(payload) ? selectedItems.filter(item => item !== payload) : [...selectedItems, payload]
+    selectedItems.includes(payload) ? selectedItems.filter(() => undefined) : [...selectedItems, payload]
   )
   .reset(removeAllSelection);

[NoCoverage] ConditionalExpression
commons/diagram/model/SelectedItemsModel.ts:13:68
 export const $selectedItems = createStore<string[]>([])
   .on(toggleItemSelection, (selectedItems, payload) => (selectedItems.includes(payload) ? [] : [payload]))
   .on(addMultipleSelection, (selectedItems, payload) =>
-    selectedItems.includes(payload) ? selectedItems.filter(item => item !== payload) : [...selectedItems, payload]
+    selectedItems.includes(payload) ? selectedItems.filter(item => true) : [...selectedItems, payload]
   )
   .reset(removeAllSelection);
