[NoCoverage] StringLiteral
commons/diagram/nodes/GhostNode.tsx:5:24
 import clsx from 'clsx';
 
 export const GhostNode = () => (
-  <div className={clsx('h-[48px] border-none bg-transparent transition-all')}>
+  <div className={clsx("")}>
     <Handle className="border-none bg-transparent" type="target" position={Position.Left} isConnectable={false} />
     <Handle className="border-none bg-transparent" type="source" position={Position.Left} isConnectable={false} />

[NoCoverage] BooleanLiteral
commons/diagram/nodes/GhostNode.tsx:6:106
 
 export const GhostNode = () => (
   <div className={clsx('h-[48px] border-none bg-transparent transition-all')}>
-    <Handle className="border-none bg-transparent" type="target" position={Position.Left} isConnectable={false} />
+    <Handle className="border-none bg-transparent" type="target" position={Position.Left} isConnectable={true} />
     <Handle className="border-none bg-transparent" type="source" position={Position.Left} isConnectable={false} />
   </div>

[NoCoverage] BooleanLiteral
commons/diagram/nodes/GhostNode.tsx:7:106
 export const GhostNode = () => (
   <div className={clsx('h-[48px] border-none bg-transparent transition-all')}>
     <Handle className="border-none bg-transparent" type="target" position={Position.Left} isConnectable={false} />
-    <Handle className="border-none bg-transparent" type="source" position={Position.Left} isConnectable={false} />
+    <Handle className="border-none bg-transparent" type="source" position={Position.Left} isConnectable={true} />
   </div>
 );
