[Killed] ArrayDeclaration
components/layout/header/HeaderButtons.tsx:10:14
 export const HeaderButtons = () => (
   <div className="flex items-center gap-16">
     <UIKitMenu
-      items={[
-        {
-          key: 'item1',
-          label: <NavLink to={PATHS.root}>Visualiser</NavLink>,
-        },
-        {
-          key: 'item2',
-          label: <NavLink to={PATHS.editor}>JSON Editor</NavLink>,
-        },
-      ]}
+      items={[]}
       mode="horizontal"
       theme="dark"
killedBy: /src/components/layout/header/Header.tsx renders navigation menu with correct items
statusReason: TestingLibraryElementError: Unable to find an element with the text: Visualiser. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="ant-layout-header _header_1615l_5 bg-dark-item-bg flex min-h-[3.75rem] fle
