[Killed] ConditionalExpression
helpers/json-editor/json-form-helpers/helpers.ts:8:7
  * Проверяет, является ли объект схемой (TSchemaObject), а не ссылочным объектом (TReferenceObject).
  */
 export function isSchemaObject(obj: TSchema): obj is TSchemaObject {
-  if (!obj) return;
+  if (false) return;
 
   return !('$ref' in obj);
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render skeleton when schema is empty
statusReason: TypeError: Cannot use 'in' operator to search for '$ref' in null

[Killed] ConditionalExpression
helpers/json-editor/json-form-helpers/helpers.ts:8:7
  * Проверяет, является ли объект схемой (TSchemaObject), а не ссылочным объектом (TReferenceObject).
  */
 export function isSchemaObject(obj: TSchema): obj is TSchemaObject {
-  if (!obj) return;
+  if (true) return;
 
   return !('$ref' in obj);
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 1

Ignored nodes: comments, script, style
<html>

[Killed] BooleanLiteral
helpers/json-editor/json-form-helpers/helpers.ts:10:10
 export function isSchemaObject(obj: TSchema): obj is TSchemaObject {
   if (!obj) return;
 
-  return !('$ref' in obj);
+  return '$ref' in obj;
 }
 
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 1

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
helpers/json-editor/json-form-helpers/helpers.ts:10:12
 export function isSchemaObject(obj: TSchema): obj is TSchemaObject {
   if (!obj) return;
 
-  return !('$ref' in obj);
+  return !("" in obj);
 }
 
killedBy: /src/helpers/json-editor/helpers.ts/getSchemaType should return ref name for schema with $ref property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User"
Received: "object"

[Killed] MethodExpression
helpers/json-editor/json-form-helpers/helpers.ts:19:20
  * и возвращает последний сегмент пути (например, 'ModelName').
  */
 export const getRefName = (refPath: string): string => {
-  const segments = refPath.split(/[/#]/).filter(Boolean);
+  const segments = refPath.split(/[/#]/);
 
   if (segments.length === 0) {
killedBy: /src/helpers/json-editor/helpers.ts/getRefName should throw error for empty path
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid reference path: "

Received function did not throw

[Killed] Regex
helpers/json-editor/json-form-helpers/helpers.ts:19:34
  * и возвращает последний сегмент пути (например, 'ModelName').
  */
 export const getRefName = (refPath: string): string => {
-  const segments = refPath.split(/[/#]/).filter(Boolean);
+  const segments = refPath.split(/[^/#]/).filter(Boolean);
 
   if (segments.length === 0) {
killedBy: /src/helpers/json-editor/helpers.ts/getRefName should extract model name from standard OpenAPI reference path
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ModelName"
Received: "/"

[Killed] EqualityOperator
helpers/json-editor/json-form-helpers/helpers.ts:21:7
 export const getRefName = (refPath: string): string => {
   const segments = refPath.split(/[/#]/).filter(Boolean);
 
-  if (segments.length === 0) {
+  if (segments.length !== 0) {
     throw new Error(`Invalid reference path: ${refPath}`);
   }
killedBy: /src/helpers/json-editor/helpers.ts/getRefName should extract model name from standard OpenAPI reference path
statusReason: Error: Invalid reference path: #/components/schemas/ModelName

[Killed] ConditionalExpression
helpers/json-editor/json-form-helpers/helpers.ts:21:7
 export const getRefName = (refPath: string): string => {
   const segments = refPath.split(/[/#]/).filter(Boolean);
 
-  if (segments.length === 0) {
+  if (true) {
     throw new Error(`Invalid reference path: ${refPath}`);
   }
killedBy: /src/helpers/json-editor/helpers.ts/getSchemaType should return ref name for schema with $ref property
statusReason: Error: Invalid reference path: #/components/schemas/User

[Killed] ArithmeticOperator
helpers/json-editor/json-form-helpers/helpers.ts:25:19
     throw new Error(`Invalid reference path: ${refPath}`);
   }
 
-  return segments[segments.length - 1];
+  return segments[segments.length + 1];
 };
 
killedBy: /src/helpers/json-editor/helpers.ts/getSchemaType should return ref name for schema with $ref property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User"
Received: undefined

[Killed] BooleanLiteral
helpers/json-editor/json-form-helpers/helpers.ts:33:7
  * Может вернуть как базовый тип (TSchemaObjectType), так и имя ссылки (string), если свойство является ссылкой ($ref).
  */
 export const getSchemaType = (jsonSchema: TSchema): TSchemaObjectType | string => {
-  if (!jsonSchema) return;
+  if (jsonSchema) return;
 
   if (isSchemaObject(jsonSchema) && jsonSchema.type) {
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "object{2}"
Received string:    ""

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
helpers/json-editor/json-form-helpers/helpers.ts:33:7
  * Может вернуть как базовый тип (TSchemaObjectType), так и имя ссылки (string), если свойство является ссылкой ($ref).
  */
 export const getSchemaType = (jsonSchema: TSchema): TSchemaObjectType | string => {
-  if (!jsonSchema) return;
+  if (false) return;
 
   if (isSchemaObject(jsonSchema) && jsonSchema.type) {
killedBy: /src/helpers/json-editor/helpers.ts/getSchemaType should return undefined for undefined/null schema
statusReason: TypeError: Cannot use 'in' operator to search for '$ref' in undefined

[Killed] BlockStatement
helpers/json-editor/json-form-helpers/helpers.ts:35:54
 export const getSchemaType = (jsonSchema: TSchema): TSchemaObjectType | string => {
   if (!jsonSchema) return;
 
-  if (isSchemaObject(jsonSchema) && jsonSchema.type) {
-    return jsonSchema.type;
-  }
+  if (isSchemaObject(jsonSchema) && jsonSchema.type) {}
 
   if ('$ref' in jsonSchema && jsonSchema.$ref) {
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "object{2}"
Received string:    ""

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
helpers/json-editor/json-form-helpers/helpers.ts:39:48
     return jsonSchema.type;
   }
 
-  if ('$ref' in jsonSchema && jsonSchema.$ref) {
-    return getRefName(jsonSchema.$ref);
-  }
+  if ('$ref' in jsonSchema && jsonSchema.$ref) {}
 };
 
killedBy: /src/helpers/json-editor/helpers.ts/getSchemaType should return ref name for schema with $ref property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User"
Received: undefined

[Killed] LogicalOperator
helpers/json-editor/json-form-helpers/helpers.ts:48:68
  * Возвращает цветовой код (HEX) для заданного типа схемы.
  * Используется для визуального выделения различных типов данных в интерфейсе.
  */
-export const getColorByType = (type: TSchemaObjectType): string => COLOR_BY_TYPE[type] || '#000000';
+export const getColorByType = (type: TSchemaObjectType): string => COLOR_BY_TYPE[type] && '#000000';
 
 /**
killedBy: /src/helpers/json-editor/helpers.ts/getTypeColor should return correct color for each schema type
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#08979C"
Received: "#000000"

[Killed] BlockStatement
helpers/json-editor/json-form-helpers/helpers.ts:53:61
 /**
  * Возвращает количество свойств в объекте JSON-схемы.
  */
-export const getPropertiesLength = (jsonSchema: TSchema) => {
-  if (!isSchemaObject(jsonSchema) || !jsonSchema?.properties) return null;
-
-  return Object.keys(jsonSchema?.properties).length;
-};
+export const getPropertiesLength = (jsonSchema: TSchema) => {};
 
 /**
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "object{2}"
Received string:    "object{undefined}"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
helpers/json-editor/json-form-helpers/helpers.ts:54:38
  * Возвращает количество свойств в объекте JSON-схемы.
  */
 export const getPropertiesLength = (jsonSchema: TSchema) => {
-  if (!isSchemaObject(jsonSchema) || !jsonSchema?.properties) return null;
+  if (!isSchemaObject(jsonSchema) || jsonSchema?.properties) return null;
 
   return Object.keys(jsonSchema?.properties).length;
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "object{2}"
Received string:    "object{null}"

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] OptionalChaining
helpers/json-editor/json-form-helpers/helpers.ts:54:39
  * Возвращает количество свойств в объекте JSON-схемы.
  */
 export const getPropertiesLength = (jsonSchema: TSchema) => {
-  if (!isSchemaObject(jsonSchema) || !jsonSchema?.properties) return null;
+  if (!isSchemaObject(jsonSchema) || !jsonSchema.properties) return null;
 
   return Object.keys(jsonSchema?.properties).length;

[Survived] OptionalChaining
helpers/json-editor/json-form-helpers/helpers.ts:56:22
 export const getPropertiesLength = (jsonSchema: TSchema) => {
   if (!isSchemaObject(jsonSchema) || !jsonSchema?.properties) return null;
 
-  return Object.keys(jsonSchema?.properties).length;
+  return Object.keys(jsonSchema.properties).length;
 };
 

[Killed] BlockStatement
helpers/json-editor/json-form-helpers/helpers.ts:65:35
  * Если propertyKey не указан - возвращает цвет типа самой схемы.
  */
 export const getTypeColor = (jsonSchema: TSchema): string => {
-  if (isSchemaObject(jsonSchema)) {
-    return getColorByType(jsonSchema.type);
-  }
+  if (isSchemaObject(jsonSchema)) {}
 
   return '#000000';
killedBy: /src/helpers/json-editor/helpers.ts/getTypeColor should return correct color for each schema type
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#08979C"
Received: "#000000"

[Killed] ConditionalExpression
helpers/json-editor/json-form-helpers/helpers.ts:77:5
  */
 export const getInitialSchemaByType = (type: TSchemaObjectType): TSchema => {
   switch (type) {
-    case 'array':
-      return {type: 'array', items: {type: 'string'}};
+    case 'array':
     case 'dictionary':
       return {type: 'object', additionalProperties: {type: 'string'}};
killedBy: /src/helpers/json-editor/helpers.ts/getInitialSchemaByType should return correct schema for array type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "items": Object {
+   "additionalProperties": Object {

[Killed] ConditionalExpression
helpers/json-editor/json-form-helpers/helpers.ts:81:5
       return {type: 'array', items: {type: 'string'}};
     case 'dictionary':
       return {type: 'object', additionalProperties: {type: 'string'}};
-    default:
-      return {type};
+    default:
   }
 };
killedBy: /src/helpers/json-editor/helpers.ts/getInitialSchemaByType should return correct schema for string type
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"type": "string"}
Received: undefined
