[Killed] ConditionalExpression
src/helpers/node-helpers.tsx:19:16
  * @param {NodeDTOBrokerTypeEnum | NodeDTOTypeEnum} type - Тип узла, для которого нужно получить иконку
  */
 export const getNodeIcon = (type: NodeDTOBrokerTypeEnum | NodeDTOTypeEnum) => {
-  const icon = IconMap[type] || <IconServerCog/>;
+  const icon = false;
 
   return <UIKitIcon icon={icon} size={16}/>;
killedBy: /src/helpers/node-helpers.tsx/getNodeIcon returns correct wrapped icon for SERVICE
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  <Icon
-   icon={<IconTopologyStar />}
+   icon={false}

[Killed] LogicalOperator
src/helpers/node-helpers.tsx:19:16
  * @param {NodeDTOBrokerTypeEnum | NodeDTOTypeEnum} type - Тип узла, для которого нужно получить иконку
  */
 export const getNodeIcon = (type: NodeDTOBrokerTypeEnum | NodeDTOTypeEnum) => {
-  const icon = IconMap[type] || <IconServerCog/>;
+  const icon = IconMap[type] && <IconServerCog />;
 
   return <UIKitIcon icon={icon} size={16}/>;
killedBy: /src/helpers/node-helpers.tsx/getNodeIcon returns correct wrapped icon for SERVICE
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  <Icon
-   icon={<IconTopologyStar />}
+   icon={<IconServerCog />}

[Survived] EqualityOperator
src/helpers/node-helpers.tsx:36:5
   clsx(
     'flex transition-all w-[11.688rem] items-center gap-2 border-2',
     'border-solid px-4 py-3 align-middle hover:cursor-pointer',
-    data.nodeType === 'HTTP' ? 'rounded-[63px]' : 'rounded-sm',
+    data.nodeType !== 'HTTP' ? 'rounded-[63px]' : 'rounded-sm',
     NodeColorMap[data.nodeType] || 'border-colorful-blue-border bg-white',
     isNodeSelected ? NodeSelectedColorMap[data.nodeType] : 'bg-white',

[Survived] ConditionalExpression
src/helpers/node-helpers.tsx:36:5
   clsx(
     'flex transition-all w-[11.688rem] items-center gap-2 border-2',
     'border-solid px-4 py-3 align-middle hover:cursor-pointer',
-    data.nodeType === 'HTTP' ? 'rounded-[63px]' : 'rounded-sm',
+    false ? 'rounded-[63px]' : 'rounded-sm',
     NodeColorMap[data.nodeType] || 'border-colorful-blue-border bg-white',
     isNodeSelected ? NodeSelectedColorMap[data.nodeType] : 'bg-white',

[Survived] ConditionalExpression
src/helpers/node-helpers.tsx:37:5
     'flex transition-all w-[11.688rem] items-center gap-2 border-2',
     'border-solid px-4 py-3 align-middle hover:cursor-pointer',
     data.nodeType === 'HTTP' ? 'rounded-[63px]' : 'rounded-sm',
-    NodeColorMap[data.nodeType] || 'border-colorful-blue-border bg-white',
+    false,
     isNodeSelected ? NodeSelectedColorMap[data.nodeType] : 'bg-white',
     hiddenItems.includes(id) && 'opacity-30'

[Survived] LogicalOperator
src/helpers/node-helpers.tsx:37:5
     'flex transition-all w-[11.688rem] items-center gap-2 border-2',
     'border-solid px-4 py-3 align-middle hover:cursor-pointer',
     data.nodeType === 'HTTP' ? 'rounded-[63px]' : 'rounded-sm',
-    NodeColorMap[data.nodeType] || 'border-colorful-blue-border bg-white',
+    NodeColorMap[data.nodeType] && 'border-colorful-blue-border bg-white',
     isNodeSelected ? NodeSelectedColorMap[data.nodeType] : 'bg-white',
     hiddenItems.includes(id) && 'opacity-30'

[Survived] LogicalOperator
src/helpers/node-helpers.tsx:39:5
     data.nodeType === 'HTTP' ? 'rounded-[63px]' : 'rounded-sm',
     NodeColorMap[data.nodeType] || 'border-colorful-blue-border bg-white',
     isNodeSelected ? NodeSelectedColorMap[data.nodeType] : 'bg-white',
-    hiddenItems.includes(id) && 'opacity-30'
+    hiddenItems.includes(id) || 'opacity-30'
   );
 

[Survived] ConditionalExpression
src/helpers/node-helpers.tsx:39:5
     data.nodeType === 'HTTP' ? 'rounded-[63px]' : 'rounded-sm',
     NodeColorMap[data.nodeType] || 'border-colorful-blue-border bg-white',
     isNodeSelected ? NodeSelectedColorMap[data.nodeType] : 'bg-white',
-    hiddenItems.includes(id) && 'opacity-30'
+    false
   );
 

[Survived] StringLiteral
src/helpers/node-helpers.tsx:47:5
  */
 export const getInputClassName = (isReadOnly: boolean) =>
   clsx(
-    'w-full max-w-[7.688rem] p-0',
+    "",
     'overflow-hidden border-none text-ellipsis whitespace-nowrap outline-none',
     'focus:border-none focus:outline-none',

[Survived] ConditionalExpression
src/helpers/node-helpers.tsx:50:5
     'w-full max-w-[7.688rem] p-0',
     'overflow-hidden border-none text-ellipsis whitespace-nowrap outline-none',
     'focus:border-none focus:outline-none',
-    isReadOnly && 'cursor-pointer'
+    true
   );
 

[Survived] ConditionalExpression
src/helpers/node-helpers.tsx:50:5
     'w-full max-w-[7.688rem] p-0',
     'overflow-hidden border-none text-ellipsis whitespace-nowrap outline-none',
     'focus:border-none focus:outline-none',
-    isReadOnly && 'cursor-pointer'
+    false
   );
 

[Survived] MethodExpression
src/helpers/node-helpers.tsx:59:10
  * Пример: '1+2'
  */
 export function getExpandedEventNodeId(eventId: string, nodeId: string): string {
-  return [eventId, nodeId].sort().join('+');
+  return [eventId, nodeId].join('+');
 }
 

[Survived] StringLiteral
src/helpers/node-helpers.tsx:59:40
  * Пример: '1+2'
  */
 export function getExpandedEventNodeId(eventId: string, nodeId: string): string {
-  return [eventId, nodeId].sort().join('+');
+  return [eventId, nodeId].sort().join("");
 }
 

[Survived] ArithmeticOperator
src/helpers/node-helpers.tsx:73:12
  */
 export function calculateGroupDimensions(childNodesCount: number): { width: number; height: number } {
   return {
-    width: NODE_WIDTH + GROUP_NODE_GAP,
+    width: NODE_WIDTH - GROUP_NODE_GAP,
     height: childNodesCount * (NODE_HEIGHT + GROUP_NODE_GAP),
   };

[Survived] ArithmeticOperator
src/helpers/node-helpers.tsx:74:32
 export function calculateGroupDimensions(childNodesCount: number): { width: number; height: number } {
   return {
     width: NODE_WIDTH + GROUP_NODE_GAP,
-    height: childNodesCount * (NODE_HEIGHT + GROUP_NODE_GAP),
+    height: childNodesCount * (NODE_HEIGHT - GROUP_NODE_GAP),
   };
 }

[Survived] ArithmeticOperator
src/helpers/node-helpers.tsx:74:13
 export function calculateGroupDimensions(childNodesCount: number): { width: number; height: number } {
   return {
     width: NODE_WIDTH + GROUP_NODE_GAP,
-    height: childNodesCount * (NODE_HEIGHT + GROUP_NODE_GAP),
+    height: childNodesCount / (NODE_HEIGHT + GROUP_NODE_GAP),
   };
 }

[Killed] ArrowFunction
src/helpers/node-helpers.tsx:83:42
  * Поиск выполняется сначала среди дочерних элементов первого уровня, затем среди вложенных дочерних элементов.
  * */
 export function findElkNode(layout: ElkNode, nodeId: string): ElkNode {
-  const rootNode = layout.children?.find(n => n.id === nodeId);
+  const rootNode = layout.children?.find(() => undefined);
   if (rootNode) return rootNode;
 
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of null (reading 'width')

[Killed] ConditionalExpression
src/helpers/node-helpers.tsx:83:47
  * Поиск выполняется сначала среди дочерних элементов первого уровня, затем среди вложенных дочерних элементов.
  * */
 export function findElkNode(layout: ElkNode, nodeId: string): ElkNode {
-  const rootNode = layout.children?.find(n => n.id === nodeId);
+  const rootNode = layout.children?.find(n => true);
   if (rootNode) return rootNode;
 
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "x": 300,
-   "y": 200,

[Killed] ConditionalExpression
src/helpers/node-helpers.tsx:84:7
  * */
 export function findElkNode(layout: ElkNode, nodeId: string): ElkNode {
   const rootNode = layout.children?.find(n => n.id === nodeId);
-  if (rootNode) return rootNode;
+  if (false) return rootNode;
 
   const nestedNode = layout.children?.flatMap(parent => parent.children || EMPTY_ARRAY).find(n => n.id === nodeId);
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of null (reading 'width')

[Survived] ConditionalExpression
src/helpers/node-helpers.tsx:84:7
  * */
 export function findElkNode(layout: ElkNode, nodeId: string): ElkNode {
   const rootNode = layout.children?.find(n => n.id === nodeId);
-  if (rootNode) return rootNode;
+  if (true) return rootNode;
 
   const nestedNode = layout.children?.flatMap(parent => parent.children || EMPTY_ARRAY).find(n => n.id === nodeId);

[NoCoverage] ArrowFunction
src/helpers/node-helpers.tsx:86:47
   const rootNode = layout.children?.find(n => n.id === nodeId);
   if (rootNode) return rootNode;
 
-  const nestedNode = layout.children?.flatMap(parent => parent.children || EMPTY_ARRAY).find(n => n.id === nodeId);
+  const nestedNode = layout.children?.flatMap(() => undefined).find(n => n.id === nodeId);
 
   return nestedNode || null;

[NoCoverage] EqualityOperator
src/helpers/node-helpers.tsx:86:99
   const rootNode = layout.children?.find(n => n.id === nodeId);
   if (rootNode) return rootNode;
 
-  const nestedNode = layout.children?.flatMap(parent => parent.children || EMPTY_ARRAY).find(n => n.id === nodeId);
+  const nestedNode = layout.children?.flatMap(parent => parent.children || EMPTY_ARRAY).find(n => n.id !== nodeId);
 
   return nestedNode || null;

[NoCoverage] LogicalOperator
src/helpers/node-helpers.tsx:88:10
 
   const nestedNode = layout.children?.flatMap(parent => parent.children || EMPTY_ARRAY).find(n => n.id === nodeId);
 
-  return nestedNode || null;
+  return nestedNode && null;
 }
 

[NoCoverage] ArrowFunction
src/helpers/node-helpers.tsx:95:32
  * Проверяет, является ли узел с указанным ID топиком в графе событий.
  */
 export function isNodeTopic(eventGraph: EventGraphDTO, nodeId: NodeDTO['id']): boolean {
-  return eventGraph.nodes.find(node => node.id === nodeId)?.type === NodeDTOTypeEnum.Topic;
+  return eventGraph.nodes.find(() => undefined)?.type === NodeDTOTypeEnum.Topic;
 }
 

[NoCoverage] ConditionalExpression
src/helpers/node-helpers.tsx:95:40
  * Проверяет, является ли узел с указанным ID топиком в графе событий.
  */
 export function isNodeTopic(eventGraph: EventGraphDTO, nodeId: NodeDTO['id']): boolean {
-  return eventGraph.nodes.find(node => node.id === nodeId)?.type === NodeDTOTypeEnum.Topic;
+  return eventGraph.nodes.find(node => true)?.type === NodeDTOTypeEnum.Topic;
 }
 

[NoCoverage] ConditionalExpression
src/helpers/node-helpers.tsx:104:7
 export function getNodeType(eventGraph: EventGraphDTO, nodeId: string) {
   const nodes = eventGraph.nodes;
 
-  if (nodes) {
+  if (true) {
     return nodes.find(node => node.id === nodeId)?.type;
   }

[NoCoverage] BlockStatement
src/helpers/node-helpers.tsx:104:14
 export function getNodeType(eventGraph: EventGraphDTO, nodeId: string) {
   const nodes = eventGraph.nodes;
 
-  if (nodes) {
-    return nodes.find(node => node.id === nodeId)?.type;
-  }
+  if (nodes) {}
 
   return '';

[NoCoverage] ConditionalExpression
src/helpers/node-helpers.tsx:105:31
   const nodes = eventGraph.nodes;
 
   if (nodes) {
-    return nodes.find(node => node.id === nodeId)?.type;
+    return nodes.find(node => true)?.type;
   }
 

[NoCoverage] EqualityOperator
src/helpers/node-helpers.tsx:105:31
   const nodes = eventGraph.nodes;
 
   if (nodes) {
-    return nodes.find(node => node.id === nodeId)?.type;
+    return nodes.find(node => node.id !== nodeId)?.type;
   }
 
