[Survived] ArrayDeclaration
src/hooks/useDiagramNotification.tsx:34:5
 
   const notifySuccess = useCallback(
     (key: string, message: string) => api.success({key, message, placement: 'bottomRight', duration: 1.5}),
-    [api]
+    []
   );
 

[Survived] ArrayDeclaration
src/hooks/useDiagramNotification.tsx:44:5
 
   const notifyLoading = useCallback(
     (key: string, message: string) => api.open({key, message, placement: 'bottomRight', duration: 0}),
-    [api]
+    []
   );
 

[Survived] BlockStatement
src/hooks/useDiagramNotification.tsx:47:19
     [api]
   );
 
-  useEffect(() => {
-    if (isPending) {
-      notifyLoading(NOTIFICATION_KEY.fetchEventGraphStatus, 'Import in progress');
-    }
-  }, [isPending, notifyLoading]);
+  useEffect(() => {}, [isPending, notifyLoading]);
 
   useEffect(() => {

[Survived] ConditionalExpression
src/hooks/useDiagramNotification.tsx:48:9
   );
 
   useEffect(() => {
-    if (isPending) {
+    if (false) {
       notifyLoading(NOTIFICATION_KEY.fetchEventGraphStatus, 'Import in progress');
     }

[NoCoverage] BlockStatement
src/hooks/useDiagramNotification.tsx:48:20
   );
 
   useEffect(() => {
-    if (isPending) {
-      notifyLoading(NOTIFICATION_KEY.fetchEventGraphStatus, 'Import in progress');
-    }
+    if (isPending) {}
   }, [isPending, notifyLoading]);
 

[NoCoverage] BlockStatement
src/hooks/useDiagramNotification.tsx:54:57
   }, [isPending, notifyLoading]);
 
   useEffect(() => {
-    const handleAddNode = (payload: NodeDTOTypeEnum) => {
-      switch (payload) {
-        case NodeDTOTypeEnum.Service:
-          notifySuccess(NOTIFICATION_KEY.addServiceStatus, 'Service has been added');
-          break;
-        case NodeDTOTypeEnum.Topic:
-          notifySuccess(NOTIFICATION_KEY.addTopicStatus, 'Topic has been added');
-          break;
-        case NodeDTOTypeEnum.Http:
-          notifySuccess(NOTIFICATION_KEY.addHttpStatus, 'Http has been added');
-          break;
-        default:
-          break;
-      }
-    };
+    const handleAddNode = (payload: NodeDTOTypeEnum) => {};
 
     const handleAddEvent = () => {

[NoCoverage] ConditionalExpression
src/hooks/useDiagramNotification.tsx:56:9
   useEffect(() => {
     const handleAddNode = (payload: NodeDTOTypeEnum) => {
       switch (payload) {
-        case NodeDTOTypeEnum.Service:
-          notifySuccess(NOTIFICATION_KEY.addServiceStatus, 'Service has been added');
-          break;
+        case NodeDTOTypeEnum.Service:
         case NodeDTOTypeEnum.Topic:
           notifySuccess(NOTIFICATION_KEY.addTopicStatus, 'Topic has been added');

[NoCoverage] ConditionalExpression
src/hooks/useDiagramNotification.tsx:59:9
         case NodeDTOTypeEnum.Service:
           notifySuccess(NOTIFICATION_KEY.addServiceStatus, 'Service has been added');
           break;
-        case NodeDTOTypeEnum.Topic:
-          notifySuccess(NOTIFICATION_KEY.addTopicStatus, 'Topic has been added');
-          break;
+        case NodeDTOTypeEnum.Topic:
         case NodeDTOTypeEnum.Http:
           notifySuccess(NOTIFICATION_KEY.addHttpStatus, 'Http has been added');

[NoCoverage] ConditionalExpression
src/hooks/useDiagramNotification.tsx:62:9
         case NodeDTOTypeEnum.Topic:
           notifySuccess(NOTIFICATION_KEY.addTopicStatus, 'Topic has been added');
           break;
-        case NodeDTOTypeEnum.Http:
-          notifySuccess(NOTIFICATION_KEY.addHttpStatus, 'Http has been added');
-          break;
+        case NodeDTOTypeEnum.Http:
         default:
           break;

[NoCoverage] BlockStatement
src/hooks/useDiagramNotification.tsx:70:34
       }
     };
 
-    const handleAddEvent = () => {
-      notifySuccess(NOTIFICATION_KEY.addEventStatus, 'Event has been added');
-    };
+    const handleAddEvent = () => {};
 
     const handleFetchSuccess = () => {

[NoCoverage] StringLiteral
src/hooks/useDiagramNotification.tsx:71:54
     };
 
     const handleAddEvent = () => {
-      notifySuccess(NOTIFICATION_KEY.addEventStatus, 'Event has been added');
+      notifySuccess(NOTIFICATION_KEY.addEventStatus, "");
     };
 

[NoCoverage] BlockStatement
src/hooks/useDiagramNotification.tsx:74:38
       notifySuccess(NOTIFICATION_KEY.addEventStatus, 'Event has been added');
     };
 
-    const handleFetchSuccess = () => {
-      api.destroy(NOTIFICATION_KEY.fetchEventGraphStatus);
-      notifySuccess(NOTIFICATION_KEY.fetchEventGraphStatus, 'Import success');
-    };
+    const handleFetchSuccess = () => {};
 
     const handleFetchFail = () => {

[NoCoverage] BlockStatement
src/hooks/useDiagramNotification.tsx:79:35
       notifySuccess(NOTIFICATION_KEY.fetchEventGraphStatus, 'Import success');
     };
 
-    const handleFetchFail = () => {
-      api.destroy(NOTIFICATION_KEY.fetchEventGraphStatus);
-      notifyError(NOTIFICATION_KEY.fetchEventGraphStatus, 'Import failed');
-    };
+    const handleFetchFail = () => {};
 
     const handleDeleteAll = () => {

[NoCoverage] BlockStatement
src/hooks/useDiagramNotification.tsx:84:35
       notifyError(NOTIFICATION_KEY.fetchEventGraphStatus, 'Import failed');
     };
 
-    const handleDeleteAll = () => {
-      notifySuccess(NOTIFICATION_KEY.deleteAllStatus, 'Deletion completed');
-    };
+    const handleDeleteAll = () => {};
 
     const handleDeleteItems = () => {

[NoCoverage] StringLiteral
src/hooks/useDiagramNotification.tsx:85:55
     };
 
     const handleDeleteAll = () => {
-      notifySuccess(NOTIFICATION_KEY.deleteAllStatus, 'Deletion completed');
+      notifySuccess(NOTIFICATION_KEY.deleteAllStatus, "");
     };
 

[NoCoverage] BlockStatement
src/hooks/useDiagramNotification.tsx:88:37
       notifySuccess(NOTIFICATION_KEY.deleteAllStatus, 'Deletion completed');
     };
 
-    const handleDeleteItems = () => {
-      notifySuccess(NOTIFICATION_KEY.deleteItemsStatus, 'Deletion completed');
-    };
+    const handleDeleteItems = () => {};
 
     const handleAddLink = () => {

[NoCoverage] BlockStatement
src/hooks/useDiagramNotification.tsx:92:33
       notifySuccess(NOTIFICATION_KEY.deleteItemsStatus, 'Deletion completed');
     };
 
-    const handleAddLink = () => {
-      notifySuccess(NOTIFICATION_KEY.addLinkStatus, 'Link created');
-    };
+    const handleAddLink = () => {};
 
     const unsubscribeAddNode = addNode.watch(handleAddNode);

[NoCoverage] StringLiteral
src/hooks/useDiagramNotification.tsx:93:53
     };
 
     const handleAddLink = () => {
-      notifySuccess(NOTIFICATION_KEY.addLinkStatus, 'Link created');
+      notifySuccess(NOTIFICATION_KEY.addLinkStatus, "");
     };
 

[Survived] BlockStatement
src/hooks/useDiagramNotification.tsx:106:18
     const unsubscribeDeleteNodes = removeNodes.watch(handleDeleteItems);
     const unsubscribeDeleteNodeWithConnectedLinks = removeNodeWithConnectedLinks.watch(handleDeleteItems);
 
-    return () => {
-      unsubscribeAddNode();
-      unsubscribeFetchSuccess();
-      unsubscribeFetchFail();
-      unsubscribeDeleteAll();
-      unsubscribeAddLink();
-      unsubscribeAddEvent();
-      unsubscribeDeleteNode();
-      unsubscribeDeleteNodes();
-      unsubscribeDeleteNodeWithConnectedLinks();
-    };
+    return () => {};
   }, [api, notifyError, notifySuccess]);
 
