[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:46:41
 // Стор хранящий данные графа
 const $eventGraph = createStore<EventGraphDTO>(INITIAL_EVENT_GRAPH)
   .on(setEventGraph, (_, payload) => payload)
-  .on(addNode, (eventGraph, payload) => {
-    const newService: NodeDTO = {
-      id: uuidv4(),
-      belongsToGraph: [],
-      name: Capitalize(payload),
-      type: payload,
-      brokerType: null,
-    };
-
-    if (!eventGraph) return {nodes: [newService]};
-
-    return {...eventGraph, nodes: [...(eventGraph.nodes || []), newService]}; // Возвращаем обновленный граф
-  })
+  .on(addNode, (eventGraph, payload) => {})
   .on(addEvent, (eventGraph, payload) => {
     const newEvent: EventDTO = {

[NoCoverage] BooleanLiteral
src/models/EventGraphModel.ts:55:9
       brokerType: null,
     };
 
-    if (!eventGraph) return {nodes: [newService]};
+    if (eventGraph) return {nodes: [newService]};
 
     return {...eventGraph, nodes: [...(eventGraph.nodes || []), newService]}; // Возвращаем обновленный граф

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:55:9
       brokerType: null,
     };
 
-    if (!eventGraph) return {nodes: [newService]};
+    if (true) return {nodes: [newService]};
 
     return {...eventGraph, nodes: [...(eventGraph.nodes || []), newService]}; // Возвращаем обновленный граф

[NoCoverage] LogicalOperator
src/models/EventGraphModel.ts:57:40
 
     if (!eventGraph) return {nodes: [newService]};
 
-    return {...eventGraph, nodes: [...(eventGraph.nodes || []), newService]}; // Возвращаем обновленный граф
+    return {...eventGraph, nodes: [...(eventGraph.nodes && []), newService]}; // Возвращаем обновленный граф
   })
   .on(addEvent, (eventGraph, payload) => {

[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:59:42
 
     return {...eventGraph, nodes: [...(eventGraph.nodes || []), newService]}; // Возвращаем обновленный граф
   })
-  .on(addEvent, (eventGraph, payload) => {
-    const newEvent: EventDTO = {
-      id: uuidv4(),
-      name: payload.name,
-      schema: payload.schema,
-      eventDescription: payload.eventDescription,
-      tags: payload.tags,
-    };
-
-    if (!eventGraph) return {events: [newEvent]};
-
-    return {...eventGraph, events: [...(eventGraph.events || []), newEvent]};
-  })
+  .on(addEvent, (eventGraph, payload) => {})
   .on(removeNode, (eventGraph, payload) => {
     const filteredNodes = eventGraph.nodes.filter(node => node.id !== payload);

[NoCoverage] BooleanLiteral
src/models/EventGraphModel.ts:68:9
       tags: payload.tags,
     };
 
-    if (!eventGraph) return {events: [newEvent]};
+    if (eventGraph) return {events: [newEvent]};
 
     return {...eventGraph, events: [...(eventGraph.events || []), newEvent]};

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:68:9
       tags: payload.tags,
     };
 
-    if (!eventGraph) return {events: [newEvent]};
+    if (false) return {events: [newEvent]};
 
     return {...eventGraph, events: [...(eventGraph.events || []), newEvent]};

[NoCoverage] LogicalOperator
src/models/EventGraphModel.ts:70:41
 
     if (!eventGraph) return {events: [newEvent]};
 
-    return {...eventGraph, events: [...(eventGraph.events || []), newEvent]};
+    return {...eventGraph, events: [...(eventGraph.events && []), newEvent]};
   })
   .on(removeNode, (eventGraph, payload) => {

[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:72:44
 
     return {...eventGraph, events: [...(eventGraph.events || []), newEvent]};
   })
-  .on(removeNode, (eventGraph, payload) => {
-    const filteredNodes = eventGraph.nodes.filter(node => node.id !== payload);
-    return {...eventGraph, nodes: filteredNodes};
-  })
+  .on(removeNode, (eventGraph, payload) => {})
   .on(removeNode, (eventGraph, payload) => ({
     ...eventGraph,

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:73:59
     return {...eventGraph, events: [...(eventGraph.events || []), newEvent]};
   })
   .on(removeNode, (eventGraph, payload) => {
-    const filteredNodes = eventGraph.nodes.filter(node => node.id !== payload);
+    const filteredNodes = eventGraph.nodes.filter(node => true);
     return {...eventGraph, nodes: filteredNodes};
   })

[NoCoverage] EqualityOperator
src/models/EventGraphModel.ts:73:59
     return {...eventGraph, events: [...(eventGraph.events || []), newEvent]};
   })
   .on(removeNode, (eventGraph, payload) => {
-    const filteredNodes = eventGraph.nodes.filter(node => node.id !== payload);
+    const filteredNodes = eventGraph.nodes.filter(node => node.id === payload);
     return {...eventGraph, nodes: filteredNodes};
   })

[NoCoverage] ArrowFunction
src/models/EventGraphModel.ts:78:36
   })
   .on(removeNode, (eventGraph, payload) => ({
     ...eventGraph,
-    nodes: eventGraph.nodes.filter(node => node.id !== payload),
+    nodes: eventGraph.nodes.filter(() => undefined),
   }))
   .on(editNode, (eventGraph, {id, updates}) => {

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:78:44
   })
   .on(removeNode, (eventGraph, payload) => ({
     ...eventGraph,
-    nodes: eventGraph.nodes.filter(node => node.id !== payload),
+    nodes: eventGraph.nodes.filter(node => true),
   }))
   .on(editNode, (eventGraph, {id, updates}) => {

[Survived] BlockStatement
src/models/EventGraphModel.ts:80:48
     ...eventGraph,
     nodes: eventGraph.nodes.filter(node => node.id !== payload),
   }))
-  .on(editNode, (eventGraph, {id, updates}) => {
-    if (!eventGraph) return null;
-
-    const updatedNodes = eventGraph.nodes.map(node => (node.id === id ? {...node, ...updates} : node));
-
-    return {...eventGraph, nodes: updatedNodes};
-  })
+  .on(editNode, (eventGraph, {id, updates}) => {})
   .on(editEvent, (eventGraph, {id, updates}) => {
     if (!eventGraph) return null;

[Survived] BooleanLiteral
src/models/EventGraphModel.ts:81:9
     nodes: eventGraph.nodes.filter(node => node.id !== payload),
   }))
   .on(editNode, (eventGraph, {id, updates}) => {
-    if (!eventGraph) return null;
+    if (eventGraph) return null;
 
     const updatedNodes = eventGraph.nodes.map(node => (node.id === id ? {...node, ...updates} : node));

[Survived] ConditionalExpression
src/models/EventGraphModel.ts:81:9
     nodes: eventGraph.nodes.filter(node => node.id !== payload),
   }))
   .on(editNode, (eventGraph, {id, updates}) => {
-    if (!eventGraph) return null;
+    if (true) return null;
 
     const updatedNodes = eventGraph.nodes.map(node => (node.id === id ? {...node, ...updates} : node));

[NoCoverage] EqualityOperator
src/models/EventGraphModel.ts:83:56
   .on(editNode, (eventGraph, {id, updates}) => {
     if (!eventGraph) return null;
 
-    const updatedNodes = eventGraph.nodes.map(node => (node.id === id ? {...node, ...updates} : node));
+    const updatedNodes = eventGraph.nodes.map(node => (node.id !== id ? {...node, ...updates} : node));
 
     return {...eventGraph, nodes: updatedNodes};

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:83:56
   .on(editNode, (eventGraph, {id, updates}) => {
     if (!eventGraph) return null;
 
-    const updatedNodes = eventGraph.nodes.map(node => (node.id === id ? {...node, ...updates} : node));
+    const updatedNodes = eventGraph.nodes.map(node => (false ? {...node, ...updates} : node));
 
     return {...eventGraph, nodes: updatedNodes};

[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:87:49
 
     return {...eventGraph, nodes: updatedNodes};
   })
-  .on(editEvent, (eventGraph, {id, updates}) => {
-    if (!eventGraph) return null;
-
-    const updatedNodes = eventGraph.events.map(event => (event.id === id ? {...event, ...updates} : event));
-
-    return {...eventGraph, events: updatedNodes};
-  })
+  .on(editEvent, (eventGraph, {id, updates}) => {})
   .on(removeEvent, (eventGraph, payload) => {
     const filteredEvents = eventGraph?.events?.filter(event => event.id !== payload);

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:88:9
     return {...eventGraph, nodes: updatedNodes};
   })
   .on(editEvent, (eventGraph, {id, updates}) => {
-    if (!eventGraph) return null;
+    if (false) return null;
 
     const updatedNodes = eventGraph.events.map(event => (event.id === id ? {...event, ...updates} : event));

[NoCoverage] BooleanLiteral
src/models/EventGraphModel.ts:88:9
     return {...eventGraph, nodes: updatedNodes};
   })
   .on(editEvent, (eventGraph, {id, updates}) => {
-    if (!eventGraph) return null;
+    if (eventGraph) return null;
 
     const updatedNodes = eventGraph.events.map(event => (event.id === id ? {...event, ...updates} : event));

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:90:58
   .on(editEvent, (eventGraph, {id, updates}) => {
     if (!eventGraph) return null;
 
-    const updatedNodes = eventGraph.events.map(event => (event.id === id ? {...event, ...updates} : event));
+    const updatedNodes = eventGraph.events.map(event => (true ? {...event, ...updates} : event));
 
     return {...eventGraph, events: updatedNodes};

[NoCoverage] EqualityOperator
src/models/EventGraphModel.ts:90:58
   .on(editEvent, (eventGraph, {id, updates}) => {
     if (!eventGraph) return null;
 
-    const updatedNodes = eventGraph.events.map(event => (event.id === id ? {...event, ...updates} : event));
+    const updatedNodes = eventGraph.events.map(event => (event.id !== id ? {...event, ...updates} : event));
 
     return {...eventGraph, events: updatedNodes};

[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:94:45
 
     return {...eventGraph, events: updatedNodes};
   })
-  .on(removeEvent, (eventGraph, payload) => {
-    const filteredEvents = eventGraph?.events?.filter(event => event.id !== payload);
-    const filteredLinks = eventGraph?.links?.filter(link => link.eventId !== payload);
-
-    return {...eventGraph, events: filteredEvents, links: filteredLinks};
-  })
+  .on(removeEvent, (eventGraph, payload) => {})
   .on(removeAllEvents, eventGraph => ({...eventGraph, events: [], links: eventGraph.links}))
   .on(addLink, (eventGraph, payload) => {

[NoCoverage] OptionalChaining
src/models/EventGraphModel.ts:95:28
     return {...eventGraph, events: updatedNodes};
   })
   .on(removeEvent, (eventGraph, payload) => {
-    const filteredEvents = eventGraph?.events?.filter(event => event.id !== payload);
+    const filteredEvents = eventGraph?.events.filter(event => event.id !== payload);
     const filteredLinks = eventGraph?.links?.filter(link => link.eventId !== payload);
 

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:95:64
     return {...eventGraph, events: updatedNodes};
   })
   .on(removeEvent, (eventGraph, payload) => {
-    const filteredEvents = eventGraph?.events?.filter(event => event.id !== payload);
+    const filteredEvents = eventGraph?.events?.filter(event => false);
     const filteredLinks = eventGraph?.links?.filter(link => link.eventId !== payload);
 

[NoCoverage] OptionalChaining
src/models/EventGraphModel.ts:96:27
   })
   .on(removeEvent, (eventGraph, payload) => {
     const filteredEvents = eventGraph?.events?.filter(event => event.id !== payload);
-    const filteredLinks = eventGraph?.links?.filter(link => link.eventId !== payload);
+    const filteredLinks = eventGraph?.links.filter(link => link.eventId !== payload);
 
     return {...eventGraph, events: filteredEvents, links: filteredLinks};

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:96:61
   })
   .on(removeEvent, (eventGraph, payload) => {
     const filteredEvents = eventGraph?.events?.filter(event => event.id !== payload);
-    const filteredLinks = eventGraph?.links?.filter(link => link.eventId !== payload);
+    const filteredLinks = eventGraph?.links?.filter(link => true);
 
     return {...eventGraph, events: filteredEvents, links: filteredLinks};

[NoCoverage] ObjectLiteral
src/models/EventGraphModel.ts:98:12
     const filteredEvents = eventGraph?.events?.filter(event => event.id !== payload);
     const filteredLinks = eventGraph?.links?.filter(link => link.eventId !== payload);
 
-    return {...eventGraph, events: filteredEvents, links: filteredLinks};
+    return {};
   })
   .on(removeAllEvents, eventGraph => ({...eventGraph, events: [], links: eventGraph.links}))

[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:101:41
     return {...eventGraph, events: filteredEvents, links: filteredLinks};
   })
   .on(removeAllEvents, eventGraph => ({...eventGraph, events: [], links: eventGraph.links}))
-  .on(addLink, (eventGraph, payload) => {
-    const newEdge: LinkDTO = {
-      id: uuidv4(),
-      fromId: payload.fromId,
-      toId: payload.toId,
-      group: payload.group,
-      eventId: payload.eventId,
-    };
-
-    const updatedLinks = eventGraph.links ? [...(eventGraph.links || []), newEdge] : [newEdge];
-
-    return {
-      ...eventGraph,
-      links: updatedLinks,
-    };
-  })
+  .on(addLink, (eventGraph, payload) => {})
   .on(addLinks, (eventGraph, payload) => {
     const updatedLinks = eventGraph.links ? [...eventGraph.links, ...payload] : payload;

[NoCoverage] LogicalOperator
src/models/EventGraphModel.ts:110:50
       eventId: payload.eventId,
     };
 
-    const updatedLinks = eventGraph.links ? [...(eventGraph.links || []), newEdge] : [newEdge];
+    const updatedLinks = eventGraph.links ? [...(eventGraph.links && []), newEdge] : [newEdge];
 
     return {

[NoCoverage] ArrayDeclaration
src/models/EventGraphModel.ts:110:86
       eventId: payload.eventId,
     };
 
-    const updatedLinks = eventGraph.links ? [...(eventGraph.links || []), newEdge] : [newEdge];
+    const updatedLinks = eventGraph.links ? [...(eventGraph.links || []), newEdge] : [];
 
     return {

[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:117:42
       links: updatedLinks,
     };
   })
-  .on(addLinks, (eventGraph, payload) => {
-    const updatedLinks = eventGraph.links ? [...eventGraph.links, ...payload] : payload;
-
-    return {
-      ...eventGraph,
-      links: updatedLinks,
-    };
-  })
+  .on(addLinks, (eventGraph, payload) => {})
   .on(editLink, (eventGraph, {fromId, toId, updates}) => {
     const updatedLinks = eventGraph.links.map(link =>

[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:125:58
       links: updatedLinks,
     };
   })
-  .on(editLink, (eventGraph, {fromId, toId, updates}) => {
-    const updatedLinks = eventGraph.links.map(link =>
-      link.fromId === fromId && link.toId === toId ? {...link, ...updates} : link
-    );
-
-    return {
-      ...eventGraph,
-      links: updatedLinks,
-    };
-  })
+  .on(editLink, (eventGraph, {fromId, toId, updates}) => {})
   .on(removeLinks, (eventGraph, payload) => ({
     ...eventGraph,

[NoCoverage] ArrowFunction
src/models/EventGraphModel.ts:126:47
     };
   })
   .on(editLink, (eventGraph, {fromId, toId, updates}) => {
-    const updatedLinks = eventGraph.links.map(link =>
-      link.fromId === fromId && link.toId === toId ? {...link, ...updates} : link
+    const updatedLinks = eventGraph.links.map(() => undefined
     );
 

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:127:33
   })
   .on(editLink, (eventGraph, {fromId, toId, updates}) => {
     const updatedLinks = eventGraph.links.map(link =>
-      link.fromId === fromId && link.toId === toId ? {...link, ...updates} : link
+      link.fromId === fromId && true ? {...link, ...updates} : link
     );
 

[NoCoverage] EqualityOperator
src/models/EventGraphModel.ts:127:33
   })
   .on(editLink, (eventGraph, {fromId, toId, updates}) => {
     const updatedLinks = eventGraph.links.map(link =>
-      link.fromId === fromId && link.toId === toId ? {...link, ...updates} : link
+      link.fromId === fromId && link.toId !== toId ? {...link, ...updates} : link
     );
 

[NoCoverage] ObjectLiteral
src/models/EventGraphModel.ts:130:12
       link.fromId === fromId && link.toId === toId ? {...link, ...updates} : link
     );
 
-    return {
-      ...eventGraph,
-      links: updatedLinks,
-    };
+    return {};
   })
   .on(removeLinks, (eventGraph, payload) => ({

[NoCoverage] ObjectLiteral
src/models/EventGraphModel.ts:135:46
       links: updatedLinks,
     };
   })
-  .on(removeLinks, (eventGraph, payload) => ({
-    ...eventGraph,
-    links: eventGraph.links.filter(link => !payload.includes(link.id)),
-  }))
+  .on(removeLinks, (eventGraph, payload) => ({}))
   .on(removeLink, (eventGraph, payload) => ({
     ...eventGraph,

[NoCoverage] ArrowFunction
src/models/EventGraphModel.ts:137:36
   })
   .on(removeLinks, (eventGraph, payload) => ({
     ...eventGraph,
-    links: eventGraph.links.filter(link => !payload.includes(link.id)),
+    links: eventGraph.links.filter(() => undefined),
   }))
   .on(removeLink, (eventGraph, payload) => ({

[NoCoverage] MethodExpression
src/models/EventGraphModel.ts:137:12
   })
   .on(removeLinks, (eventGraph, payload) => ({
     ...eventGraph,
-    links: eventGraph.links.filter(link => !payload.includes(link.id)),
+    links: eventGraph.links,
   }))
   .on(removeLink, (eventGraph, payload) => ({

[NoCoverage] BooleanLiteral
src/models/EventGraphModel.ts:141:44
   }))
   .on(removeLink, (eventGraph, payload) => ({
     ...eventGraph,
-    links: eventGraph.links.filter(link => !payload.includes(link.id)),
+    links: eventGraph.links.filter(link => payload.includes(link.id)),
   }))
   .on(addTag, (eventGraph, payload) => {

[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:143:40
     ...eventGraph,
     links: eventGraph.links.filter(link => !payload.includes(link.id)),
   }))
-  .on(addTag, (eventGraph, payload) => {
-    // Если eventGraph не существует, создаем новый объект с тегом
-    if (!eventGraph) {
-      return {tags: [payload]};
-    }
-
-    // Если tags не существует, инициализируем пустым массивом
-    const currentTags = eventGraph.tags || [];
-
-    // Если тег уже есть, возвращаем исходный объект без изменений
-    if (currentTags.includes(payload)) {
-      return eventGraph;
-    }
-
-    // Добавляем новый тег
-    return {
-      ...eventGraph,
-      tags: [...currentTags, payload],
-    };
-  })
+  .on(addTag, (eventGraph, payload) => {})
   .on(addTagToEvent, (eventGraph, payload) => {
     const {id, newTag} = payload; // Извлекаем id события и новый тег

[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:145:22
   }))
   .on(addTag, (eventGraph, payload) => {
     // Если eventGraph не существует, создаем новый объект с тегом
-    if (!eventGraph) {
-      return {tags: [payload]};
-    }
+    if (!eventGraph) {}
 
     // Если tags не существует, инициализируем пустым массивом

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:145:9
   }))
   .on(addTag, (eventGraph, payload) => {
     // Если eventGraph не существует, создаем новый объект с тегом
-    if (!eventGraph) {
+    if (false) {
       return {tags: [payload]};
     }

[NoCoverage] ObjectLiteral
src/models/EventGraphModel.ts:146:14
   .on(addTag, (eventGraph, payload) => {
     // Если eventGraph не существует, создаем новый объект с тегом
     if (!eventGraph) {
-      return {tags: [payload]};
+      return {};
     }
 

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:153:9
     const currentTags = eventGraph.tags || [];
 
     // Если тег уже есть, возвращаем исходный объект без изменений
-    if (currentTags.includes(payload)) {
+    if (false) {
       return eventGraph;
     }

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:153:9
     const currentTags = eventGraph.tags || [];
 
     // Если тег уже есть, возвращаем исходный объект без изменений
-    if (currentTags.includes(payload)) {
+    if (true) {
       return eventGraph;
     }

[NoCoverage] ObjectLiteral
src/models/EventGraphModel.ts:158:12
     }
 
     // Добавляем новый тег
-    return {
-      ...eventGraph,
-      tags: [...currentTags, payload],
-    };
+    return {};
   })
   .on(addTagToEvent, (eventGraph, payload) => {

[NoCoverage] ArrayDeclaration
src/models/EventGraphModel.ts:160:13
     // Добавляем новый тег
     return {
       ...eventGraph,
-      tags: [...currentTags, payload],
+      tags: [],
     };
   })

[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:163:47
       tags: [...currentTags, payload],
     };
   })
-  .on(addTagToEvent, (eventGraph, payload) => {
-    const {id, newTag} = payload; // Извлекаем id события и новый тег
-    return {
-      ...eventGraph,
-      events: eventGraph.events.map(event => {
-        if (event.id === id) {
-          // Если id совпадает, добавляем новый тег к событию
-          return {
-            ...event,
-            tags: [...event.tags, String(newTag)], // Убедимся, что newTag - строка
-          };
-        }
-        return event; // Возвращаем событие без изменений
-      }),
-    };
-  })
+  .on(addTagToEvent, (eventGraph, payload) => {})
   .on(removeNodeWithConnectedLinks, (eventGraph, payload) => ({
     ...eventGraph,

[NoCoverage] ObjectLiteral
src/models/EventGraphModel.ts:165:12
   })
   .on(addTagToEvent, (eventGraph, payload) => {
     const {id, newTag} = payload; // Извлекаем id события и новый тег
-    return {
-      ...eventGraph,
-      events: eventGraph.events.map(event => {
-        if (event.id === id) {
-          // Если id совпадает, добавляем новый тег к событию
-          return {
-            ...event,
-            tags: [...event.tags, String(newTag)], // Убедимся, что newTag - строка
-          };
-        }
-        return event; // Возвращаем событие без изменений
-      }),
-    };
+    return {};
   })
   .on(removeNodeWithConnectedLinks, (eventGraph, payload) => ({

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:168:13
     return {
       ...eventGraph,
       events: eventGraph.events.map(event => {
-        if (event.id === id) {
+        if (false) {
           // Если id совпадает, добавляем новый тег к событию
           return {

[NoCoverage] BlockStatement
src/models/EventGraphModel.ts:168:30
     return {
       ...eventGraph,
       events: eventGraph.events.map(event => {
-        if (event.id === id) {
-          // Если id совпадает, добавляем новый тег к событию
-          return {
-            ...event,
-            tags: [...event.tags, String(newTag)], // Убедимся, что newTag - строка
-          };
-        }
+        if (event.id === id) {}
         return event; // Возвращаем событие без изменений
       }),

[NoCoverage] MethodExpression
src/models/EventGraphModel.ts:181:12
   })
   .on(removeNodeWithConnectedLinks, (eventGraph, payload) => ({
     ...eventGraph,
-    nodes: eventGraph.nodes.filter(node => node.id !== payload),
+    nodes: eventGraph.nodes,
     links: eventGraph.links?.filter(link => link.fromId !== payload && link.toId !== payload) || [],
   }))

[NoCoverage] LogicalOperator
src/models/EventGraphModel.ts:182:12
   .on(removeNodeWithConnectedLinks, (eventGraph, payload) => ({
     ...eventGraph,
     nodes: eventGraph.nodes.filter(node => node.id !== payload),
-    links: eventGraph.links?.filter(link => link.fromId !== payload && link.toId !== payload) || [],
+    links: eventGraph.links?.filter(link => link.fromId !== payload && link.toId !== payload) && [],
   }))
   .on(removeNodes, (eventGraph, payload) => ({

[NoCoverage] ConditionalExpression
src/models/EventGraphModel.ts:182:45
   .on(removeNodeWithConnectedLinks, (eventGraph, payload) => ({
     ...eventGraph,
     nodes: eventGraph.nodes.filter(node => node.id !== payload),
-    links: eventGraph.links?.filter(link => link.fromId !== payload && link.toId !== payload) || [],
+    links: eventGraph.links?.filter(link => true) || [],
   }))
   .on(removeNodes, (eventGraph, payload) => ({

[NoCoverage] BooleanLiteral
src/models/EventGraphModel.ts:186:44
   }))
   .on(removeNodes, (eventGraph, payload) => ({
     ...eventGraph,
-    nodes: eventGraph.nodes.filter(node => !payload.includes(node.id)),
+    nodes: eventGraph.nodes.filter(node => payload.includes(node.id)),
   }))
   .reset(clearEventGraph);

[NoCoverage] ArrowFunction
src/models/EventGraphModel.ts:186:36
   }))
   .on(removeNodes, (eventGraph, payload) => ({
     ...eventGraph,
-    nodes: eventGraph.nodes.filter(node => !payload.includes(node.id)),
+    nodes: eventGraph.nodes.filter(() => undefined),
   }))
   .reset(clearEventGraph);

[NoCoverage] ArrowFunction
src/models/EventGraphModel.ts:193:33
 // Асинхронный эффект для получения данных графа
 export const fetchEventGraphDataFx = createEffect(async ({fileList}: { fileList: NFileInput.TUploadFile[] }) => {
   try {
-    const files = fileList?.map(el => el.originFileObj) || [];
+    const files = fileList?.map(() => undefined) || [];
 
     const request = {

[NoCoverage] OptionalChaining
src/models/EventGraphModel.ts:193:19
 // Асинхронный эффект для получения данных графа
 export const fetchEventGraphDataFx = createEffect(async ({fileList}: { fileList: NFileInput.TUploadFile[] }) => {
   try {
-    const files = fileList?.map(el => el.originFileObj) || [];
+    const files = fileList.map(el => el.originFileObj) || [];
 
     const request = {

[NoCoverage] LogicalOperator
src/models/EventGraphModel.ts:197:19
 
     const request = {
       files,
-      eventGraph: $eventGraph.getState() || {},
+      eventGraph: $eventGraph.getState() && {},
     };
 
