[NoCoverage] BlockStatement
src/App.tsx:20:9
   withQueryClient,
   withRouter,
   withTheme
-)(() => {
-  const logError = (error: Error, info: {componentStack: string}) => {
-    console.error('Caught an error:', error, info);
-  };
-
-  return (
-    <Layout>
-      <ErrorBoundary FallbackComponent={ErrorPage} onError={logError}>
-        <Routes>
-          <Route path={PATHS.root} element={<VisualiserPage />} />
-          <Route path={PATHS.editor} element={<JsonEditorPageComponent />} />
-        </Routes>
-      </ErrorBoundary>
-    </Layout>
-  );
-});
+)(() => {});
 

[NoCoverage] BlockStatement
src/App.tsx:21:70
   withRouter,
   withTheme
 )(() => {
-  const logError = (error: Error, info: {componentStack: string}) => {
-    console.error('Caught an error:', error, info);
-  };
+  const logError = (error: Error, info: {componentStack: string}) => {};
 
   return (
