[NoCoverage] BlockStatement
src/helpers/electron/checkJavaVersion.ts:9:36
  * Checks Java version.
  */
 export const checkJavaVersion = async () =>
-  new Promise((resolve, reject) => {
-    exec(
-      'java -version',
-      // @ts-ignore
-      {stdio: ['ignore', 'pipe', 'pipe'], encoding: 'utf8'},
-      // @ts-ignore
-      (error, _, stderr) => {
-        if (error) return reject(new Error('Java needs to be installed.'));
-
-        const versionMatch = stderr.match(/version "(\d+)\.(\d+)\.(\d+)_?(\d+)?/);
-
-        if (!versionMatch) return reject(new Error('Unable to determine Java version.'));
-
-        const majorVersion = parseInt(versionMatch[1], 10);
-        const minorVersion = parseInt(versionMatch[2], 10);
-        const patchVersion = parseInt(versionMatch[3], 10);
-
-        if (majorVersion < REQUIRED_JAVA_VERSION) {
-          return reject(new Error(`Requires Java ${REQUIRED_JAVA_VERSION} or higher.`));
-        }
-
-        resolve({majorVersion, minorVersion, patchVersion});
-      }
-    );
-  });
+  new Promise((resolve, reject) => {});
 

[NoCoverage] ArrayDeclaration
src/helpers/electron/checkJavaVersion.ts:13:15
     exec(
       'java -version',
       // @ts-ignore
-      {stdio: ['ignore', 'pipe', 'pipe'], encoding: 'utf8'},
+      {stdio: [], encoding: 'utf8'},
       // @ts-ignore
       (error, _, stderr) => {

[NoCoverage] StringLiteral
src/helpers/electron/checkJavaVersion.ts:13:16
     exec(
       'java -version',
       // @ts-ignore
-      {stdio: ['ignore', 'pipe', 'pipe'], encoding: 'utf8'},
+      {stdio: ["", 'pipe', 'pipe'], encoding: 'utf8'},
       // @ts-ignore
       (error, _, stderr) => {

[NoCoverage] BlockStatement
src/helpers/electron/checkJavaVersion.ts:15:29
       // @ts-ignore
       {stdio: ['ignore', 'pipe', 'pipe'], encoding: 'utf8'},
       // @ts-ignore
-      (error, _, stderr) => {
-        if (error) return reject(new Error('Java needs to be installed.'));
-
-        const versionMatch = stderr.match(/version "(\d+)\.(\d+)\.(\d+)_?(\d+)?/);
-
-        if (!versionMatch) return reject(new Error('Unable to determine Java version.'));
-
-        const majorVersion = parseInt(versionMatch[1], 10);
-        const minorVersion = parseInt(versionMatch[2], 10);
-        const patchVersion = parseInt(versionMatch[3], 10);
-
-        if (majorVersion < REQUIRED_JAVA_VERSION) {
-          return reject(new Error(`Requires Java ${REQUIRED_JAVA_VERSION} or higher.`));
-        }
-
-        resolve({majorVersion, minorVersion, patchVersion});
-      }
+      (error, _, stderr) => {}
     );
   });

[NoCoverage] ConditionalExpression
src/helpers/electron/checkJavaVersion.ts:16:13
       {stdio: ['ignore', 'pipe', 'pipe'], encoding: 'utf8'},
       // @ts-ignore
       (error, _, stderr) => {
-        if (error) return reject(new Error('Java needs to be installed.'));
+        if (true) return reject(new Error('Java needs to be installed.'));
 
         const versionMatch = stderr.match(/version "(\d+)\.(\d+)\.(\d+)_?(\d+)?/);

[NoCoverage] ConditionalExpression
src/helpers/electron/checkJavaVersion.ts:16:13
       {stdio: ['ignore', 'pipe', 'pipe'], encoding: 'utf8'},
       // @ts-ignore
       (error, _, stderr) => {
-        if (error) return reject(new Error('Java needs to be installed.'));
+        if (false) return reject(new Error('Java needs to be installed.'));
 
         const versionMatch = stderr.match(/version "(\d+)\.(\d+)\.(\d+)_?(\d+)?/);

[NoCoverage] Regex
src/helpers/electron/checkJavaVersion.ts:18:43
       (error, _, stderr) => {
         if (error) return reject(new Error('Java needs to be installed.'));
 
-        const versionMatch = stderr.match(/version "(\d+)\.(\d+)\.(\d+)_?(\d+)?/);
+        const versionMatch = stderr.match(/version "(\d+)\.(\d+)\.(\d+)_(\d+)?/);
 
         if (!versionMatch) return reject(new Error('Unable to determine Java version.'));

[NoCoverage] Regex
src/helpers/electron/checkJavaVersion.ts:18:43
       (error, _, stderr) => {
         if (error) return reject(new Error('Java needs to be installed.'));
 
-        const versionMatch = stderr.match(/version "(\d+)\.(\d+)\.(\d+)_?(\d+)?/);
+        const versionMatch = stderr.match(/version "(\d)\.(\d+)\.(\d+)_?(\d+)?/);
 
         if (!versionMatch) return reject(new Error('Unable to determine Java version.'));

[NoCoverage] BooleanLiteral
src/helpers/electron/checkJavaVersion.ts:20:13
 
         const versionMatch = stderr.match(/version "(\d+)\.(\d+)\.(\d+)_?(\d+)?/);
 
-        if (!versionMatch) return reject(new Error('Unable to determine Java version.'));
+        if (versionMatch) return reject(new Error('Unable to determine Java version.'));
 
         const majorVersion = parseInt(versionMatch[1], 10);

[NoCoverage] ConditionalExpression
src/helpers/electron/checkJavaVersion.ts:20:13
 
         const versionMatch = stderr.match(/version "(\d+)\.(\d+)\.(\d+)_?(\d+)?/);
 
-        if (!versionMatch) return reject(new Error('Unable to determine Java version.'));
+        if (true) return reject(new Error('Unable to determine Java version.'));
 
         const majorVersion = parseInt(versionMatch[1], 10);

[NoCoverage] EqualityOperator
src/helpers/electron/checkJavaVersion.ts:26:13
         const minorVersion = parseInt(versionMatch[2], 10);
         const patchVersion = parseInt(versionMatch[3], 10);
 
-        if (majorVersion < REQUIRED_JAVA_VERSION) {
+        if (majorVersion >= REQUIRED_JAVA_VERSION) {
           return reject(new Error(`Requires Java ${REQUIRED_JAVA_VERSION} or higher.`));
         }

[NoCoverage] ConditionalExpression
src/helpers/electron/checkJavaVersion.ts:26:13
         const minorVersion = parseInt(versionMatch[2], 10);
         const patchVersion = parseInt(versionMatch[3], 10);
 
-        if (majorVersion < REQUIRED_JAVA_VERSION) {
+        if (true) {
           return reject(new Error(`Requires Java ${REQUIRED_JAVA_VERSION} or higher.`));
         }

[NoCoverage] ObjectLiteral
src/helpers/electron/checkJavaVersion.ts:30:17
           return reject(new Error(`Requires Java ${REQUIRED_JAVA_VERSION} or higher.`));
         }
 
-        resolve({majorVersion, minorVersion, patchVersion});
+        resolve({});
       }
     );
