[NoCoverage] ArrowFunction
src/helpers/electron/createLogger.ts:16:42
 
   const logger = log.create({logId});
 
-  logger.transports.file.resolvePathFn = () => path.join(__dirname, '../..', logPath);
+  logger.transports.file.resolvePathFn = () => undefined;
 
   return logger;
