[NoCoverage] BooleanLiteral
src/helpers/electron/getJarPath.ts:9:11
  * Get jar-file actual path.
  */
 export const getJarPath = () => {
-  switch (true) {
+  switch (false) {
     case isDev:
       return path.join(process.cwd(), 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');

[NoCoverage] ConditionalExpression
src/helpers/electron/getJarPath.ts:10:5
  */
 export const getJarPath = () => {
   switch (true) {
-    case isDev:
-      return path.join(process.cwd(), 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
+    case isDev:
 
     case process.platform === 'darwin':

[NoCoverage] StringLiteral
src/helpers/electron/getJarPath.ts:11:52
 export const getJarPath = () => {
   switch (true) {
     case isDev:
-      return path.join(process.cwd(), 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
+      return path.join(process.cwd(), 'jar-files', "");
 
     case process.platform === 'darwin':

[NoCoverage] EqualityOperator
src/helpers/electron/getJarPath.ts:13:10
     case isDev:
       return path.join(process.cwd(), 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
 
-    case process.platform === 'darwin':
+    case process.platform !== 'darwin':
       return path.join(process.cwd(), 'Contents', 'Resources', 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
 

[NoCoverage] ConditionalExpression
src/helpers/electron/getJarPath.ts:13:10
     case isDev:
       return path.join(process.cwd(), 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
 
-    case process.platform === 'darwin':
+    case true:
       return path.join(process.cwd(), 'Contents', 'Resources', 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
 

[NoCoverage] StringLiteral
src/helpers/electron/getJarPath.ts:14:64
       return path.join(process.cwd(), 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
 
     case process.platform === 'darwin':
-      return path.join(process.cwd(), 'Contents', 'Resources', 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
+      return path.join(process.cwd(), 'Contents', 'Resources', "", 'axenapi-web-1.0-SNAPSHOT.jar');
 
     default:

[NoCoverage] StringLiteral
src/helpers/electron/getJarPath.ts:14:77
       return path.join(process.cwd(), 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
 
     case process.platform === 'darwin':
-      return path.join(process.cwd(), 'Contents', 'Resources', 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
+      return path.join(process.cwd(), 'Contents', 'Resources', 'jar-files', "");
 
     default:

[NoCoverage] ConditionalExpression
src/helpers/electron/getJarPath.ts:16:5
     case process.platform === 'darwin':
       return path.join(process.cwd(), 'Contents', 'Resources', 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
 
-    default:
-      return path.join(process.cwd(), 'resources', 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
+    default:
   }
 };

[NoCoverage] StringLiteral
src/helpers/electron/getJarPath.ts:17:52
       return path.join(process.cwd(), 'Contents', 'Resources', 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
 
     default:
-      return path.join(process.cwd(), 'resources', 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
+      return path.join(process.cwd(), 'resources', "", 'axenapi-web-1.0-SNAPSHOT.jar');
   }
 };

[NoCoverage] StringLiteral
src/helpers/electron/getJarPath.ts:17:39
       return path.join(process.cwd(), 'Contents', 'Resources', 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
 
     default:
-      return path.join(process.cwd(), 'resources', 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
+      return path.join(process.cwd(), "", 'jar-files', 'axenapi-web-1.0-SNAPSHOT.jar');
   }
 };
