[NoCoverage] ConditionalExpression
src/helpers/electron/getJavaErrorMessage.ts:9:3
  * @param {{code?: string; message?: string}} error Error info.
  */
 export const getJavaErrorMessage = (error: {code?: string; message?: string}) =>
-  error.code === 'ENOENT'
+  false
     ? `Java is not installed. Please install Java ${REQUIRED_JAVA_VERSION} or higher.\nWant to restart?`
     : `An error occurred while checking Java version: ${error.message}.\nWant to restart?`;

[NoCoverage] EqualityOperator
src/helpers/electron/getJavaErrorMessage.ts:9:3
  * @param {{code?: string; message?: string}} error Error info.
  */
 export const getJavaErrorMessage = (error: {code?: string; message?: string}) =>
-  error.code === 'ENOENT'
+  error.code !== 'ENOENT'
     ? `Java is not installed. Please install Java ${REQUIRED_JAVA_VERSION} or higher.\nWant to restart?`
     : `An error occurred while checking Java version: ${error.message}.\nWant to restart?`;

[NoCoverage] StringLiteral
src/helpers/electron/getJavaErrorMessage.ts:10:7
  */
 export const getJavaErrorMessage = (error: {code?: string; message?: string}) =>
   error.code === 'ENOENT'
-    ? `Java is not installed. Please install Java ${REQUIRED_JAVA_VERSION} or higher.\nWant to restart?`
+    ? ``
     : `An error occurred while checking Java version: ${error.message}.\nWant to restart?`;
 
