[NoCoverage] BooleanLiteral
src/helpers/electron/handleDownload.ts:12:9
   try {
     // Получаем или создаём ссылку на окно браузера
     let targetWindow = BrowserWindow.getFocusedWindow();
-    if (!targetWindow) {
+    if (targetWindow) {
       const windows = BrowserWindow.getAllWindows();
       targetWindow = windows.length > 0 ? windows[0] : new BrowserWindow({show: false});

[NoCoverage] ConditionalExpression
src/helpers/electron/handleDownload.ts:12:9
   try {
     // Получаем или создаём ссылку на окно браузера
     let targetWindow = BrowserWindow.getFocusedWindow();
-    if (!targetWindow) {
+    if (false) {
       const windows = BrowserWindow.getAllWindows();
       targetWindow = windows.length > 0 ? windows[0] : new BrowserWindow({show: false});

[NoCoverage] BooleanLiteral
src/helpers/electron/handleDownload.ts:14:81
     let targetWindow = BrowserWindow.getFocusedWindow();
     if (!targetWindow) {
       const windows = BrowserWindow.getAllWindows();
-      targetWindow = windows.length > 0 ? windows[0] : new BrowserWindow({show: false});
+      targetWindow = windows.length > 0 ? windows[0] : new BrowserWindow({show: true});
     }
 

[NoCoverage] EqualityOperator
src/helpers/electron/handleDownload.ts:14:22
     let targetWindow = BrowserWindow.getFocusedWindow();
     if (!targetWindow) {
       const windows = BrowserWindow.getAllWindows();
-      targetWindow = windows.length > 0 ? windows[0] : new BrowserWindow({show: false});
+      targetWindow = windows.length >= 0 ? windows[0] : new BrowserWindow({show: false});
     }
 

[NoCoverage] BlockStatement
src/helpers/electron/handleDownload.ts:21:11
     const results = await files.reduce(async (accumulatorPromise, {filename, url}) => {
       const accumulator = await accumulatorPromise;
 
-      try {
-        const downloadOptions = {
-          filename: filename || path.basename(url),
-          saveAs: false, // Отключаем диалог сохранения для каждого файла
-        };
-
-        const dl = await download(targetWindow as BrowserWindow, url, downloadOptions);
-        return [
-          ...accumulator,
-          {
-            savePath: dl.getSavePath(),
-            filename: downloadOptions.filename,
-          },
-        ];
-      } catch (error) {
+      try {} catch (error) {
         console.error(`Failed to download ${url}:`, error);
         return accumulator; // Пропускаем неудачные загрузки

[NoCoverage] LogicalOperator
src/helpers/electron/handleDownload.ts:23:21
 
       try {
         const downloadOptions = {
-          filename: filename || path.basename(url),
+          filename: filename && path.basename(url),
           saveAs: false, // Отключаем диалог сохранения для каждого файла
         };

[NoCoverage] BooleanLiteral
src/helpers/electron/handleDownload.ts:24:19
       try {
         const downloadOptions = {
           filename: filename || path.basename(url),
-          saveAs: false, // Отключаем диалог сохранения для каждого файла
+          saveAs: true, // Отключаем диалог сохранения для каждого файла
         };
 

[NoCoverage] ObjectLiteral
src/helpers/electron/handleDownload.ts:30:11
         const dl = await download(targetWindow as BrowserWindow, url, downloadOptions);
         return [
           ...accumulator,
-          {
-            savePath: dl.getSavePath(),
-            filename: downloadOptions.filename,
-          },
+          {},
         ];
       } catch (error) {

[NoCoverage] BlockStatement
src/helpers/electron/handleDownload.ts:35:23
             filename: downloadOptions.filename,
           },
         ];
-      } catch (error) {
-        console.error(`Failed to download ${url}:`, error);
-        return accumulator; // Пропускаем неудачные загрузки
-      }
+      } catch (error) {}
     }, Promise.resolve([]));
 

[NoCoverage] StringLiteral
src/helpers/electron/handleDownload.ts:36:23
           },
         ];
       } catch (error) {
-        console.error(`Failed to download ${url}:`, error);
+        console.error(``, error);
         return accumulator; // Пропускаем неудачные загрузки
       }

[NoCoverage] BlockStatement
src/helpers/electron/handleDownload.ts:41:31
       }
     }, Promise.resolve([]));
 
-    if (results.length === 0) {
-      throw new Error('All downloads failed');
-    }
+    if (results.length === 0) {}
 
     new Notification({

[NoCoverage] ConditionalExpression
src/helpers/electron/handleDownload.ts:41:9
       }
     }, Promise.resolve([]));
 
-    if (results.length === 0) {
+    if (false) {
       throw new Error('All downloads failed');
     }

[NoCoverage] ObjectLiteral
src/helpers/electron/handleDownload.ts:45:22
       throw new Error('All downloads failed');
     }
 
-    new Notification({
-      title: 'Download Complete',
-      body: results.length === 1 ? `Downloaded ${results[0].filename}` : `Downloaded ${results.length} files`,
-    })
+    new Notification({})
       .on('click', () => {
         if (results.length > 0) {

[NoCoverage] ConditionalExpression
src/helpers/electron/handleDownload.ts:47:13
 
     new Notification({
       title: 'Download Complete',
-      body: results.length === 1 ? `Downloaded ${results[0].filename}` : `Downloaded ${results.length} files`,
+      body: false ? `Downloaded ${results[0].filename}` : `Downloaded ${results.length} files`,
     })
       .on('click', () => {

[NoCoverage] EqualityOperator
src/helpers/electron/handleDownload.ts:47:13
 
     new Notification({
       title: 'Download Complete',
-      body: results.length === 1 ? `Downloaded ${results[0].filename}` : `Downloaded ${results.length} files`,
+      body: results.length !== 1 ? `Downloaded ${results[0].filename}` : `Downloaded ${results.length} files`,
     })
       .on('click', () => {

[NoCoverage] BlockStatement
src/helpers/electron/handleDownload.ts:49:26
       title: 'Download Complete',
       body: results.length === 1 ? `Downloaded ${results[0].filename}` : `Downloaded ${results.length} files`,
     })
-      .on('click', () => {
-        if (results.length > 0) {
-          // Открываем папку с файлом в проводнике
-          shell.showItemInFolder(results[0].savePath);
-        }
-      })
+      .on('click', () => {})
       .show();
 

[NoCoverage] ConditionalExpression
src/helpers/electron/handleDownload.ts:50:13
       body: results.length === 1 ? `Downloaded ${results[0].filename}` : `Downloaded ${results.length} files`,
     })
       .on('click', () => {
-        if (results.length > 0) {
+        if (true) {
           // Открываем папку с файлом в проводнике
           shell.showItemInFolder(results[0].savePath);

[NoCoverage] EqualityOperator
src/helpers/electron/handleDownload.ts:50:13
       body: results.length === 1 ? `Downloaded ${results[0].filename}` : `Downloaded ${results.length} files`,
     })
       .on('click', () => {
-        if (results.length > 0) {
+        if (results.length >= 0) {
           // Открываем папку с файлом в проводнике
           shell.showItemInFolder(results[0].savePath);

[NoCoverage] StringLiteral
src/helpers/electron/handleDownload.ts:57:23
       })
       .show();
 
-    event.sender.send('download-complete');
+    event.sender.send("");
   } catch (error) {
     new Notification({

[NoCoverage] BlockStatement
src/helpers/electron/handleDownload.ts:58:19
       .show();
 
     event.sender.send('download-complete');
-  } catch (error) {
-    new Notification({
-      title: 'Download Failed',
-    }).show();
-    event.sender.send('download-failed', error.message);
-    throw error;
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
src/helpers/electron/handleDownload.ts:60:14
     event.sender.send('download-complete');
   } catch (error) {
     new Notification({
-      title: 'Download Failed',
+      title: "",
     }).show();
     event.sender.send('download-failed', error.message);
