[NoCoverage] BlockStatement
src/preload.ts:10:42
 import {TDownloadItem} from '@/types/common';
 
 contextBridge.exposeInMainWorld('electronAPI', {
-  downloadFile: (file: TDownloadItem) => {
-    ipcRenderer.send('download', [file]);
-  },
+  downloadFile: (file: TDownloadItem) => {},
   downloadFiles: (files: TDownloadItem[]) => {
     ipcRenderer.send('download', files);

[NoCoverage] BlockStatement
src/preload.ts:13:46
   downloadFile: (file: TDownloadItem) => {
     ipcRenderer.send('download', [file]);
   },
-  downloadFiles: (files: TDownloadItem[]) => {
-    ipcRenderer.send('download', files);
-  },
+  downloadFiles: (files: TDownloadItem[]) => {},
   reloadApp: () => {
     ipcRenderer.send('reload-app');

[NoCoverage] BlockStatement
src/preload.ts:16:20
   downloadFiles: (files: TDownloadItem[]) => {
     ipcRenderer.send('download', files);
   },
-  reloadApp: () => {
-    ipcRenderer.send('reload-app');
-  },
+  reloadApp: () => {},
 });
 
