[NoCoverage] BlockStatement
shared/api/helpers/addTsNocheckPostGeneration.ts:14:53
  * Добавляет строку `// @ts-nocheck` в начало указанного файла.
  * @param filePath - Путь к файлу.
  */
-function addTsNocheckToFile(filePath: string): void {
-  try {
-    if (!fs.existsSync(filePath)) {
-      console.error(`File not found: ${filePath}`);
-      return;
-    }
-
-    const fileContent = fs.readFileSync(filePath, 'utf8');
-
-    if (!fileContent.startsWith('// @ts-nocheck')) {
-      const newContent = `// @ts-nocheck\n${fileContent}`;
-
-      fs.writeFileSync(filePath, newContent, 'utf8');
-      console.log(`Added "// @ts-nocheck" to ${filePath}`);
-    } else {
-      console.log(`File ${filePath} already contains "// @ts-nocheck". Skipping...`);
-    }
-  } catch (error) {
-    console.error(`Error processing file ${filePath}:`, (error as Error).message);
-  }
-}
+function addTsNocheckToFile(filePath: string): void {}
 
 const apiFilePath = path.resolve('./src/shared/api/event-graph-api/api.ts');

[NoCoverage] BlockStatement
shared/api/helpers/addTsNocheckPostGeneration.ts:15:7
  * @param filePath - Путь к файлу.
  */
 function addTsNocheckToFile(filePath: string): void {
-  try {
-    if (!fs.existsSync(filePath)) {
-      console.error(`File not found: ${filePath}`);
-      return;
-    }
-
-    const fileContent = fs.readFileSync(filePath, 'utf8');
-
-    if (!fileContent.startsWith('// @ts-nocheck')) {
-      const newContent = `// @ts-nocheck\n${fileContent}`;
-
-      fs.writeFileSync(filePath, newContent, 'utf8');
-      console.log(`Added "// @ts-nocheck" to ${filePath}`);
-    } else {
-      console.log(`File ${filePath} already contains "// @ts-nocheck". Skipping...`);
-    }
-  } catch (error) {
+  try {} catch (error) {
     console.error(`Error processing file ${filePath}:`, (error as Error).message);
   }

[NoCoverage] ConditionalExpression
shared/api/helpers/addTsNocheckPostGeneration.ts:16:9
  */
 function addTsNocheckToFile(filePath: string): void {
   try {
-    if (!fs.existsSync(filePath)) {
+    if (false) {
       console.error(`File not found: ${filePath}`);
       return;

[NoCoverage] ConditionalExpression
shared/api/helpers/addTsNocheckPostGeneration.ts:16:9
  */
 function addTsNocheckToFile(filePath: string): void {
   try {
-    if (!fs.existsSync(filePath)) {
+    if (true) {
       console.error(`File not found: ${filePath}`);
       return;

[NoCoverage] StringLiteral
shared/api/helpers/addTsNocheckPostGeneration.ts:17:21
 function addTsNocheckToFile(filePath: string): void {
   try {
     if (!fs.existsSync(filePath)) {
-      console.error(`File not found: ${filePath}`);
+      console.error(``);
       return;
     }

[NoCoverage] ConditionalExpression
shared/api/helpers/addTsNocheckPostGeneration.ts:23:9
 
     const fileContent = fs.readFileSync(filePath, 'utf8');
 
-    if (!fileContent.startsWith('// @ts-nocheck')) {
+    if (true) {
       const newContent = `// @ts-nocheck\n${fileContent}`;
 

[NoCoverage] BooleanLiteral
shared/api/helpers/addTsNocheckPostGeneration.ts:23:9
 
     const fileContent = fs.readFileSync(filePath, 'utf8');
 
-    if (!fileContent.startsWith('// @ts-nocheck')) {
+    if (fileContent.startsWith('// @ts-nocheck')) {
       const newContent = `// @ts-nocheck\n${fileContent}`;
 

[NoCoverage] StringLiteral
shared/api/helpers/addTsNocheckPostGeneration.ts:27:19
       const newContent = `// @ts-nocheck\n${fileContent}`;
 
       fs.writeFileSync(filePath, newContent, 'utf8');
-      console.log(`Added "// @ts-nocheck" to ${filePath}`);
+      console.log(``);
     } else {
       console.log(`File ${filePath} already contains "// @ts-nocheck". Skipping...`);

[NoCoverage] BlockStatement
shared/api/helpers/addTsNocheckPostGeneration.ts:28:12
 
       fs.writeFileSync(filePath, newContent, 'utf8');
       console.log(`Added "// @ts-nocheck" to ${filePath}`);
-    } else {
-      console.log(`File ${filePath} already contains "// @ts-nocheck". Skipping...`);
-    }
+    } else {}
   } catch (error) {
     console.error(`Error processing file ${filePath}:`, (error as Error).message);

[NoCoverage] BlockStatement
shared/api/helpers/addTsNocheckPostGeneration.ts:31:19
     } else {
       console.log(`File ${filePath} already contains "// @ts-nocheck". Skipping...`);
     }
-  } catch (error) {
-    console.error(`Error processing file ${filePath}:`, (error as Error).message);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
shared/api/helpers/addTsNocheckPostGeneration.ts:32:19
       console.log(`File ${filePath} already contains "// @ts-nocheck". Skipping...`);
     }
   } catch (error) {
-    console.error(`Error processing file ${filePath}:`, (error as Error).message);
+    console.error(``, (error as Error).message);
   }
 }
