[NoCoverage] StringLiteral
src/bootstrap.tsx:5:36
 
 import {App} from './App';
 
-createRoot(document.getElementById('root')).render(<App />);
+createRoot(document.getElementById("")).render(<App />);
 
