[NoCoverage] StringLiteral
commons/diagram/edges/CustomEdge.tsx:46:36
         <BaseEdge
           id={id}
           path={edgePath}
-          className={clsx(hidden ? 'opacity-30' : 'opacity-70')}
+          className={clsx(hidden ? "" : 'opacity-70')}
           style={{
             stroke: `${data.color}`,

[Survived] StringLiteral
commons/diagram/edges/CustomEdge.tsx:48:21
           path={edgePath}
           className={clsx(hidden ? 'opacity-30' : 'opacity-70')}
           style={{
-            stroke: `${data.color}`,
+            stroke: ``,
             strokeDasharray: isEdgeSelected ? '5,5' : 0,
           }}

[Survived] StringLiteral
commons/diagram/edges/CustomEdge.tsx:58:15
         <EdgeLabelRenderer>
           <div
             className={clsx(
-              'nodrag nopan pointer-events-auto absolute origin-center',
+              "",
               '-translate-x-1/2 -translate-y-1/2 transform',
               hidden && 'opacity-30'

[Survived] LogicalOperator
commons/diagram/edges/CustomEdge.tsx:60:15
             className={clsx(
               'nodrag nopan pointer-events-auto absolute origin-center',
               '-translate-x-1/2 -translate-y-1/2 transform',
-              hidden && 'opacity-30'
+              hidden || 'opacity-30'
             )}
             style={{

[Survived] ConditionalExpression
commons/diagram/edges/CustomEdge.tsx:60:15
             className={clsx(
               'nodrag nopan pointer-events-auto absolute origin-center',
               '-translate-x-1/2 -translate-y-1/2 transform',
-              hidden && 'opacity-30'
+              false
             )}
             style={{

[Survived] StringLiteral
commons/diagram/edges/CustomEdge.tsx:63:26
               hidden && 'opacity-30'
             )}
             style={{
-              transform: `rotate(${angle}deg)`,
+              transform: ``,
               top: labelY,
               left: labelX,

[Survived] ObjectLiteral
commons/diagram/edges/CustomEdge.tsx:70:22
           >
             <IconCircleArrowRight
               className={clsx('fill-diagram-bg hover:cursor-pointer')}
-              style={{color: `${data.color}`}}
+              style={{}}
             />
           </div>
