[NoCoverage] StringLiteral
commons/diagram/edges/DisconnectedEdge.tsx:43:65
         <BaseEdge
           id={id}
           path={edgePath}
-          className={clsx(hidden ? 'opacity-30' : 'opacity-70', 'stroke-color-error')}
+          className={clsx(hidden ? 'opacity-30' : 'opacity-70', "")}
           style={{
             strokeDasharray: isEdgeSelected ? '5,5' : 0,
