[NoCoverage] BlockStatement
commons/diagram/edges/ExpandableEdge.tsx:42:51
   // TODO не работает
   const hidden = hiddenItems.includes(data.eventId as string);
 
-  const handleEdgeDoubleClick = useCallback(() => {
-    expandItemByTopicId(data.topicId);
-  }, [data.topicId]);
+  const handleEdgeDoubleClick = useCallback(() => {}, [data.topicId]);
 
   const onEdgeClick = useSingleAndDoubleClick(() => {}, handleEdgeDoubleClick);

[NoCoverage] ArrayDeclaration
commons/diagram/edges/ExpandableEdge.tsx:44:6
 
   const handleEdgeDoubleClick = useCallback(() => {
     expandItemByTopicId(data.topicId);
-  }, [data.topicId]);
+  }, []);
 
   const onEdgeClick = useSingleAndDoubleClick(() => {}, handleEdgeDoubleClick);

[NoCoverage] StringLiteral
commons/diagram/edges/ExpandableEdge.tsx:54:51
         <BaseEdge
           id={id}
           path={edgePath}
-          className={clsx(hidden ? 'opacity-30' : 'opacity-70', 'stroke-expandable-edge')}
+          className={clsx(hidden ? 'opacity-30' : "", 'stroke-expandable-edge')}
         />
       </g>

[NoCoverage] StringLiteral
commons/diagram/edges/ExpandableEdge.tsx:54:65
         <BaseEdge
           id={id}
           path={edgePath}
-          className={clsx(hidden ? 'opacity-30' : 'opacity-70', 'stroke-expandable-edge')}
+          className={clsx(hidden ? 'opacity-30' : 'opacity-70', "")}
         />
       </g>

[NoCoverage] StringLiteral
commons/diagram/edges/ExpandableEdge.tsx:62:15
           <div
             className={clsx(
               'nodrag nopan pointer-events-auto absolute origin-center',
-              '-translate-x-1/2 -translate-y-1/2 transform',
+              "",
               hidden && 'opacity-30'
             )}

[NoCoverage] ConditionalExpression
commons/diagram/edges/ExpandableEdge.tsx:63:15
             className={clsx(
               'nodrag nopan pointer-events-auto absolute origin-center',
               '-translate-x-1/2 -translate-y-1/2 transform',
-              hidden && 'opacity-30'
+              true
             )}
             style={{
