[NoCoverage] BlockStatement
commons/diagram/edges/SimpleEdge.tsx:38:51
   // TODO это не будет работать
   const hidden = hiddenItems.includes(data.eventId as string);
 
-  const handleEdgeDoubleClick = useCallback(() => {
-    shrinkItemByTopicId(data.topicId);
-  }, [data.topicId]);
+  const handleEdgeDoubleClick = useCallback(() => {}, [data.topicId]);
 
   const onEdgeClick = useSingleAndDoubleClick(() => {}, handleEdgeDoubleClick);

[NoCoverage] ArrayDeclaration
commons/diagram/edges/SimpleEdge.tsx:40:6
 
   const handleEdgeDoubleClick = useCallback(() => {
     shrinkItemByTopicId(data.topicId);
-  }, [data.topicId]);
+  }, []);
 
   const onEdgeClick = useSingleAndDoubleClick(() => {}, handleEdgeDoubleClick);
