[NoCoverage] BlockStatement
diagram/modals/delete-items-modal/DeleteAllItemsModal.tsx:17:29
 
   const {isOpen} = deleteItemsModal;
 
-  const handleClose = () => {
-    closeDeleteItemsModal();
-  };
+  const handleClose = () => {};
 
   const handleOk = () => {

[NoCoverage] BlockStatement
diagram/modals/delete-items-modal/DeleteAllItemsModal.tsx:21:26
     closeDeleteItemsModal();
   };
 
-  const handleOk = () => {
-    closeDeleteItemsModal();
-    clearEventGraph();
-  };
+  const handleOk = () => {};
 
   return (

[Survived] StringLiteral
diagram/modals/delete-items-modal/DeleteAllItemsModal.tsx:28:23
 
   return (
     <UIKitModal
-      className={clsx('w-[520px]')}
+      className={clsx("")}
       closeIcon={<X size={22} />}
       isOpen={isOpen}
