[NoCoverage] EqualityOperator
diagram/modals/delete-items-modal/DeleteSelectedItemsFooter.tsx:18:25
   onDeleteNodeAndLinks,
   selectedItemsType,
 }: IDeleteSelectedItemsModalFooter) => {
-  const isDeleteLinks = selectedItemsType === 'link';
+  const isDeleteLinks = selectedItemsType !== 'link';
 
   if (isDeleteLinks) {

[NoCoverage] ConditionalExpression
diagram/modals/delete-items-modal/DeleteSelectedItemsFooter.tsx:18:25
   onDeleteNodeAndLinks,
   selectedItemsType,
 }: IDeleteSelectedItemsModalFooter) => {
-  const isDeleteLinks = selectedItemsType === 'link';
+  const isDeleteLinks = true;
 
   if (isDeleteLinks) {

[NoCoverage] ConditionalExpression
diagram/modals/delete-items-modal/DeleteSelectedItemsFooter.tsx:20:7
 }: IDeleteSelectedItemsModalFooter) => {
   const isDeleteLinks = selectedItemsType === 'link';
 
-  if (isDeleteLinks) {
+  if (true) {
     return (
       <div className="flex justify-end gap-2">

[NoCoverage] ConditionalExpression
diagram/modals/delete-items-modal/DeleteSelectedItemsFooter.tsx:20:7
 }: IDeleteSelectedItemsModalFooter) => {
   const isDeleteLinks = selectedItemsType === 'link';
 
-  if (isDeleteLinks) {
+  if (false) {
     return (
       <div className="flex justify-end gap-2">
