[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelNoEventsStub.tsx:18:59
   const {itemId} = infoPanelModal;
 
   const nodes = eventGraph.nodes || [];
-  const currentItem = itemId ? nodes.find(item => item && item.id === itemId) : null;
+  const currentItem = itemId ? nodes.find(item => item && true) : null;
 
   const handleOpenDrawerAddLink = useCallback(() => {

[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelNoEventsStub.tsx:18:51
   const {itemId} = infoPanelModal;
 
   const nodes = eventGraph.nodes || [];
-  const currentItem = itemId ? nodes.find(item => item && item.id === itemId) : null;
+  const currentItem = itemId ? nodes.find(item => false) : null;
 
   const handleOpenDrawerAddLink = useCallback(() => {

[NoCoverage] BlockStatement
diagram/modals/info-panel-modal/InfoPanelNoEventsStub.tsx:20:53
   const nodes = eventGraph.nodes || [];
   const currentItem = itemId ? nodes.find(item => item && item.id === itemId) : null;
 
-  const handleOpenDrawerAddLink = useCallback(() => {
-    openDrawerAddLink(currentItem.id);
-    closeInfoPanelModal();
-  }, [currentItem.id]);
+  const handleOpenDrawerAddLink = useCallback(() => {}, [currentItem.id]);
 
   return (

[NoCoverage] ArrayDeclaration
diagram/modals/info-panel-modal/InfoPanelNoEventsStub.tsx:23:6
   const handleOpenDrawerAddLink = useCallback(() => {
     openDrawerAddLink(currentItem.id);
     closeInfoPanelModal();
-  }, [currentItem.id]);
+  }, []);
 
   return (
