[NoCoverage] StringLiteral
commons/diagram/nodes/ExpandedEventNode.tsx:11:5
 
 export const ExpandedEventNode = ({data}: IExpandedEventNodeProps) => {
   const wrapperClassName = clsx(
-    'flex transition-all w-[11.688rem] items-center gap-2 border-2',
+    "",
     'border-solid px-4 py-3 align-middle',
     'rounded-sm border-colorful-blue-border bg-white'
