[NoCoverage] StringLiteral
src/helpers/electron/getLoggers.ts:4:53
 import {createLogger} from './createLogger';
 
 const coreLogger = createLogger('coreLogger', 'logs/core.log');
-const appExitLogger = createLogger('appExitLogger', 'logs/app-exit.log');
+const appExitLogger = createLogger('appExitLogger', "");
 const coreErrorLogger = createLogger('coreErrorLogger', 'logs/core-error.log');
 

[NoCoverage] StringLiteral
src/helpers/electron/getLoggers.ts:4:36
 import {createLogger} from './createLogger';
 
 const coreLogger = createLogger('coreLogger', 'logs/core.log');
-const appExitLogger = createLogger('appExitLogger', 'logs/app-exit.log');
+const appExitLogger = createLogger("", 'logs/app-exit.log');
 const coreErrorLogger = createLogger('coreErrorLogger', 'logs/core-error.log');
 
