[Killed] EqualityOperator
src/helpers/modal-helpers/getInfoPanelData.ts:11:66
   events: EventDTO[]
 ): InfoPanelData => {
   // Функция для поиска ноды по её ID
-  const findNodeById = (id: NodeDTO['id']) => nodes.find(node => node.id === id);
+  const findNodeById = (id: NodeDTO['id']) => nodes.find(node => node.id !== id);
 
   // Функция для поиска события по его ID
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,11 +1,11 @@
  Array [
    Object {

[Killed] ArrowFunction
src/helpers/modal-helpers/getInfoPanelData.ts:11:58
   events: EventDTO[]
 ): InfoPanelData => {
   // Функция для поиска ноды по её ID
-  const findNodeById = (id: NodeDTO['id']) => nodes.find(node => node.id === id);
+  const findNodeById = (id: NodeDTO['id']) => nodes.find(() => undefined);
 
   // Функция для поиска события по его ID
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 25
+ Received  +  1

- Array [
-   Object {
-     "belongsToGraph": Array [

[Killed] EqualityOperator
src/helpers/modal-helpers/getInfoPanelData.ts:14:70
   const findNodeById = (id: NodeDTO['id']) => nodes.find(node => node.id === id);
 
   // Функция для поиска события по его ID
-  const findEventById = (id: EventDTO['id']) => events.find(event => event.id === id);
+  const findEventById = (id: EventDTO['id']) => events.find(event => event.id !== id);
 
   // Фильтруем связи: входящие в ноду с `itemId` и исходящие из неё
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  +  1

@@ -3,22 +3,11 @@
      "belongsToGraph": Array [
        "a1b2c3d4-e5f6-7890-1234-567890abcdef",

[Killed] ConditionalExpression
src/helpers/modal-helpers/getInfoPanelData.ts:14:70
   const findNodeById = (id: NodeDTO['id']) => nodes.find(node => node.id === id);
 
   // Функция для поиска события по его ID
-  const findEventById = (id: EventDTO['id']) => events.find(event => event.id === id);
+  const findEventById = (id: EventDTO['id']) => events.find(event => true);
 
   // Фильтруем связи: входящие в ноду с `itemId` и исходящие из неё
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

@@ -27,18 +27,18 @@
        "a1b2c3d4-e5f6-7890-1234-567890abcdef",
      ],

[Killed] ArrowFunction
src/helpers/modal-helpers/getInfoPanelData.ts:17:40
   const findEventById = (id: EventDTO['id']) => events.find(event => event.id === id);
 
   // Фильтруем связи: входящие в ноду с `itemId` и исходящие из неё
-  const toMainNodeLinks = links.filter(link => link.toId === itemId); // Входящие связи
+  const toMainNodeLinks = links.filter(() => undefined); // Входящие связи
   const fromMainNodeLinks = links.filter(link => link.fromId === itemId); // Исходящие связи
 
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 25
+ Received  +  1

- Array [
-   Object {
-     "belongsToGraph": Array [

[Killed] MethodExpression
src/helpers/modal-helpers/getInfoPanelData.ts:17:27
   const findEventById = (id: EventDTO['id']) => events.find(event => event.id === id);
 
   // Фильтруем связи: входящие в ноду с `itemId` и исходящие из неё
-  const toMainNodeLinks = links.filter(link => link.toId === itemId); // Входящие связи
+  const toMainNodeLinks = links; // Входящие связи
   const fromMainNodeLinks = links.filter(link => link.fromId === itemId); // Исходящие связи
 
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 25

- Array []
+ Array [
+   Object {

[Killed] ConditionalExpression
src/helpers/modal-helpers/getInfoPanelData.ts:18:50
 
   // Фильтруем связи: входящие в ноду с `itemId` и исходящие из неё
   const toMainNodeLinks = links.filter(link => link.toId === itemId); // Входящие связи
-  const fromMainNodeLinks = links.filter(link => link.fromId === itemId); // Исходящие связи
+  const fromMainNodeLinks = links.filter(link => false); // Исходящие связи
 
   // Вспомогательная функция для обработки связей и формирования массива данных
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 25
+ Received  +  1

- Array [
-   Object {
-     "belongsToGraph": Array [

[Killed] ArrowFunction
src/helpers/modal-helpers/getInfoPanelData.ts:18:42
 
   // Фильтруем связи: входящие в ноду с `itemId` и исходящие из неё
   const toMainNodeLinks = links.filter(link => link.toId === itemId); // Входящие связи
-  const fromMainNodeLinks = links.filter(link => link.fromId === itemId); // Исходящие связи
+  const fromMainNodeLinks = links.filter(() => undefined); // Исходящие связи
 
   // Вспомогательная функция для обработки связей и формирования массива данных
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 25
+ Received  +  1

- Array [
-   Object {
-     "belongsToGraph": Array [

[Killed] BlockStatement
src/helpers/modal-helpers/getInfoPanelData.ts:27:24
       const relatedNodeId = isFrom ? link.fromId : link.toId;
       const relatedNode = findNodeById(relatedNodeId);
 
-      if (relatedNode) {
-        // Проверяем, есть ли уже эта нода в аккумуляторе
-        const existingNode = acc.find(node => node.id === relatedNode.id);
-
-        if (existingNode) {
-          // Если нода уже есть, добавляем событие в её массив событий
-          existingNode.events.push(findEventById(link.eventId));
-        } else {
-          // Если ноды ещё нет, создаём новую запись с начальным массивом событий
-          acc.push({
-            ...relatedNode,
-            events: [findEventById(link.eventId)],
-          });
-        }
-      }
+      if (relatedNode) {}
 
       return acc;
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 25
+ Received  +  1

- Array [
-   Object {
-     "belongsToGraph": Array [

[Killed] ConditionalExpression
src/helpers/modal-helpers/getInfoPanelData.ts:27:11
       const relatedNodeId = isFrom ? link.fromId : link.toId;
       const relatedNode = findNodeById(relatedNodeId);
 
-      if (relatedNode) {
+      if (false) {
         // Проверяем, есть ли уже эта нода в аккумуляторе
         const existingNode = acc.find(node => node.id === relatedNode.id);
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 25
+ Received  +  1

- Array [
-   Object {
-     "belongsToGraph": Array [

[Killed] EqualityOperator
src/helpers/modal-helpers/getInfoPanelData.ts:29:47
 
       if (relatedNode) {
         // Проверяем, есть ли уже эта нода в аккумуляторе
-        const existingNode = acc.find(node => node.id === relatedNode.id);
+        const existingNode = acc.find(node => node.id !== relatedNode.id);
 
         if (existingNode) {
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  2

@@ -15,44 +15,22 @@
              \"topicKafka\"
            ]

[Killed] ConditionalExpression
src/helpers/modal-helpers/getInfoPanelData.ts:29:47
 
       if (relatedNode) {
         // Проверяем, есть ли уже эта нода в аккумуляторе
-        const existingNode = acc.find(node => node.id === relatedNode.id);
+        const existingNode = acc.find(node => true);
 
         if (existingNode) {
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  2

@@ -15,44 +15,22 @@
              \"topicKafka\"
            ]

[Killed] ConditionalExpression
src/helpers/modal-helpers/getInfoPanelData.ts:31:13
         // Проверяем, есть ли уже эта нода в аккумуляторе
         const existingNode = acc.find(node => node.id === relatedNode.id);
 
-        if (existingNode) {
+        if (true) {
           // Если нода уже есть, добавляем событие в её массив событий
           existingNode.events.push(findEventById(link.eventId));
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: TypeError: Cannot read properties of undefined (reading 'events')

[NoCoverage] BlockStatement
src/helpers/modal-helpers/getInfoPanelData.ts:31:27
         // Проверяем, есть ли уже эта нода в аккумуляторе
         const existingNode = acc.find(node => node.id === relatedNode.id);
 
-        if (existingNode) {
-          // Если нода уже есть, добавляем событие в её массив событий
-          existingNode.events.push(findEventById(link.eventId));
-        } else {
+        if (existingNode) {} else {
           // Если ноды ещё нет, создаём новую запись с начальным массивом событий
           acc.push({

[Killed] BlockStatement
src/helpers/modal-helpers/getInfoPanelData.ts:34:16
         if (existingNode) {
           // Если нода уже есть, добавляем событие в её массив событий
           existingNode.events.push(findEventById(link.eventId));
-        } else {
-          // Если ноды ещё нет, создаём новую запись с начальным массивом событий
-          acc.push({
-            ...relatedNode,
-            events: [findEventById(link.eventId)],
-          });
-        }
+        } else {}
       }
 
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 25
+ Received  +  1

- Array [
-   Object {
-     "belongsToGraph": Array [

[Killed] BooleanLiteral
src/helpers/modal-helpers/getInfoPanelData.ts:46:59
       return acc;
     }, []);
 
-  const givingEventsNodes = processLinks(toMainNodeLinks, true); // Ноды, из которых идёт событие в ноду с `itemId`
+  const givingEventsNodes = processLinks(toMainNodeLinks, false); // Ноды, из которых идёт событие в ноду с `itemId`
   const gettingEventNodes = processLinks(fromMainNodeLinks, false); // Ноды, в которые идёт события из ноды с `itemId`
 
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,11 +1,11 @@
  Array [
    Object {

[Killed] BooleanLiteral
src/helpers/modal-helpers/getInfoPanelData.ts:47:61
     }, []);
 
   const givingEventsNodes = processLinks(toMainNodeLinks, true); // Ноды, из которых идёт событие в ноду с `itemId`
-  const gettingEventNodes = processLinks(fromMainNodeLinks, false); // Ноды, в которые идёт события из ноды с `itemId`
+  const gettingEventNodes = processLinks(fromMainNodeLinks, true); // Ноды, в которые идёт события из ноды с `itemId`
 
   return {
killedBy: /src/helpers/modal-helpers/getInfoPanelData.tsx should return the expected result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,11 +1,11 @@
  Array [
    Object {
