[NoCoverage] LogicalOperator
src/helpers/sidebar-helpers.tsx:6:23
 import {ARROW_LEFT, ARROW_RIGHT, EMPTY_CHAR} from "@/constants/common";
 
 export const getLinkItemTitle = (serviceNode: NodeDTO, topicNode: NodeDTO, httpNode: NodeDTO, connectionType: EConnectionType) => {
-  const serviceName = serviceNode?.name ?? EMPTY_CHAR;
+  const serviceName = serviceNode?.name && EMPTY_CHAR;
   const topicName = topicNode?.name ?? EMPTY_CHAR;
 

[NoCoverage] OptionalChaining
src/helpers/sidebar-helpers.tsx:6:23
 import {ARROW_LEFT, ARROW_RIGHT, EMPTY_CHAR} from "@/constants/common";
 
 export const getLinkItemTitle = (serviceNode: NodeDTO, topicNode: NodeDTO, httpNode: NodeDTO, connectionType: EConnectionType) => {
-  const serviceName = serviceNode?.name ?? EMPTY_CHAR;
+  const serviceName = serviceNode.name ?? EMPTY_CHAR;
   const topicName = topicNode?.name ?? EMPTY_CHAR;
 

[NoCoverage] LogicalOperator
src/helpers/sidebar-helpers.tsx:7:21
 
 export const getLinkItemTitle = (serviceNode: NodeDTO, topicNode: NodeDTO, httpNode: NodeDTO, connectionType: EConnectionType) => {
   const serviceName = serviceNode?.name ?? EMPTY_CHAR;
-  const topicName = topicNode?.name ?? EMPTY_CHAR;
+  const topicName = topicNode?.name && EMPTY_CHAR;
 
   switch (connectionType) {

[NoCoverage] OptionalChaining
src/helpers/sidebar-helpers.tsx:7:21
 
 export const getLinkItemTitle = (serviceNode: NodeDTO, topicNode: NodeDTO, httpNode: NodeDTO, connectionType: EConnectionType) => {
   const serviceName = serviceNode?.name ?? EMPTY_CHAR;
-  const topicName = topicNode?.name ?? EMPTY_CHAR;
+  const topicName = topicNode.name ?? EMPTY_CHAR;
 
   switch (connectionType) {

[NoCoverage] ConditionalExpression
src/helpers/sidebar-helpers.tsx:10:5
   const topicName = topicNode?.name ?? EMPTY_CHAR;
 
   switch (connectionType) {
-    case EConnectionType.PRODUCE:
-      return `${serviceName}${ARROW_RIGHT}${topicName}`;
+    case EConnectionType.PRODUCE:
     case EConnectionType.CONSUME:
       return `${serviceName}${ARROW_LEFT}${httpNode ? (httpNode?.name ?? EMPTY_CHAR) : topicName}`;

[NoCoverage] ConditionalExpression
src/helpers/sidebar-helpers.tsx:12:5
   switch (connectionType) {
     case EConnectionType.PRODUCE:
       return `${serviceName}${ARROW_RIGHT}${topicName}`;
-    case EConnectionType.CONSUME:
-      return `${serviceName}${ARROW_LEFT}${httpNode ? (httpNode?.name ?? EMPTY_CHAR) : topicName}`;
+    case EConnectionType.CONSUME:
     default:
       return EMPTY_CHAR;

[NoCoverage] OptionalChaining
src/helpers/sidebar-helpers.tsx:13:56
     case EConnectionType.PRODUCE:
       return `${serviceName}${ARROW_RIGHT}${topicName}`;
     case EConnectionType.CONSUME:
-      return `${serviceName}${ARROW_LEFT}${httpNode ? (httpNode?.name ?? EMPTY_CHAR) : topicName}`;
+      return `${serviceName}${ARROW_LEFT}${httpNode ? (httpNode.name ?? EMPTY_CHAR) : topicName}`;
     default:
       return EMPTY_CHAR;

[NoCoverage] LogicalOperator
src/helpers/sidebar-helpers.tsx:13:56
     case EConnectionType.PRODUCE:
       return `${serviceName}${ARROW_RIGHT}${topicName}`;
     case EConnectionType.CONSUME:
-      return `${serviceName}${ARROW_LEFT}${httpNode ? (httpNode?.name ?? EMPTY_CHAR) : topicName}`;
+      return `${serviceName}${ARROW_LEFT}${httpNode ? (httpNode?.name && EMPTY_CHAR) : topicName}`;
     default:
       return EMPTY_CHAR;

[NoCoverage] ConditionalExpression
src/helpers/sidebar-helpers.tsx:14:5
       return `${serviceName}${ARROW_RIGHT}${topicName}`;
     case EConnectionType.CONSUME:
       return `${serviceName}${ARROW_LEFT}${httpNode ? (httpNode?.name ?? EMPTY_CHAR) : topicName}`;
-    default:
-      return EMPTY_CHAR;
+    default:
   }
 };
