[NoCoverage] BooleanLiteral
src/hocs/withQueryClient.tsx:7:29
 export const queryClient = new QueryClient({
   defaultOptions: {
     queries: {
-      refetchOnWindowFocus: false,
+      refetchOnWindowFocus: true,
     },
   },
