[NoCoverage] BlockStatement
src/hocs/withTheme.tsx:9:17
  */
 export const withTheme =
   <P,>(WrappedComponent: FC<P>) =>
-  (props: P) => {
-    const {theme} = useTheme();
-
-    return (
-      <ThemeProvider theme={theme} hashPriority="high" shouldUseLayer>
-        {/** @ts-ignore */}
-        <WrappedComponent {...props} />
-      </ThemeProvider>
-    );
-  };
+  (props: P) => {};
 
