[NoCoverage] ArrowFunction
src/hooks/useJsonEditorNotification.tsx:19:5
   );
 
   const notifyError = useCallback(
-    (key: string, message: string) => api.error({key, message, placement: 'bottomRight', duration: 1.5}),
+    () => undefined,
     [api]
   );

[NoCoverage] BlockStatement
src/hooks/useJsonEditorNotification.tsx:23:19
     [api]
   );
 
-  useEffect(() => {
-    const handleChangeEvent = () => {
-      notifySuccess(JSON_EDITOR_NOTIFICATION_KEY.changeEvent, 'Changes have been saved');
-    };
-
-    const unsubscribeChangeEvent = editEvent.watch(handleChangeEvent);
-
-    return () => {
-      unsubscribeChangeEvent();
-    };
-  }, [api, notifyError, notifySuccess]);
+  useEffect(() => {}, [api, notifyError, notifySuccess]);
 
   return {api, contextHandler};

[NoCoverage] BlockStatement
src/hooks/useJsonEditorNotification.tsx:24:37
   );
 
   useEffect(() => {
-    const handleChangeEvent = () => {
-      notifySuccess(JSON_EDITOR_NOTIFICATION_KEY.changeEvent, 'Changes have been saved');
-    };
+    const handleChangeEvent = () => {};
 
     const unsubscribeChangeEvent = editEvent.watch(handleChangeEvent);

[NoCoverage] BlockStatement
src/hooks/useJsonEditorNotification.tsx:30:18
 
     const unsubscribeChangeEvent = editEvent.watch(handleChangeEvent);
 
-    return () => {
-      unsubscribeChangeEvent();
-    };
+    return () => {};
   }, [api, notifyError, notifySuccess]);
 
