[NoCoverage] StringLiteral
src/pages/error-page/ErrorPage.tsx:12:41
       image={<EmptyState />}
       description=""
       imageStyle={{width: '13.25rem', height: '10.166rem'}}
-      style={{width: '17.5rem', height: '12.5rem', display: 'flex', alignItems: 'center', justifyContent: 'center'}}
+      style={{width: '17.5rem', height: "", display: 'flex', alignItems: 'center', justifyContent: 'center'}}
     />
     <div className="text-center">

[NoCoverage] StringLiteral
src/pages/error-page/ErrorPage.tsx:12:22
       image={<EmptyState />}
       description=""
       imageStyle={{width: '13.25rem', height: '10.166rem'}}
-      style={{width: '17.5rem', height: '12.5rem', display: 'flex', alignItems: 'center', justifyContent: 'center'}}
+      style={{width: "", height: '12.5rem', display: 'flex', alignItems: 'center', justifyContent: 'center'}}
     />
     <div className="text-center">
