[NoCoverage] BlockStatement
diagram/modals/drawer-export/DrawerExport.tsx:30:29
   const [exportLinks, setExportLinks] = useState<GenerateSpecPost200Response['downloadLinks'] | null>(null);
   const [specsToDownload, setSpecsToDownload] = useState<string[]>([]);
 
-  const handleClose = () => {
-    closeDrawerExport();
-    setExportLinks(null);
-    setSpecsToDownload([]);
-  };
+  const handleClose = () => {};
 
   const handleExport = async () => {

[NoCoverage] ArrayDeclaration
diagram/modals/drawer-export/DrawerExport.tsx:33:24
   const handleClose = () => {
     closeDrawerExport();
     setExportLinks(null);
-    setSpecsToDownload([]);
+    setSpecsToDownload(["Stryker was here"]);
   };
 

[NoCoverage] BlockStatement
diagram/modals/drawer-export/DrawerExport.tsx:36:36
     setSpecsToDownload([]);
   };
 
-  const handleExport = async () => {
-    const downloadItems: TDownloadItem[] = specsToDownload
-      .filter(filename => filename in exportLinks)
-      .map(serviceName => ({
-        filename: `${serviceName}.json`,
-        url: `${API_URL}${exportLinks[serviceName]}`,
-      }));
-
-    downloadFiles(downloadItems);
-  };
+  const handleExport = async () => {};
 
   const fetchExportLinks = async (isVisible: boolean) => {

[NoCoverage] MethodExpression
diagram/modals/drawer-export/DrawerExport.tsx:37:44
   };
 
   const handleExport = async () => {
-    const downloadItems: TDownloadItem[] = specsToDownload
-      .filter(filename => filename in exportLinks)
+    const downloadItems: TDownloadItem[] = specsToDownload
       .map(serviceName => ({
         filename: `${serviceName}.json`,

[NoCoverage] ArrowFunction
diagram/modals/drawer-export/DrawerExport.tsx:38:15
 
   const handleExport = async () => {
     const downloadItems: TDownloadItem[] = specsToDownload
-      .filter(filename => filename in exportLinks)
+      .filter(() => undefined)
       .map(serviceName => ({
         filename: `${serviceName}.json`,

[NoCoverage] ArrowFunction
diagram/modals/drawer-export/DrawerExport.tsx:39:12
   const handleExport = async () => {
     const downloadItems: TDownloadItem[] = specsToDownload
       .filter(filename => filename in exportLinks)
-      .map(serviceName => ({
-        filename: `${serviceName}.json`,
-        url: `${API_URL}${exportLinks[serviceName]}`,
-      }));
+      .map(() => undefined);
 
     downloadFiles(downloadItems);

[NoCoverage] StringLiteral
diagram/modals/drawer-export/DrawerExport.tsx:41:14
       .filter(filename => filename in exportLinks)
       .map(serviceName => ({
         filename: `${serviceName}.json`,
-        url: `${API_URL}${exportLinks[serviceName]}`,
+        url: ``,
       }));
 

[NoCoverage] BlockStatement
diagram/modals/drawer-export/DrawerExport.tsx:47:58
     downloadFiles(downloadItems);
   };
 
-  const fetchExportLinks = async (isVisible: boolean) => {
-    if (isVisible) {
-      fetchExportLinksFx(eventGraph).then(result => {
-        setExportLinks(result.downloadLinks);
-      });
-    }
-  };
+  const fetchExportLinks = async (isVisible: boolean) => {};
 
   const toggleSpecsToDownload = (serviceName: string) => {

[NoCoverage] BlockStatement
diagram/modals/drawer-export/DrawerExport.tsx:48:20
   };
 
   const fetchExportLinks = async (isVisible: boolean) => {
-    if (isVisible) {
-      fetchExportLinksFx(eventGraph).then(result => {
-        setExportLinks(result.downloadLinks);
-      });
-    }
+    if (isVisible) {}
   };
 

[NoCoverage] ConditionalExpression
diagram/modals/drawer-export/DrawerExport.tsx:48:9
   };
 
   const fetchExportLinks = async (isVisible: boolean) => {
-    if (isVisible) {
+    if (false) {
       fetchExportLinksFx(eventGraph).then(result => {
         setExportLinks(result.downloadLinks);

[NoCoverage] BlockStatement
diagram/modals/drawer-export/DrawerExport.tsx:49:53
 
   const fetchExportLinks = async (isVisible: boolean) => {
     if (isVisible) {
-      fetchExportLinksFx(eventGraph).then(result => {
-        setExportLinks(result.downloadLinks);
-      });
+      fetchExportLinksFx(eventGraph).then(result => {});
     }
   };

[NoCoverage] BlockStatement
diagram/modals/drawer-export/DrawerExport.tsx:55:58
     }
   };
 
-  const toggleSpecsToDownload = (serviceName: string) => {
-    if (specsToDownload.includes(serviceName)) {
-      setSpecsToDownload(prevState => prevState.filter(specName => specName !== serviceName));
-    } else {
-      setSpecsToDownload(prevState => [...prevState, serviceName]);
-    }
-  };
+  const toggleSpecsToDownload = (serviceName: string) => {};
 
   return (

[NoCoverage] ConditionalExpression
diagram/modals/drawer-export/DrawerExport.tsx:56:9
   };
 
   const toggleSpecsToDownload = (serviceName: string) => {
-    if (specsToDownload.includes(serviceName)) {
+    if (false) {
       setSpecsToDownload(prevState => prevState.filter(specName => specName !== serviceName));
     } else {

[NoCoverage] ConditionalExpression
diagram/modals/drawer-export/DrawerExport.tsx:56:9
   };
 
   const toggleSpecsToDownload = (serviceName: string) => {
-    if (specsToDownload.includes(serviceName)) {
+    if (true) {
       setSpecsToDownload(prevState => prevState.filter(specName => specName !== serviceName));
     } else {

[NoCoverage] MethodExpression
diagram/modals/drawer-export/DrawerExport.tsx:57:39
 
   const toggleSpecsToDownload = (serviceName: string) => {
     if (specsToDownload.includes(serviceName)) {
-      setSpecsToDownload(prevState => prevState.filter(specName => specName !== serviceName));
+      setSpecsToDownload(prevState => prevState);
     } else {
       setSpecsToDownload(prevState => [...prevState, serviceName]);

[NoCoverage] ArrowFunction
diagram/modals/drawer-export/DrawerExport.tsx:57:26
 
   const toggleSpecsToDownload = (serviceName: string) => {
     if (specsToDownload.includes(serviceName)) {
-      setSpecsToDownload(prevState => prevState.filter(specName => specName !== serviceName));
+      setSpecsToDownload(() => undefined);
     } else {
       setSpecsToDownload(prevState => [...prevState, serviceName]);

[NoCoverage] BlockStatement
diagram/modals/drawer-export/DrawerExport.tsx:58:12
   const toggleSpecsToDownload = (serviceName: string) => {
     if (specsToDownload.includes(serviceName)) {
       setSpecsToDownload(prevState => prevState.filter(specName => specName !== serviceName));
-    } else {
-      setSpecsToDownload(prevState => [...prevState, serviceName]);
-    }
+    } else {}
   };
 

[NoCoverage] ArrowFunction
diagram/modals/drawer-export/DrawerExport.tsx:59:26
     if (specsToDownload.includes(serviceName)) {
       setSpecsToDownload(prevState => prevState.filter(specName => specName !== serviceName));
     } else {
-      setSpecsToDownload(prevState => [...prevState, serviceName]);
+      setSpecsToDownload(() => undefined);
     }
   };

[Survived] StringLiteral
diagram/modals/drawer-export/DrawerExport.tsx:79:35
             type="primary"
             isDisabled={!specsToDownload.length}
             onClick={handleExport}
-            style={{borderRadius: '3px'}}
+            style={{borderRadius: ""}}
           >
             Export

[Survived] ObjectLiteral
diagram/modals/drawer-export/DrawerExport.tsx:83:68
           >
             Export
           </UIKitButton>
-          <UIKitButton type="default" onClick={handleClose} style={{borderRadius: '3px'}}>
+          <UIKitButton type="default" onClick={handleClose} style={{}}>
             Cancel
           </UIKitButton>

[NoCoverage] ArrowFunction
diagram/modals/drawer-export/DrawerExport.tsx:97:45
         <UIKitFormItem label="Services">
           {exportLinks ? (
             <div className="flex w-full flex-col gap-4 overflow-hidden">
-              {Object.keys(exportLinks).map(serviceName => (
-                <UIKitCheckbox
-                  isChecked={specsToDownload.includes(serviceName)}
-                  onChange={() => toggleSpecsToDownload(serviceName)}
-                >
-                  {serviceName}
-                </UIKitCheckbox>
-              ))}
+              {Object.keys(exportLinks).map(() => undefined)}
             </div>
           ) : (

[NoCoverage] ArrowFunction
diagram/modals/drawer-export/DrawerExport.tsx:100:29
               {Object.keys(exportLinks).map(serviceName => (
                 <UIKitCheckbox
                   isChecked={specsToDownload.includes(serviceName)}
-                  onChange={() => toggleSpecsToDownload(serviceName)}
+                  onChange={() => undefined}
                 >
                   {serviceName}
