[Survived] ArrayDeclaration
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:29:63
   const drawerCreateLink = useUnit($drawerAddLink);
   const {isOpen} = drawerCreateLink;
 
-  const methods = useForm<ILinksForm>({defaultValues: {links: [initialLinksForm]}});
+  const methods = useForm<ILinksForm>({defaultValues: {links: []}});
   const {fields, prepend} = useFieldArray({
     control: methods.control,

[Timeout] ObjectLiteral
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:29:39
   const drawerCreateLink = useUnit($drawerAddLink);
   const {isOpen} = drawerCreateLink;
 
-  const methods = useForm<ILinksForm>({defaultValues: {links: [initialLinksForm]}});
+  const methods = useForm<ILinksForm>({});
   const {fields, prepend} = useFieldArray({
     control: methods.control,

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:35:17
     name: 'links',
   });
 
-  const nodes = eventGraph?.nodes;
+  const nodes = eventGraph.nodes;
   const events = eventGraph?.events || [];
   const links = eventGraph?.links;

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:36:18
   });
 
   const nodes = eventGraph?.nodes;
-  const events = eventGraph?.events || [];
+  const events = eventGraph.events || [];
   const links = eventGraph?.links;
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:37:17
 
   const nodes = eventGraph?.nodes;
   const events = eventGraph?.events || [];
-  const links = eventGraph?.links;
+  const links = eventGraph.links;
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);

[Survived] MethodExpression
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:38:22
   const nodes = eventGraph?.nodes;
   const events = eventGraph?.events || [];
   const links = eventGraph?.links;
-  const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
+  const topicNodes = nodes;
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);

[NoCoverage] EqualityOperator
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:38:48
   const nodes = eventGraph?.nodes;
   const events = eventGraph?.events || [];
   const links = eventGraph?.links;
-  const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
+  const topicNodes = nodes?.filter(({type}) => type !== NodeDTOTypeEnum.Topic);
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);

[NoCoverage] EqualityOperator
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:39:50
   const events = eventGraph?.events || [];
   const links = eventGraph?.links;
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
-  const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
+  const serviceNodes = nodes?.filter(({type}) => type !== NodeDTOTypeEnum.Service);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
 

[Survived] MethodExpression
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:39:24
   const events = eventGraph?.events || [];
   const links = eventGraph?.links;
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
-  const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
+  const serviceNodes = nodes;
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
 

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:40:21
   const links = eventGraph?.links;
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
-  const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
+  const httpNodes = nodes.filter(({type}) => type === NodeDTOTypeEnum.Http);
 
   const topicOptions = topicNodes?.map(({id, name}) => ({

[NoCoverage] EqualityOperator
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:40:47
   const links = eventGraph?.links;
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
-  const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
+  const httpNodes = nodes?.filter(({type}) => type !== NodeDTOTypeEnum.Http);
 
   const topicOptions = topicNodes?.map(({id, name}) => ({

[Survived] ArrowFunction
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:42:40
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
 
-  const topicOptions = topicNodes?.map(({id, name}) => ({
-    label: name,
-    value: id,
-  }));
+  const topicOptions = topicNodes?.map(() => undefined);
   const serviceOptions = serviceNodes?.map(({id, name}) => ({
     label: name,

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:42:24
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
 
-  const topicOptions = topicNodes?.map(({id, name}) => ({
+  const topicOptions = topicNodes.map(({id, name}) => ({
     label: name,
     value: id,

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:46:26
     label: name,
     value: id,
   }));
-  const serviceOptions = serviceNodes?.map(({id, name}) => ({
+  const serviceOptions = serviceNodes.map(({id, name}) => ({
     label: name,
     value: id,

[Survived] ArrowFunction
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:46:44
     label: name,
     value: id,
   }));
-  const serviceOptions = serviceNodes?.map(({id, name}) => ({
-    label: name,
-    value: id,
-  }));
+  const serviceOptions = serviceNodes?.map(() => undefined);
   const httpOptions = httpNodes?.map(({id, name}) => ({
     label: name,

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:50:23
     label: name,
     value: id,
   }));
-  const httpOptions = httpNodes?.map(({id, name}) => ({
+  const httpOptions = httpNodes.map(({id, name}) => ({
     label: name,
     value: id,

[Survived] ArrowFunction
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:50:38
     label: name,
     value: id,
   }));
-  const httpOptions = httpNodes?.map(({id, name}) => ({
-    label: name,
-    value: id,
-  }));
+  const httpOptions = httpNodes?.map(() => undefined);
   const eventsOptions = events?.map(({id, name}) => ({
     label: name,

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:54:25
     label: name,
     value: id,
   }));
-  const eventsOptions = events?.map(({id, name}) => ({
+  const eventsOptions = events.map(({id, name}) => ({
     label: name,
     value: id,

[Survived] ArrowFunction
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:54:37
     label: name,
     value: id,
   }));
-  const eventsOptions = events?.map(({id, name}) => ({
-    label: name,
-    value: id,
-  }));
+  const eventsOptions = events?.map(() => undefined);
 
   const handleClose = () => {

[NoCoverage] BlockStatement
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:59:29
     value: id,
   }));
 
-  const handleClose = () => {
-    closeDrawerAddLink();
-    methods.reset();
-  };
+  const handleClose = () => {};
 
   const handleAddLink = (data: ILinksForm) => {

[NoCoverage] BlockStatement
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:64:47
     methods.reset();
   };
 
-  const handleAddLink = (data: ILinksForm) => {
-    const adjustedLinks = data.links
-      .map(link => getDeterminedLinkIds(link.connectionType, link))
-      .filter(el => !links?.map(({fromId}) => fromId).includes(el.fromId));
-
-    addLinks(adjustedLinks);
-    handleClose();
-  };
+  const handleAddLink = (data: ILinksForm) => {};
 
   const addLinkHandler = useCallback(() => {

[NoCoverage] MethodExpression
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:65:27
   };
 
   const handleAddLink = (data: ILinksForm) => {
-    const adjustedLinks = data.links
-      .map(link => getDeterminedLinkIds(link.connectionType, link))
-      .filter(el => !links?.map(({fromId}) => fromId).includes(el.fromId));
+    const adjustedLinks = data.links.map(link => getDeterminedLinkIds(link.connectionType, link));
 
     addLinks(adjustedLinks);

[NoCoverage] ArrowFunction
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:66:12
 
   const handleAddLink = (data: ILinksForm) => {
     const adjustedLinks = data.links
-      .map(link => getDeterminedLinkIds(link.connectionType, link))
+      .map(() => undefined)
       .filter(el => !links?.map(({fromId}) => fromId).includes(el.fromId));
 

[NoCoverage] BooleanLiteral
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:67:21
   const handleAddLink = (data: ILinksForm) => {
     const adjustedLinks = data.links
       .map(link => getDeterminedLinkIds(link.connectionType, link))
-      .filter(el => !links?.map(({fromId}) => fromId).includes(el.fromId));
+      .filter(el => links?.map(({
+  fromId
+}) => fromId).includes(el.fromId));
 
     addLinks(adjustedLinks);

[NoCoverage] ArrowFunction
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:67:15
   const handleAddLink = (data: ILinksForm) => {
     const adjustedLinks = data.links
       .map(link => getDeterminedLinkIds(link.connectionType, link))
-      .filter(el => !links?.map(({fromId}) => fromId).includes(el.fromId));
+      .filter(() => undefined);
 
     addLinks(adjustedLinks);

[NoCoverage] BlockStatement
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:73:44
     handleClose();
   };
 
-  const addLinkHandler = useCallback(() => {
-    prepend(initialLinksForm);
-  }, [prepend]);
+  const addLinkHandler = useCallback(() => {}, [prepend]);
 
   return (

[Survived] ArrayDeclaration
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:75:6
 
   const addLinkHandler = useCallback(() => {
     prepend(initialLinksForm);
-  }, [prepend]);
+  }, []);
 
   return (

[Survived] StringLiteral
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:112:16
       {fields.map((field, idx) => (
         <Collapse
           className="mb-3"
-          key={`${field.id}-${field.fromId}`}
+          key={``}
           defaultActiveKey={[!idx ? 0 : null]}
           items={[

[Survived] BooleanLiteral
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:113:30
         <Collapse
           className="mb-3"
           key={`${field.id}-${field.fromId}`}
-          defaultActiveKey={[!idx ? 0 : null]}
+          defaultActiveKey={[idx ? 0 : null]}
           items={[
             {

[Survived] BooleanLiteral
diagram/modals/drawer-link-modal/DrawerCreateLink.tsx:135:23
               extra: <Button type="text" icon={<IconTrash />} onClick={() => {}} />, // TODO: пока не работает
             },
           ]}
-          isBordered={false}
+          isBordered={true}
         />
       ))}
