[Survived] ArrowFunction
commons/diagram/modals/DrawerCreateEvent.tsx:33:48
   const eventGraph = useUnit($eventGraph);
   const {eventId, isOpen} = drawerCreateEvent;
 
-  const eventToEdit = eventGraph?.events?.find(item => item.id === eventId);
+  const eventToEdit = eventGraph?.events?.find(() => undefined);
   const tagOptions = eventGraph && eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];
 

[NoCoverage] ConditionalExpression
commons/diagram/modals/DrawerCreateEvent.tsx:33:56
   const eventGraph = useUnit($eventGraph);
   const {eventId, isOpen} = drawerCreateEvent;
 
-  const eventToEdit = eventGraph?.events?.find(item => item.id === eventId);
+  const eventToEdit = eventGraph?.events?.find(item => true);
   const tagOptions = eventGraph && eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];
 

[Survived] ConditionalExpression
commons/diagram/modals/DrawerCreateEvent.tsx:34:22
   const {eventId, isOpen} = drawerCreateEvent;
 
   const eventToEdit = eventGraph?.events?.find(item => item.id === eventId);
-  const tagOptions = eventGraph && eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];
+  const tagOptions = false ? new SimpleValues(...eventGraph.tags) : [];
 
   const {

[Survived] LogicalOperator
commons/diagram/modals/DrawerCreateEvent.tsx:34:22
   const {eventId, isOpen} = drawerCreateEvent;
 
   const eventToEdit = eventGraph?.events?.find(item => item.id === eventId);
-  const tagOptions = eventGraph && eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];
+  const tagOptions = eventGraph || eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];
 
   const {

[Survived] BlockStatement
commons/diagram/modals/DrawerCreateEvent.tsx:54:19
 
   const isEditing = Boolean(eventToEdit);
 
-  useEffect(() => {
-    if (isOpen) {
-      reset({
-        name: eventToEdit?.name || EMPTY_CHAR,
-        eventDescription: eventToEdit?.eventDescription || EMPTY_CHAR,
-        tags: eventToEdit?.tags || EMPTY_ARRAY,
-        schema: eventToEdit?.schema || EMPTY_CHAR,
-      });
-    }
-  }, [eventToEdit, isOpen, reset]);
+  useEffect(() => {}, [eventToEdit, isOpen, reset]);
 
   const {field: nameField} = useController({

[NoCoverage] BlockStatement
commons/diagram/modals/DrawerCreateEvent.tsx:55:17
   const isEditing = Boolean(eventToEdit);
 
   useEffect(() => {
-    if (isOpen) {
-      reset({
-        name: eventToEdit?.name || EMPTY_CHAR,
-        eventDescription: eventToEdit?.eventDescription || EMPTY_CHAR,
-        tags: eventToEdit?.tags || EMPTY_ARRAY,
-        schema: eventToEdit?.schema || EMPTY_CHAR,
-      });
-    }
+    if (isOpen) {}
   }, [eventToEdit, isOpen, reset]);
 

[Survived] ConditionalExpression
commons/diagram/modals/DrawerCreateEvent.tsx:55:9
   const isEditing = Boolean(eventToEdit);
 
   useEffect(() => {
-    if (isOpen) {
+    if (false) {
       reset({
         name: eventToEdit?.name || EMPTY_CHAR,

[NoCoverage] OptionalChaining
commons/diagram/modals/DrawerCreateEvent.tsx:57:15
   useEffect(() => {
     if (isOpen) {
       reset({
-        name: eventToEdit?.name || EMPTY_CHAR,
+        name: eventToEdit.name || EMPTY_CHAR,
         eventDescription: eventToEdit?.eventDescription || EMPTY_CHAR,
         tags: eventToEdit?.tags || EMPTY_ARRAY,

[NoCoverage] LogicalOperator
commons/diagram/modals/DrawerCreateEvent.tsx:57:15
   useEffect(() => {
     if (isOpen) {
       reset({
-        name: eventToEdit?.name || EMPTY_CHAR,
+        name: eventToEdit?.name && EMPTY_CHAR,
         eventDescription: eventToEdit?.eventDescription || EMPTY_CHAR,
         tags: eventToEdit?.tags || EMPTY_ARRAY,

[NoCoverage] LogicalOperator
commons/diagram/modals/DrawerCreateEvent.tsx:58:27
     if (isOpen) {
       reset({
         name: eventToEdit?.name || EMPTY_CHAR,
-        eventDescription: eventToEdit?.eventDescription || EMPTY_CHAR,
+        eventDescription: eventToEdit?.eventDescription && EMPTY_CHAR,
         tags: eventToEdit?.tags || EMPTY_ARRAY,
         schema: eventToEdit?.schema || EMPTY_CHAR,

[NoCoverage] OptionalChaining
commons/diagram/modals/DrawerCreateEvent.tsx:58:27
     if (isOpen) {
       reset({
         name: eventToEdit?.name || EMPTY_CHAR,
-        eventDescription: eventToEdit?.eventDescription || EMPTY_CHAR,
+        eventDescription: eventToEdit.eventDescription || EMPTY_CHAR,
         tags: eventToEdit?.tags || EMPTY_ARRAY,
         schema: eventToEdit?.schema || EMPTY_CHAR,

[NoCoverage] OptionalChaining
commons/diagram/modals/DrawerCreateEvent.tsx:59:15
       reset({
         name: eventToEdit?.name || EMPTY_CHAR,
         eventDescription: eventToEdit?.eventDescription || EMPTY_CHAR,
-        tags: eventToEdit?.tags || EMPTY_ARRAY,
+        tags: eventToEdit.tags || EMPTY_ARRAY,
         schema: eventToEdit?.schema || EMPTY_CHAR,
       });

[NoCoverage] LogicalOperator
commons/diagram/modals/DrawerCreateEvent.tsx:59:15
       reset({
         name: eventToEdit?.name || EMPTY_CHAR,
         eventDescription: eventToEdit?.eventDescription || EMPTY_CHAR,
-        tags: eventToEdit?.tags || EMPTY_ARRAY,
+        tags: eventToEdit?.tags && EMPTY_ARRAY,
         schema: eventToEdit?.schema || EMPTY_CHAR,
       });

[NoCoverage] OptionalChaining
commons/diagram/modals/DrawerCreateEvent.tsx:60:17
         name: eventToEdit?.name || EMPTY_CHAR,
         eventDescription: eventToEdit?.eventDescription || EMPTY_CHAR,
         tags: eventToEdit?.tags || EMPTY_ARRAY,
-        schema: eventToEdit?.schema || EMPTY_CHAR,
+        schema: eventToEdit.schema || EMPTY_CHAR,
       });
     }

[NoCoverage] LogicalOperator
commons/diagram/modals/DrawerCreateEvent.tsx:60:17
         name: eventToEdit?.name || EMPTY_CHAR,
         eventDescription: eventToEdit?.eventDescription || EMPTY_CHAR,
         tags: eventToEdit?.tags || EMPTY_ARRAY,
-        schema: eventToEdit?.schema || EMPTY_CHAR,
+        schema: eventToEdit?.schema && EMPTY_CHAR,
       });
     }

[NoCoverage] BlockStatement
commons/diagram/modals/DrawerCreateEvent.tsx:88:29
     name: 'schema',
   });
 
-  const handleClose = () => {
-    reset({
-      name: EMPTY_CHAR,
-      eventDescription: EMPTY_CHAR,
-      tags: EMPTY_ARRAY,
-      schema: EMPTY_CHAR,
-    });
-    closeDrawerCreateEvent();
-  };
+  const handleClose = () => {};
 
   const handleSave = (data: EventDTO) => {

[NoCoverage] ObjectLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:89:11
   });
 
   const handleClose = () => {
-    reset({
-      name: EMPTY_CHAR,
-      eventDescription: EMPTY_CHAR,
-      tags: EMPTY_ARRAY,
-      schema: EMPTY_CHAR,
-    });
+    reset({});
     closeDrawerCreateEvent();
   };

[NoCoverage] BlockStatement
commons/diagram/modals/DrawerCreateEvent.tsx:98:42
     closeDrawerCreateEvent();
   };
 
-  const handleSave = (data: EventDTO) => {
-    if (isEditing && eventToEdit) {
-      const updatedEvent = {
-        ...eventToEdit,
-        ...data,
-      };
-      editEvent({id: eventId, updates: updatedEvent});
-    } else {
-      addEvent(data);
-    }
-    handleClose();
-  };
+  const handleSave = (data: EventDTO) => {};
 
   const handleCopySchema = () => {

[NoCoverage] ConditionalExpression
commons/diagram/modals/DrawerCreateEvent.tsx:99:9
   };
 
   const handleSave = (data: EventDTO) => {
-    if (isEditing && eventToEdit) {
+    if (false) {
       const updatedEvent = {
         ...eventToEdit,

[NoCoverage] BlockStatement
commons/diagram/modals/DrawerCreateEvent.tsx:99:35
   };
 
   const handleSave = (data: EventDTO) => {
-    if (isEditing && eventToEdit) {
-      const updatedEvent = {
-        ...eventToEdit,
-        ...data,
-      };
-      editEvent({id: eventId, updates: updatedEvent});
-    } else {
+    if (isEditing && eventToEdit) {} else {
       addEvent(data);
     }

[NoCoverage] BlockStatement
commons/diagram/modals/DrawerCreateEvent.tsx:105:12
         ...data,
       };
       editEvent({id: eventId, updates: updatedEvent});
-    } else {
-      addEvent(data);
-    }
+    } else {}
     handleClose();
   };

[NoCoverage] BlockStatement
commons/diagram/modals/DrawerCreateEvent.tsx:111:34
     handleClose();
   };
 
-  const handleCopySchema = () => {
-    copyToClipboard(watch('schema'));
-  };
+  const handleCopySchema = () => {};
 
   return (

[NoCoverage] StringLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:124:26
       isOpen={isOpen}
       onClose={handleClose}
       placement="right"
-      title={isEditing ? 'Edit event' : 'New event'}
+      title={isEditing ? "" : 'New event'}
       customFooter={
         <div className="flex h-[100%] flex-row gap-2 py-2.5">

[Survived] ObjectLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:127:81
       title={isEditing ? 'Edit event' : 'New event'}
       customFooter={
         <div className="flex h-[100%] flex-row gap-2 py-2.5">
-          <UIKitButton type="primary" onClick={handleSubmit(handleSave)} style={{borderRadius: '3px'}}>
+          <UIKitButton type="primary" onClick={handleSubmit(handleSave)} style={{}}>
             {isEditing ? 'Save' : 'Create'}
           </UIKitButton>

[NoCoverage] StringLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:128:26
       customFooter={
         <div className="flex h-[100%] flex-row gap-2 py-2.5">
           <UIKitButton type="primary" onClick={handleSubmit(handleSave)} style={{borderRadius: '3px'}}>
-            {isEditing ? 'Save' : 'Create'}
+            {isEditing ? "" : 'Create'}
           </UIKitButton>
           <UIKitButton type="default" onClick={handleClose} style={{borderRadius: '3px'}}>

[Survived] StringLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:130:83
           <UIKitButton type="primary" onClick={handleSubmit(handleSave)} style={{borderRadius: '3px'}}>
             {isEditing ? 'Save' : 'Create'}
           </UIKitButton>
-          <UIKitButton type="default" onClick={handleClose} style={{borderRadius: '3px'}}>
+          <UIKitButton type="default" onClick={handleClose} style={{borderRadius: ""}}>
             Cancel
           </UIKitButton>

[Survived] ObjectLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:135:19
           </UIKitButton>
         </div>
       }
-      classNames={{
-        body: 'scrollbar',
-      }}
+      classNames={{}}
     >
       <UIKitForm name="wrap" labelAlign="left" labelWrap colon layout="vertical">

[Killed] OptionalChaining
commons/diagram/modals/DrawerCreateEvent.tsx:140:98
       }}
     >
       <UIKitForm name="wrap" labelAlign="left" labelWrap colon layout="vertical">
-        <UIKitFormItem label="Name" isRequired validateStatus={errors.name ? 'error' : ''} help={errors.name?.message}>
+        <UIKitFormItem label="Name" isRequired validateStatus={errors.name ? 'error' : ''} help={errors.name.message}>
           <UIKitInput
             {...nameField}
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[NoCoverage] StringLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:140:78
       }}
     >
       <UIKitForm name="wrap" labelAlign="left" labelWrap colon layout="vertical">
-        <UIKitFormItem label="Name" isRequired validateStatus={errors.name ? 'error' : ''} help={errors.name?.message}>
+        <UIKitFormItem label="Name" isRequired validateStatus={errors.name ? "" : ''} help={errors.name?.message}>
           <UIKitInput
             {...nameField}

[Survived] StringLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:153:35
           <UIKitTextArea
             {...eventDescriptionField}
             className="min-w-[302px] [&>div]:rounded-[3px]"
-            style={{borderRadius: '3px '}}
+            style={{borderRadius: ""}}
             placeholder="Enter description"
           />

[Survived] ObjectLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:161:28
           <UIKitMultipleSelect
             {...tagsField}
             className="max-h-[32px] min-w-[302px] [&>div]:rounded-[3px]"
-            dropdownStyle={{borderRadius: '3px'}}
+            dropdownStyle={{}}
             isAllowClear
             maxTagTextLength={8}

[Survived] StringLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:161:43
           <UIKitMultipleSelect
             {...tagsField}
             className="max-h-[32px] min-w-[302px] [&>div]:rounded-[3px]"
-            dropdownStyle={{borderRadius: '3px'}}
+            dropdownStyle={{borderRadius: ""}}
             isAllowClear
             maxTagTextLength={8}

[Survived] StringLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:166:35
             maxTagTextLength={8}
             maxTagCount={2}
             mode="multiple"
-            style={{borderRadius: '3px '}}
+            style={{borderRadius: ""}}
             options={tagOptions}
             onAddOption={addTag}

[Survived] BooleanLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:192:34
             className="h-fit min-h-[400px]"
             defaultLanguage="json"
             options={{
-              minimap: {enabled: false},
+              minimap: {enabled: true},
               stickyScroll: {enabled: false},
               scrollBeyondLastLine: false,

[Survived] BooleanLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:193:39
             defaultLanguage="json"
             options={{
               minimap: {enabled: false},
-              stickyScroll: {enabled: false},
+              stickyScroll: {enabled: true},
               scrollBeyondLastLine: false,
               wordWrap: 'on',

[Survived] BooleanLiteral
commons/diagram/modals/DrawerCreateEvent.tsx:194:37
             options={{
               minimap: {enabled: false},
               stickyScroll: {enabled: false},
-              scrollBeyondLastLine: false,
+              scrollBeyondLastLine: true,
               wordWrap: 'on',
             }}
