[Timeout] ObjectLiteral
commons/diagram/modals/DrawerTopicEdit.tsx:35:62
 
   const {isOpen, itemId} = drawerEditTopic;
 
-  const [nodeData, setNodeData] = useState<Partial<NodeDTO>>({
-    name: '',
-    brokerType: null,
-    type: 'TOPIC',
-  });
+  const [nodeData, setNodeData] = useState<Partial<NodeDTO>>({});
 
   const handleSave = () => {

[Survived] StringLiteral
commons/diagram/modals/DrawerTopicEdit.tsx:36:11
   const {isOpen, itemId} = drawerEditTopic;
 
   const [nodeData, setNodeData] = useState<Partial<NodeDTO>>({
-    name: '',
+    name: "Stryker was here!",
     brokerType: null,
     type: 'TOPIC',

[NoCoverage] BlockStatement
commons/diagram/modals/DrawerTopicEdit.tsx:41:28
     type: 'TOPIC',
   });
 
-  const handleSave = () => {
-    editNode({id: itemId, updates: nodeData});
-    closeDrawerEditTopic();
-  };
+  const handleSave = () => {};
 
   const handleChange =

[Killed] OptionalChaining
commons/diagram/modals/DrawerTopicEdit.tsx:55:23
       }
     };
 
-  const otherBroker = brokerOptions.find(option => option.value === nodeData.brokerType)?.label === 'Other';
+  const otherBroker = brokerOptions.find(option => option.value === nodeData.brokerType).label === 'Other';
 
   useEffect(() => {
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of undefined (reading 'label')

[Survived] ConditionalExpression
commons/diagram/modals/DrawerTopicEdit.tsx:55:52
       }
     };
 
-  const otherBroker = brokerOptions.find(option => option.value === nodeData.brokerType)?.label === 'Other';
+  const otherBroker = brokerOptions.find(option => false)?.label === 'Other';
 
   useEffect(() => {

[Survived] BlockStatement
commons/diagram/modals/DrawerTopicEdit.tsx:57:19
 
   const otherBroker = brokerOptions.find(option => option.value === nodeData.brokerType)?.label === 'Other';
 
-  useEffect(() => {
-    if (isOpen && eventGraph) {
-      const node = eventGraph.nodes.find(n => n.id === itemId);
-      if (node) {
-        setNodeData({
-          name: node.name,
-          brokerType: node.brokerType,
-        });
-      }
-    }
-  }, [isOpen, eventGraph, itemId]);
+  useEffect(() => {}, [isOpen, eventGraph, itemId]);
 
   return (

[Survived] LogicalOperator
commons/diagram/modals/DrawerTopicEdit.tsx:58:9
   const otherBroker = brokerOptions.find(option => option.value === nodeData.brokerType)?.label === 'Other';
 
   useEffect(() => {
-    if (isOpen && eventGraph) {
+    if (isOpen || eventGraph) {
       const node = eventGraph.nodes.find(n => n.id === itemId);
       if (node) {

[NoCoverage] ConditionalExpression
commons/diagram/modals/DrawerTopicEdit.tsx:59:47
 
   useEffect(() => {
     if (isOpen && eventGraph) {
-      const node = eventGraph.nodes.find(n => n.id === itemId);
+      const node = eventGraph.nodes.find(n => true);
       if (node) {
         setNodeData({

[NoCoverage] EqualityOperator
commons/diagram/modals/DrawerTopicEdit.tsx:59:47
 
   useEffect(() => {
     if (isOpen && eventGraph) {
-      const node = eventGraph.nodes.find(n => n.id === itemId);
+      const node = eventGraph.nodes.find(n => n.id !== itemId);
       if (node) {
         setNodeData({

[NoCoverage] ConditionalExpression
commons/diagram/modals/DrawerTopicEdit.tsx:60:11
   useEffect(() => {
     if (isOpen && eventGraph) {
       const node = eventGraph.nodes.find(n => n.id === itemId);
-      if (node) {
+      if (true) {
         setNodeData({
           name: node.name,

[NoCoverage] BlockStatement
commons/diagram/modals/DrawerTopicEdit.tsx:60:17
   useEffect(() => {
     if (isOpen && eventGraph) {
       const node = eventGraph.nodes.find(n => n.id === itemId);
-      if (node) {
-        setNodeData({
-          name: node.name,
-          brokerType: node.brokerType,
-        });
-      }
+      if (node) {}
     }
   }, [isOpen, eventGraph, itemId]);

[NoCoverage] ObjectLiteral
commons/diagram/modals/DrawerTopicEdit.tsx:61:21
     if (isOpen && eventGraph) {
       const node = eventGraph.nodes.find(n => n.id === itemId);
       if (node) {
-        setNodeData({
-          name: node.name,
-          brokerType: node.brokerType,
-        });
+        setNodeData({});
       }
     }

[Survived] ArrowFunction
commons/diagram/modals/DrawerTopicEdit.tsx:84:48
           <UIKitButton type="primary" onClick={handleSave}>
             Save
           </UIKitButton>
-          <UIKitButton type="primary" onClick={() => closeDrawerEditTopic()}>
+          <UIKitButton type="primary" onClick={() => undefined}>
             Cancel
           </UIKitButton>

[Survived] ObjectLiteral
commons/diagram/modals/DrawerTopicEdit.tsx:91:73
       }
     >
       <UIKitSpace direction="vertical" size="small">
-        <UIKitForm name="wrap" labelAlign="left" labelWrap colon style={{maxWidth: 302}} layout="vertical">
+        <UIKitForm name="wrap" labelAlign="left" labelWrap colon style={{}} layout="vertical">
           <UIKitFormItem label="Name">
             <UIKitInput value={nodeData.name} style={{borderRadius: '3px '}} onChange={handleChange('name')} />

[Survived] StringLiteral
commons/diagram/modals/DrawerTopicEdit.tsx:93:69
       <UIKitSpace direction="vertical" size="small">
         <UIKitForm name="wrap" labelAlign="left" labelWrap colon style={{maxWidth: 302}} layout="vertical">
           <UIKitFormItem label="Name">
-            <UIKitInput value={nodeData.name} style={{borderRadius: '3px '}} onChange={handleChange('name')} />
+            <UIKitInput value={nodeData.name} style={{borderRadius: ""}} onChange={handleChange('name')} />
           </UIKitFormItem>
           <UIKitFormItem label="Broker">

[Survived] ObjectLiteral
commons/diagram/modals/DrawerTopicEdit.tsx:99:22
             <UIKitSelect
               className="min-w-[302px] [&>div]:rounded-[3px]"
               dropdownStyle={{borderRadius: '3px'}}
-              style={{borderRadius: '3px '}}
+              style={{}}
               defaultValue={nodeData.brokerType}
               value={nodeData.brokerType}

[Survived] ConditionalExpression
commons/diagram/modals/DrawerTopicEdit.tsx:108:12
             />
           </UIKitFormItem>
 
-          {otherBroker && (
-            <UIKitFormItem label="Broker URL">
-              <UIKitInput style={{borderRadius: '3px '}} isDisabled />
-            </UIKitFormItem>
-          )}
+          {true}
         </UIKitForm>
       </UIKitSpace>

[Survived] LogicalOperator
commons/diagram/modals/DrawerTopicEdit.tsx:108:12
             />
           </UIKitFormItem>
 
-          {otherBroker && (
-            <UIKitFormItem label="Broker URL">
-              <UIKitInput style={{borderRadius: '3px '}} isDisabled />
-            </UIKitFormItem>
-          )}
+          {otherBroker || <UIKitFormItem label="Broker URL">
+              <UIKitInput style={{
+    borderRadius: '3px '
+  }} isDisabled />
+            </UIKitFormItem>}
         </UIKitForm>
       </UIKitSpace>

[NoCoverage] ObjectLiteral
commons/diagram/modals/DrawerTopicEdit.tsx:110:34
 
           {otherBroker && (
             <UIKitFormItem label="Broker URL">
-              <UIKitInput style={{borderRadius: '3px '}} isDisabled />
+              <UIKitInput style={{}} isDisabled />
             </UIKitFormItem>
           )}
