[NoCoverage] StringLiteral
components/commons/sidebar/Sidebar.tsx:19:79
   const hiddenItems = useUnit($hiddenItems);
   const eventGraphData = useUnit($eventGraph);
 
-  const containerClassName = clsx('h-full w-[20rem] bg-white shrink-0 pt-12', 'side-bar');
+  const containerClassName = clsx('h-full w-[20rem] bg-white shrink-0 pt-12', "");
 
   // 215px - высота нижней панели с кнопками + отступ от верхней границы экрана

[NoCoverage] StringLiteral
components/commons/sidebar/Sidebar.tsx:19:35
   const hiddenItems = useUnit($hiddenItems);
   const eventGraphData = useUnit($eventGraph);
 
-  const containerClassName = clsx('h-full w-[20rem] bg-white shrink-0 pt-12', 'side-bar');
+  const containerClassName = clsx("", 'side-bar');
 
   // 215px - высота нижней панели с кнопками + отступ от верхней границы экрана

[NoCoverage] StringLiteral
components/commons/sidebar/Sidebar.tsx:22:89
   const containerClassName = clsx('h-full w-[20rem] bg-white shrink-0 pt-12', 'side-bar');
 
   // 215px - высота нижней панели с кнопками + отступ от верхней границы экрана
-  const scrollAreaClassName = clsx(`w-full overflow-y-scroll scroll-auto`, 'scrollbar', 'h-[calc(100vh_-_215px)]');
+  const scrollAreaClassName = clsx(`w-full overflow-y-scroll scroll-auto`, 'scrollbar', "");
   return (
     <div className={containerClassName} data-testid="sidebar">

[NoCoverage] StringLiteral
components/commons/sidebar/Sidebar.tsx:41:26
           className="flex items-center justify-start gap-3"
           buttonsConfig={[
             {
-              buttonKey: 'export-button',
+              buttonKey: "",
               icon: <FileExport />,
               iconPosition: 'start',

[NoCoverage] BooleanLiteral
components/commons/sidebar/Sidebar.tsx:45:24
               icon: <FileExport />,
               iconPosition: 'start',
               children: 'Export',
-              isBlock: false,
+              isBlock: true,
               isDisabled: !eventGraphData,
               isLoading: false,

[NoCoverage] BooleanLiteral
components/commons/sidebar/Sidebar.tsx:47:26
               children: 'Export',
               isBlock: false,
               isDisabled: !eventGraphData,
-              isLoading: false,
+              isLoading: true,
               onClick: () => openDrawerExport(),
               type: 'primary',

[NoCoverage] ArrowFunction
components/commons/sidebar/Sidebar.tsx:48:24
               isBlock: false,
               isDisabled: !eventGraphData,
               isLoading: false,
-              onClick: () => openDrawerExport(),
+              onClick: () => undefined,
               type: 'primary',
             },

[NoCoverage] BooleanLiteral
components/commons/sidebar/Sidebar.tsx:54:24
             {
               buttonKey: 'upload-button',
               icon: <CloudUpload />,
-              isBlock: false,
+              isBlock: true,
               isDisabled: false,
               isLoading: false,

[NoCoverage] BooleanLiteral
components/commons/sidebar/Sidebar.tsx:55:27
               buttonKey: 'upload-button',
               icon: <CloudUpload />,
               isBlock: false,
-              isDisabled: false,
+              isDisabled: true,
               isLoading: false,
               onClick: () => console.log('Upload'),

[NoCoverage] BooleanLiteral
components/commons/sidebar/Sidebar.tsx:56:26
               icon: <CloudUpload />,
               isBlock: false,
               isDisabled: false,
-              isLoading: false,
+              isLoading: true,
               onClick: () => console.log('Upload'),
             },

[NoCoverage] ArrowFunction
components/commons/sidebar/Sidebar.tsx:57:24
               isBlock: false,
               isDisabled: false,
               isLoading: false,
-              onClick: () => console.log('Upload'),
+              onClick: () => undefined,
             },
             {

[NoCoverage] BooleanLiteral
components/commons/sidebar/Sidebar.tsx:62:24
             {
               buttonKey: 'reload-button',
               icon: <Reload />,
-              isBlock: false,
+              isBlock: true,
               isDisabled: false,
               isLoading: false,

[NoCoverage] ArrowFunction
components/commons/sidebar/Sidebar.tsx:65:24
               isBlock: false,
               isDisabled: false,
               isLoading: false,
-              onClick: () => console.log('Reload'),
+              onClick: () => undefined,
             },
             {

[NoCoverage] BooleanLiteral
components/commons/sidebar/Sidebar.tsx:70:24
             {
               buttonKey: 'filecode-button',
               icon: <FileCode />,
-              isBlock: false,
+              isBlock: true,
               isDisabled: false,
               isLoading: false,

[NoCoverage] ArrowFunction
components/commons/sidebar/Sidebar.tsx:73:24
               isBlock: false,
               isDisabled: false,
               isLoading: false,
-              onClick: () => console.log('File'),
+              onClick: () => undefined,
             },
           ]}
