[NoCoverage] ConditionalExpression
commons/diagram/modals/SpecificationModal.tsx:35:47
 
   useEffect(() => {
     if (isOpen && eventGraph) {
-      const node = eventGraph.nodes.find(n => n.id === nodeId);
+      const node = eventGraph.nodes.find(n => true);
       if (node) {
         setNodeData(node);

[Survived] BlockStatement
commons/diagram/modals/SpecificationModal.tsx:42:19
     }
   }, [isOpen, eventGraph, nodeId]);
 
-  useEffect(() => {
-    const request: GetServiceSpecificationPostRequest = {
-      serviceNodeId: nodeId,
-      eventGraph,
-    };
-
-    if (specificationData.data.serviceNodeId !== nodeId && isOpen) {
-      fetchServiceSpecificationFx(request).then(result => setSpecificationData(result));
-    }
-  }, [eventGraph, isOpen, nodeId, specificationData.data.serviceNodeId]);
+  useEffect(() => {}, [eventGraph, isOpen, nodeId, specificationData.data.serviceNodeId]);
 
   useEffect(() => {

[Killed] ConditionalExpression
commons/diagram/modals/SpecificationModal.tsx:48:9
       eventGraph,
     };
 
-    if (specificationData.data.serviceNodeId !== nodeId && isOpen) {
+    if (true) {
       fetchServiceSpecificationFx(request).then(result => setSpecificationData(result));
     }
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: Error: AxiosError: Network Error

[Killed] LogicalOperator
commons/diagram/modals/SpecificationModal.tsx:48:9
       eventGraph,
     };
 
-    if (specificationData.data.serviceNodeId !== nodeId && isOpen) {
+    if (specificationData.data.serviceNodeId !== nodeId || isOpen) {
       fetchServiceSpecificationFx(request).then(result => setSpecificationData(result));
     }
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: Error: AxiosError: Network Error

[NoCoverage] ArrowFunction
commons/diagram/modals/SpecificationModal.tsx:49:49
     };
 
     if (specificationData.data.serviceNodeId !== nodeId && isOpen) {
-      fetchServiceSpecificationFx(request).then(result => setSpecificationData(result));
+      fetchServiceSpecificationFx(request).then(() => undefined);
     }
   }, [eventGraph, isOpen, nodeId, specificationData.data.serviceNodeId]);

[Survived] ArrayDeclaration
commons/diagram/modals/SpecificationModal.tsx:51:6
     if (specificationData.data.serviceNodeId !== nodeId && isOpen) {
       fetchServiceSpecificationFx(request).then(result => setSpecificationData(result));
     }
-  }, [eventGraph, isOpen, nodeId, specificationData.data.serviceNodeId]);
+  }, []);
 
   useEffect(() => {

[Survived] BlockStatement
commons/diagram/modals/SpecificationModal.tsx:53:19
     }
   }, [eventGraph, isOpen, nodeId, specificationData.data.serviceNodeId]);
 
-  useEffect(() => {
-    setSpecificationData(specificationDataInitialState);
-  }, [isOpen]);
+  useEffect(() => {}, [isOpen]);
 
   const handleSave = () => {

[Survived] ArrayDeclaration
commons/diagram/modals/SpecificationModal.tsx:55:6
 
   useEffect(() => {
     setSpecificationData(specificationDataInitialState);
-  }, [isOpen]);
+  }, []);
 
   const handleSave = () => {

[NoCoverage] BlockStatement
commons/diagram/modals/SpecificationModal.tsx:57:28
     setSpecificationData(specificationDataInitialState);
   }, [isOpen]);
 
-  const handleSave = () => {
-    editNode({id: nodeId, updates: nodeData});
-    closeSpecificationModal();
-  };
+  const handleSave = () => {};
 
   const swaggerJson = specificationData?.data.specification && JSON.parse(specificationData?.data.specification);

[Killed] LogicalOperator
commons/diagram/modals/SpecificationModal.tsx:62:23
     closeSpecificationModal();
   };
 
-  const swaggerJson = specificationData?.data.specification && JSON.parse(specificationData?.data.specification);
+  const swaggerJson = specificationData?.data.specification || JSON.parse(specificationData?.data.specification);
 
   return (
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: SyntaxError: "undefined" is not valid JSON

[NoCoverage] OptionalChaining
commons/diagram/modals/SpecificationModal.tsx:62:75
     closeSpecificationModal();
   };
 
-  const swaggerJson = specificationData?.data.specification && JSON.parse(specificationData?.data.specification);
+  const swaggerJson = specificationData?.data.specification && JSON.parse(specificationData.data.specification);
 
   return (

[Survived] ObjectLiteral
commons/diagram/modals/SpecificationModal.tsx:73:27
       placement="right"
       size="1500px"
       width={1500}
-      defaultFooterProps={{
-        cancelBtnText: 'Cancel',
-        acceptBtnText: 'Save',
-        onAccept: handleSave,
-      }}
+      defaultFooterProps={{}}
       classNames={{
         body: 'scrollbar',

[Survived] ObjectLiteral
commons/diagram/modals/SpecificationModal.tsx:78:19
         acceptBtnText: 'Save',
         onAccept: handleSave,
       }}
-      classNames={{
-        body: 'scrollbar',
-      }}
+      classNames={{}}
     >
       <Row wrap={false} className="h-full">

[Survived] BooleanLiteral
commons/diagram/modals/SpecificationModal.tsx:82:18
         body: 'scrollbar',
       }}
     >
-      <Row wrap={false} className="h-full">
+      <Row wrap={true} className="h-full">
         <Editor
           loading={<NodeSkeleton className="h-[100px] w-full" isActive />}

[Survived] OptionalChaining
commons/diagram/modals/SpecificationModal.tsx:86:18
         <Editor
           loading={<NodeSkeleton className="h-[100px] w-full" isActive />}
           className="h-full min-h-[529px] border-2 border-[#D9D9D9]"
-          value={specificationData?.data.specification}
+          value={specificationData.data.specification}
           min-width={620}
           defaultLanguage="json"

[Survived] OptionalChaining
commons/diagram/modals/SpecificationModal.tsx:89:25
           value={specificationData?.data.specification}
           min-width={620}
           defaultLanguage="json"
-          defaultValue={specificationData?.data.specification}
+          defaultValue={specificationData.data.specification}
           options={{
             minimap: {enabled: false},

[Survived] BooleanLiteral
commons/diagram/modals/SpecificationModal.tsx:95:23
             stickyScroll: {enabled: false},
             scrollBeyondLastLine: false,
             wordWrap: 'on',
-            readOnly: true,
+            readOnly: false,
           }}
         />
