[NoCoverage] BlockStatement
src/helpers/electron/killProcess.ts:10:45
  *
  * @param {number} pid Process ID.
  */
-export const killProcess = (pid: number) => {
-  appExitLogger.info('App exited');
-  appExitLogger.info('Core pid: ', pid);
-
-  kill(pid);
-};
+export const killProcess = (pid: number) => {};
 

[NoCoverage] StringLiteral
src/helpers/electron/killProcess.ts:11:22
  * @param {number} pid Process ID.
  */
 export const killProcess = (pid: number) => {
-  appExitLogger.info('App exited');
+  appExitLogger.info("");
   appExitLogger.info('Core pid: ', pid);
 
