[Timeout] ObjectLiteral
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:25:38
   const eventGraph = useUnit($eventGraph);
   const ghostNodes = useUnit($ghostNodes);
   const {isOpen, linkId} = drawerEditLink;
-  const methods = useForm<ILinkForm>({
-    defaultValues: {
-      connectionType: null,
-      objectToConnect: null,
-      fromId: EMPTY_CHAR,
-      toId: EMPTY_CHAR,
-      eventId: EMPTY_CHAR,
-    },
-  });
+  const methods = useForm<ILinkForm>({});
 
   const {fromId, toId} = eventGraph?.links?.find(({id}) => id === linkId) ?? {};

[NoCoverage] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:35:60
     },
   });
 
-  const {fromId, toId} = eventGraph?.links?.find(({id}) => id === linkId) ?? {};
+  const {fromId, toId} = eventGraph?.links?.find(({id}) => true) ?? {};
   const nodes = eventGraph?.nodes;
   const events = eventGraph?.events || EMPTY_ARRAY;

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:35:26
     },
   });
 
-  const {fromId, toId} = eventGraph?.links?.find(({id}) => id === linkId) ?? {};
+  const {fromId, toId} = eventGraph?.links.find(({id}) => id === linkId) ?? {};
   const nodes = eventGraph?.nodes;
   const events = eventGraph?.events || EMPTY_ARRAY;

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:36:17
   });
 
   const {fromId, toId} = eventGraph?.links?.find(({id}) => id === linkId) ?? {};
-  const nodes = eventGraph?.nodes;
+  const nodes = eventGraph.nodes;
   const events = eventGraph?.events || EMPTY_ARRAY;
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:37:18
 
   const {fromId, toId} = eventGraph?.links?.find(({id}) => id === linkId) ?? {};
   const nodes = eventGraph?.nodes;
-  const events = eventGraph?.events || EMPTY_ARRAY;
+  const events = eventGraph.events || EMPTY_ARRAY;
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);

[Survived] LogicalOperator
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:37:18
 
   const {fromId, toId} = eventGraph?.links?.find(({id}) => id === linkId) ?? {};
   const nodes = eventGraph?.nodes;
-  const events = eventGraph?.events || EMPTY_ARRAY;
+  const events = eventGraph?.events && EMPTY_ARRAY;
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);

[NoCoverage] EqualityOperator
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:38:50
   const {fromId, toId} = eventGraph?.links?.find(({id}) => id === linkId) ?? {};
   const nodes = eventGraph?.nodes;
   const events = eventGraph?.events || EMPTY_ARRAY;
-  const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
+  const serviceNodes = nodes?.filter(({type}) => type !== NodeDTOTypeEnum.Service);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);

[NoCoverage] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:38:50
   const {fromId, toId} = eventGraph?.links?.find(({id}) => id === linkId) ?? {};
   const nodes = eventGraph?.nodes;
   const events = eventGraph?.events || EMPTY_ARRAY;
-  const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
+  const serviceNodes = nodes?.filter(({type}) => false);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);

[NoCoverage] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:39:48
   const nodes = eventGraph?.nodes;
   const events = eventGraph?.events || EMPTY_ARRAY;
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
-  const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
+  const topicNodes = nodes?.filter(({type}) => true);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
   const serviceOptions = serviceNodes?.map(({id, name}) => ({

[NoCoverage] EqualityOperator
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:39:48
   const nodes = eventGraph?.nodes;
   const events = eventGraph?.events || EMPTY_ARRAY;
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
-  const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
+  const topicNodes = nodes?.filter(({type}) => type !== NodeDTOTypeEnum.Topic);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
   const serviceOptions = serviceNodes?.map(({id, name}) => ({

[Survived] MethodExpression
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:40:21
   const events = eventGraph?.events || EMPTY_ARRAY;
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
-  const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
+  const httpNodes = nodes;
   const serviceOptions = serviceNodes?.map(({id, name}) => ({
     label: name,

[Survived] ArrowFunction
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:40:35
   const events = eventGraph?.events || EMPTY_ARRAY;
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
-  const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
+  const httpNodes = nodes?.filter(() => undefined);
   const serviceOptions = serviceNodes?.map(({id, name}) => ({
     label: name,

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:41:26
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
-  const serviceOptions = serviceNodes?.map(({id, name}) => ({
+  const serviceOptions = serviceNodes.map(({id, name}) => ({
     label: name,
     value: id,

[Survived] ArrowFunction
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:41:44
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
-  const serviceOptions = serviceNodes?.map(({id, name}) => ({
-    label: name,
-    value: id,
-  }));
+  const serviceOptions = serviceNodes?.map(() => undefined);
   const topicOptions = topicNodes?.map(({id, name}) => ({
     label: name,

[Survived] OptionalChaining
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:45:24
     label: name,
     value: id,
   }));
-  const topicOptions = topicNodes?.map(({id, name}) => ({
+  const topicOptions = topicNodes.map(({id, name}) => ({
     label: name,
     value: id,

[Survived] ArrowFunction
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:45:40
     label: name,
     value: id,
   }));
-  const topicOptions = topicNodes?.map(({id, name}) => ({
-    label: name,
-    value: id,
-  }));
+  const topicOptions = topicNodes?.map(() => undefined);
   const httpOptions = httpNodes?.map(({id, name}) => ({
     label: name,

[Survived] BlockStatement
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:59:26
   }));
   const {connectionType, httpNode, objectToConnect, serviceNode, topicNode} = getLinkFormData(nodes, fromId, toId);
 
-  const getTitle = () => {
-    const serviceName = serviceNode?.name ?? EMPTY_CHAR;
-    const topicName = topicNode?.name ?? EMPTY_CHAR;
-
-    switch (connectionType) {
-      case EConnectionType.PRODUCE:
-        return `${serviceName}${ARROW_RIGHT}${topicName}`;
-      case EConnectionType.CONSUME:
-        return `${serviceName}${ARROW_LEFT}${httpNode ? (httpNode?.name ?? EMPTY_CHAR) : topicName}`;
-      default:
-        return EMPTY_CHAR;
-    }
-  };
+  const getTitle = () => {};
 
   const closeHandler = useCallback(() => {

[Killed] OptionalChaining
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:60:25
   const {connectionType, httpNode, objectToConnect, serviceNode, topicNode} = getLinkFormData(nodes, fromId, toId);
 
   const getTitle = () => {
-    const serviceName = serviceNode?.name ?? EMPTY_CHAR;
+    const serviceName = serviceNode.name ?? EMPTY_CHAR;
     const topicName = topicNode?.name ?? EMPTY_CHAR;
 
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Survived] LogicalOperator
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:60:25
   const {connectionType, httpNode, objectToConnect, serviceNode, topicNode} = getLinkFormData(nodes, fromId, toId);
 
   const getTitle = () => {
-    const serviceName = serviceNode?.name ?? EMPTY_CHAR;
+    const serviceName = serviceNode?.name && EMPTY_CHAR;
     const topicName = topicNode?.name ?? EMPTY_CHAR;
 

[Survived] BlockStatement
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:73:42
     }
   };
 
-  const closeHandler = useCallback(() => {
-    closeDrawerEditLink();
-    methods.reset();
-  }, [methods]);
+  const closeHandler = useCallback(() => {}, [methods]);
 
   const editLinkHandler = useCallback(

[NoCoverage] BlockStatement
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:79:26
   }, [methods]);
 
   const editLinkHandler = useCallback(
-    (data: ILinkForm) => {
-      if (!data.fromId || !data.toId) return;
-
-      const adjustedData = getDeterminedLinkIds(data.connectionType, data);
-
-      editLink({fromId, toId, updates: adjustedData});
-      closeHandler();
-
-      if (ghostNodes?.length) {
-        const ghostNodeId = getRelatedGhostNodeId(ghostNodes, fromId, toId);
-        removeGhostNode(ghostNodeId);
-      }
-    },
+    (data: ILinkForm) => {},
     [closeHandler, fromId, ghostNodes, toId]
   );

[NoCoverage] LogicalOperator
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:80:11
 
   const editLinkHandler = useCallback(
     (data: ILinkForm) => {
-      if (!data.fromId || !data.toId) return;
+      if (!data.fromId && !data.toId) return;
 
       const adjustedData = getDeterminedLinkIds(data.connectionType, data);

[NoCoverage] BooleanLiteral
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:80:11
 
   const editLinkHandler = useCallback(
     (data: ILinkForm) => {
-      if (!data.fromId || !data.toId) return;
+      if (data.fromId || !data.toId) return;
 
       const adjustedData = getDeterminedLinkIds(data.connectionType, data);

[NoCoverage] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:87:11
       editLink({fromId, toId, updates: adjustedData});
       closeHandler();
 
-      if (ghostNodes?.length) {
+      if (true) {
         const ghostNodeId = getRelatedGhostNodeId(ghostNodes, fromId, toId);
         removeGhostNode(ghostNodeId);

[NoCoverage] OptionalChaining
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:87:11
       editLink({fromId, toId, updates: adjustedData});
       closeHandler();
 
-      if (ghostNodes?.length) {
+      if (ghostNodes.length) {
         const ghostNodeId = getRelatedGhostNodeId(ghostNodes, fromId, toId);
         removeGhostNode(ghostNodeId);

[Survived] BlockStatement
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:95:19
     [closeHandler, fromId, ghostNodes, toId]
   );
 
-  useEffect(() => {
-    methods.setValue('connectionType', connectionType);
-    methods.setValue('objectToConnect', objectToConnect);
-    methods.setValue('fromId', serviceNode?.id);
-    methods.setValue('toId', topicNode?.id);
-
-    if (objectToConnect === EObjectToConnect.HTTP_NODE) methods.setValue('toId', httpNode?.id);
-  }, [connectionType, fromId, httpNode, methods, nodes, objectToConnect, serviceNode, toId, topicNode]);
+  useEffect(() => {}, [connectionType, fromId, httpNode, methods, nodes, objectToConnect, serviceNode, toId, topicNode]);
 
   return (

[Killed] OptionalChaining
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:98:32
   useEffect(() => {
     methods.setValue('connectionType', connectionType);
     methods.setValue('objectToConnect', objectToConnect);
-    methods.setValue('fromId', serviceNode?.id);
+    methods.setValue('fromId', serviceNode.id);
     methods.setValue('toId', topicNode?.id);
 
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] OptionalChaining
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:99:30
     methods.setValue('connectionType', connectionType);
     methods.setValue('objectToConnect', objectToConnect);
     methods.setValue('fromId', serviceNode?.id);
-    methods.setValue('toId', topicNode?.id);
+    methods.setValue('toId', topicNode.id);
 
     if (objectToConnect === EObjectToConnect.HTTP_NODE) methods.setValue('toId', httpNode?.id);
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Survived] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:101:9
     methods.setValue('fromId', serviceNode?.id);
     methods.setValue('toId', topicNode?.id);
 
-    if (objectToConnect === EObjectToConnect.HTTP_NODE) methods.setValue('toId', httpNode?.id);
+    if (false) methods.setValue('toId', httpNode?.id);
   }, [connectionType, fromId, httpNode, methods, nodes, objectToConnect, serviceNode, toId, topicNode]);
 

[Survived] EqualityOperator
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:101:9
     methods.setValue('fromId', serviceNode?.id);
     methods.setValue('toId', topicNode?.id);
 
-    if (objectToConnect === EObjectToConnect.HTTP_NODE) methods.setValue('toId', httpNode?.id);
+    if (objectToConnect !== EObjectToConnect.HTTP_NODE) methods.setValue('toId', httpNode?.id);
   }, [connectionType, fromId, httpNode, methods, nodes, objectToConnect, serviceNode, toId, topicNode]);
 

[Survived] ObjectLiteral
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:112:26
       width={350}
       customFooter={
         <Space>
-          <Button style={{borderRadius: '3px'}} type="primary" onClick={methods.handleSubmit(editLinkHandler)}>
+          <Button style={{}} type="primary" onClick={methods.handleSubmit(editLinkHandler)}>
             Save
           </Button>

[Survived] StringLiteral
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:116:41
             Save
           </Button>
 
-          <Button style={{borderRadius: '3px'}} onClick={closeHandler}>
+          <Button style={{borderRadius: ""}} onClick={closeHandler}>
             Cancel
           </Button>

[NoCoverage] BlockStatement
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:120:64
             Cancel
           </Button>
 
-          <Button style={{borderRadius: '3px'}} onClick={() => {
-            removeLink(linkId);
-            closeDrawerEditLink();
-          }}>
+          <Button style={{borderRadius: '3px'}} onClick={() => {}}>
             Delete
           </Button>

[Survived] ObjectLiteral
diagram/modals/drawer-link-modal/DrawerEditLink.tsx:120:26
             Cancel
           </Button>
 
-          <Button style={{borderRadius: '3px'}} onClick={() => {
+          <Button style={{}} onClick={() => {
             removeLink(linkId);
             closeDrawerEditLink();
