[Survived] ConditionalExpression
commons/diagram/nodes/CustomNode.tsx:28:21
 export type ICustomNodeProps = Partial<NodeProps<TCustomNode>>;
 
 export const CustomNode = ({data, id}: ICustomNodeProps) => {
-  const isService = data.nodeType === 'SERVICE';
+  const isService = false;
 
   const hiddenItems = useUnit($hiddenItems);

[Survived] EqualityOperator
commons/diagram/nodes/CustomNode.tsx:28:21
 export type ICustomNodeProps = Partial<NodeProps<TCustomNode>>;
 
 export const CustomNode = ({data, id}: ICustomNodeProps) => {
-  const isService = data.nodeType === 'SERVICE';
+  const isService = data.nodeType !== 'SERVICE';
 
   const hiddenItems = useUnit($hiddenItems);

[Killed] ConditionalExpression
commons/diagram/nodes/CustomNode.tsx:35:26
   const infoPanelModal = useUnit($infoPanelModal);
   const {popoverItems} = useNodePopover(id, data);
 
-  const isNodeSelected = infoPanelModal.itemId === id || selectedItems.includes(id);
+  const isNodeSelected = false;
   const handlePosition = isService ? Position.Right : Position.Left;
 
killedBy: /src/components/diagram/CustomNode.tsx applies correct styles based on selection state
statusReason: Error: expect(element).toHaveClass("bg-colorful-green-bg")

Expected the element to have class:
  bg-colorful-green-bg
Received:
  flex transition-all w-[11.688rem] items-center gap-2 border-2 border-solid px-4 py-3 align-middle hover:cursor-pointer rounded-sm border-colorful-green-border bg-white

[Killed] LogicalOperator
commons/diagram/nodes/CustomNode.tsx:35:26
   const infoPanelModal = useUnit($infoPanelModal);
   const {popoverItems} = useNodePopover(id, data);
 
-  const isNodeSelected = infoPanelModal.itemId === id || selectedItems.includes(id);
+  const isNodeSelected = infoPanelModal.itemId === id && selectedItems.includes(id);
   const handlePosition = isService ? Position.Right : Position.Left;
 
killedBy: /src/components/diagram/CustomNode.tsx applies correct styles based on selection state
statusReason: Error: expect(element).toHaveClass("bg-colorful-green-bg")

Expected the element to have class:
  bg-colorful-green-bg
Received:
  flex transition-all w-[11.688rem] items-center gap-2 border-2 border-solid px-4 py-3 align-middle hover:cursor-pointer rounded-sm border-colorful-green-border bg-white

[Survived] BooleanLiteral
commons/diagram/nodes/CustomNode.tsx:42:50
 
   const customNodeClassName = getCustomNodeClassName(id, data, isNodeSelected, hiddenItems);
 
-  const [isOverflowed, setIsOverflow] = useState(false);
+  const [isOverflowed, setIsOverflow] = useState(true);
   const [isReadOnly, setIsReadOnly] = useState(true);
   const [name, setName] = useState(data.name);

[Survived] BooleanLiteral
commons/diagram/nodes/CustomNode.tsx:43:48
   const customNodeClassName = getCustomNodeClassName(id, data, isNodeSelected, hiddenItems);
 
   const [isOverflowed, setIsOverflow] = useState(false);
-  const [isReadOnly, setIsReadOnly] = useState(true);
+  const [isReadOnly, setIsReadOnly] = useState(false);
   const [name, setName] = useState(data.name);
   const [openPopoverId, setOpenPopoverId] = useState<string | null>(null);

[Survived] BlockStatement
commons/diagram/nodes/CustomNode.tsx:47:19
   const [name, setName] = useState(data.name);
   const [openPopoverId, setOpenPopoverId] = useState<string | null>(null);
 
-  useEffect(() => {
-    requestAnimationFrame(() => {
-      setIsOverflow(inputElementRef.current?.scrollWidth > inputElementRef.current?.clientWidth);
-    });
-  }, [data.name, name]);
+  useEffect(() => {}, [data.name, name]);
 
   useEffect(() => {

[Survived] BlockStatement
commons/diagram/nodes/CustomNode.tsx:48:33
   const [openPopoverId, setOpenPopoverId] = useState<string | null>(null);
 
   useEffect(() => {
-    requestAnimationFrame(() => {
-      setIsOverflow(inputElementRef.current?.scrollWidth > inputElementRef.current?.clientWidth);
-    });
+    requestAnimationFrame(() => {});
   }, [data.name, name]);
 

[Killed] OptionalChaining
commons/diagram/nodes/CustomNode.tsx:49:60
 
   useEffect(() => {
     requestAnimationFrame(() => {
-      setIsOverflow(inputElementRef.current?.scrollWidth > inputElementRef.current?.clientWidth);
+      setIsOverflow(inputElementRef.current?.scrollWidth > inputElementRef.current.clientWidth);
     });
   }, [data.name, name]);
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: TypeError: Cannot read properties of null (reading 'clientWidth')

[Killed] OptionalChaining
commons/diagram/nodes/CustomNode.tsx:49:21
 
   useEffect(() => {
     requestAnimationFrame(() => {
-      setIsOverflow(inputElementRef.current?.scrollWidth > inputElementRef.current?.clientWidth);
+      setIsOverflow(inputElementRef.current.scrollWidth > inputElementRef.current?.clientWidth);
     });
   }, [data.name, name]);
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: TypeError: Cannot read properties of null (reading 'scrollWidth')

[Timeout] ArrayDeclaration
commons/diagram/nodes/CustomNode.tsx:51:6
     requestAnimationFrame(() => {
       setIsOverflow(inputElementRef.current?.scrollWidth > inputElementRef.current?.clientWidth);
     });
-  }, [data.name, name]);
+  }, []);
 
   useEffect(() => {

[Survived] BlockStatement
commons/diagram/nodes/CustomNode.tsx:53:19
     });
   }, [data.name, name]);
 
-  useEffect(() => {
-    setName(data.name);
-  }, [data.name]);
+  useEffect(() => {}, [data.name]);
 
   const handleNameDoubleClick = useCallback(() => {

[Survived] ArrayDeclaration
commons/diagram/nodes/CustomNode.tsx:55:6
 
   useEffect(() => {
     setName(data.name);
-  }, [data.name]);
+  }, []);
 
   const handleNameDoubleClick = useCallback(() => {

[NoCoverage] BlockStatement
commons/diagram/nodes/CustomNode.tsx:57:51
     setName(data.name);
   }, [data.name]);
 
-  const handleNameDoubleClick = useCallback(() => {
-    setIsReadOnly(false);
-  }, []);
+  const handleNameDoubleClick = useCallback(() => {}, []);
 
   const handleOpenModal = useCallback(() => {

[NoCoverage] BooleanLiteral
commons/diagram/nodes/CustomNode.tsx:58:19
   }, [data.name]);
 
   const handleNameDoubleClick = useCallback(() => {
-    setIsReadOnly(false);
+    setIsReadOnly(true);
   }, []);
 

[NoCoverage] BlockStatement
commons/diagram/nodes/CustomNode.tsx:61:45
     setIsReadOnly(false);
   }, []);
 
-  const handleOpenModal = useCallback(() => {
-    toggleItemSelection(id);
-    openInfoPanelModal(id);
-  }, [id]);
+  const handleOpenModal = useCallback(() => {}, [id]);
 
   const handleNodeSelect = useCallback(

[NoCoverage] BlockStatement
commons/diagram/nodes/CustomNode.tsx:67:34
   }, [id]);
 
   const handleNodeSelect = useCallback(
-    (event: React.MouseEvent) => {
-      if (event?.ctrlKey || event?.shiftKey) {
-        addMultipleSelection(id);
-      } else {
-        toggleItemSelection(id);
-      }
-    },
+    (event: React.MouseEvent) => {},
     [id]
   );

[NoCoverage] OptionalChaining
commons/diagram/nodes/CustomNode.tsx:68:29
 
   const handleNodeSelect = useCallback(
     (event: React.MouseEvent) => {
-      if (event?.ctrlKey || event?.shiftKey) {
+      if (event?.ctrlKey || event.shiftKey) {
         addMultipleSelection(id);
       } else {

[NoCoverage] BlockStatement
commons/diagram/nodes/CustomNode.tsx:68:46
 
   const handleNodeSelect = useCallback(
     (event: React.MouseEvent) => {
-      if (event?.ctrlKey || event?.shiftKey) {
-        addMultipleSelection(id);
-      } else {
+      if (event?.ctrlKey || event?.shiftKey) {} else {
         toggleItemSelection(id);
       }

[NoCoverage] BlockStatement
commons/diagram/nodes/CustomNode.tsx:70:14
     (event: React.MouseEvent) => {
       if (event?.ctrlKey || event?.shiftKey) {
         addMultipleSelection(id);
-      } else {
-        toggleItemSelection(id);
-      }
+      } else {}
     },
     [id]

[Survived] BlockStatement
commons/diagram/nodes/CustomNode.tsx:83:30
   const onNodeClick = useSingleAndDoubleClick(handleNodeSelect, handleOpenModal);
   const onNameClick = useSingleAndDoubleClick(handleNodeSelect, handleNameDoubleClick);
 
-  const editNodeName = () => {
-    if (name !== data.name) {
-      editNode({id, updates: {name}});
-    }
-  };
+  const editNodeName = () => {};
 
   const handleBlur = () => {

[Survived] ConditionalExpression
commons/diagram/nodes/CustomNode.tsx:84:9
   const onNameClick = useSingleAndDoubleClick(handleNodeSelect, handleNameDoubleClick);
 
   const editNodeName = () => {
-    if (name !== data.name) {
+    if (false) {
       editNode({id, updates: {name}});
     }

[Survived] ConditionalExpression
commons/diagram/nodes/CustomNode.tsx:84:9
   const onNameClick = useSingleAndDoubleClick(handleNodeSelect, handleNameDoubleClick);
 
   const editNodeName = () => {
-    if (name !== data.name) {
+    if (true) {
       editNode({id, updates: {name}});
     }

[Survived] BlockStatement
commons/diagram/nodes/CustomNode.tsx:89:28
     }
   };
 
-  const handleBlur = () => {
-    setIsReadOnly(true);
-    editNodeName();
-  };
+  const handleBlur = () => {};
 
   const handleKeyDown = (event: React.KeyboardEvent) => {

[Survived] BooleanLiteral
commons/diagram/nodes/CustomNode.tsx:90:19
   };
 
   const handleBlur = () => {
-    setIsReadOnly(true);
+    setIsReadOnly(false);
     editNodeName();
   };

[NoCoverage] BlockStatement
commons/diagram/nodes/CustomNode.tsx:94:57
     editNodeName();
   };
 
-  const handleKeyDown = (event: React.KeyboardEvent) => {
-    if (event.key === 'Enter') {
-      setIsReadOnly(true);
-      editNodeName();
-    }
-  };
+  const handleKeyDown = (event: React.KeyboardEvent) => {};
 
   const handleContextMenuClick = useCallback(() => {

[NoCoverage] ConditionalExpression
commons/diagram/nodes/CustomNode.tsx:95:9
   };
 
   const handleKeyDown = (event: React.KeyboardEvent) => {
-    if (event.key === 'Enter') {
+    if (false) {
       setIsReadOnly(true);
       editNodeName();

[NoCoverage] ConditionalExpression
commons/diagram/nodes/CustomNode.tsx:95:9
   };
 
   const handleKeyDown = (event: React.KeyboardEvent) => {
-    if (event.key === 'Enter') {
+    if (true) {
       setIsReadOnly(true);
       editNodeName();

[NoCoverage] BooleanLiteral
commons/diagram/nodes/CustomNode.tsx:96:21
 
   const handleKeyDown = (event: React.KeyboardEvent) => {
     if (event.key === 'Enter') {
-      setIsReadOnly(true);
+      setIsReadOnly(false);
       editNodeName();
     }

[NoCoverage] BlockStatement
commons/diagram/nodes/CustomNode.tsx:101:52
     }
   };
 
-  const handleContextMenuClick = useCallback(() => {
-    setOpenPopoverId(id);
-    openPopoverMenu(id);
-  }, [id]);
+  const handleContextMenuClick = useCallback(() => {}, [id]);
 
   return (

[Survived] BooleanLiteral
commons/diagram/nodes/CustomNode.tsx:107:44
   }, [id]);
 
   return (
-    <Tooltip title={data.name} isDisabled={!isOverflowed} getPopupContainer={triggerNode => triggerNode}>
+    <Tooltip title={data.name} isDisabled={isOverflowed} getPopupContainer={triggerNode => triggerNode}>
       <div
         onContextMenu={e => {

[Survived] ArrowFunction
commons/diagram/nodes/CustomNode.tsx:107:78
   }, [id]);
 
   return (
-    <Tooltip title={data.name} isDisabled={!isOverflowed} getPopupContainer={triggerNode => triggerNode}>
+    <Tooltip title={data.name} isDisabled={!isOverflowed} getPopupContainer={() => undefined}>
       <div
         onContextMenu={e => {

[NoCoverage] BlockStatement
commons/diagram/nodes/CustomNode.tsx:109:29
   return (
     <Tooltip title={data.name} isDisabled={!isOverflowed} getPopupContainer={triggerNode => triggerNode}>
       <div
-        onContextMenu={e => {
-          e.preventDefault();
-          handleContextMenuClick();
-        }}
+        onContextMenu={e => {}}
       >
         <PopoverMenu items={popoverItems} popoverId={openPopoverId}>

[Killed] MethodExpression
commons/diagram/nodes/CustomNode.tsx:116:29
       >
         <PopoverMenu items={popoverItems} popoverId={openPopoverId}>
           <div
-            data-testid={`${data.nodeType.toLocaleLowerCase()}Node`}
+            data-testid={`${data.nodeType.toLocaleUpperCase()}Node`}
             className={customNodeClassName}
             onClick={onNodeClick}
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] StringLiteral
commons/diagram/nodes/CustomNode.tsx:116:26
       >
         <PopoverMenu items={popoverItems} popoverId={openPopoverId}>
           <div
-            data-testid={`${data.nodeType.toLocaleLowerCase()}Node`}
+            data-testid={``}
             className={customNodeClassName}
             onClick={onNodeClick}
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] MethodExpression
commons/diagram/nodes/CustomNode.tsx:122:31
           >
             {getNodeIcon(data.brokerType || data.nodeType)}
             <Input
-              data-testid={`${data.nodeType.toLocaleLowerCase()}NodeName`}
+              data-testid={`${data.nodeType.toLocaleUpperCase()}NodeName`}
               isReadOnly={isReadOnly}
               ref={inputElementRef}
killedBy: /src/components/diagram/CustomNode.tsx renders node correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="serviceNodeName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-describedby="test-id"
    >

[Killed] StringLiteral
commons/diagram/nodes/CustomNode.tsx:122:28
           >
             {getNodeIcon(data.brokerType || data.nodeType)}
             <Input
-              data-testid={`${data.nodeType.toLocaleLowerCase()}NodeName`}
+              data-testid={``}
               isReadOnly={isReadOnly}
               ref={inputElementRef}
killedBy: /src/components/diagram/CustomNode.tsx renders node correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="serviceNodeName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      aria-describedby="test-id"
    >

[Survived] ArrowFunction
commons/diagram/nodes/CustomNode.tsx:127:25
               ref={inputElementRef}
               type="text"
               value={name}
-              onChange={e => setName(e.target.value)}
+              onChange={() => undefined}
               onBlur={handleBlur}
               onKeyDown={handleKeyDown}

[NoCoverage] BlockStatement
commons/diagram/nodes/CustomNode.tsx:130:29
               onChange={e => setName(e.target.value)}
               onBlur={handleBlur}
               onKeyDown={handleKeyDown}
-              onClick={e => {
-                e.stopPropagation();
-                e.preventDefault();
-                onNameClick(e);
-              }}
+              onClick={e => {}}
               variant="borderless"
               className={getInputClassName(isReadOnly)}
