[Survived] BooleanLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:37:22
             buttonKey: 'firstButton',
             icon: <TopologyStar />,
             children: 'Service',
-            isBlock: false,
+            isBlock: true,
             isDisabled: false,
             isLoading: false,

[Survived] StringLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:42:20
             isLoading: false,
             onClick: onAddService,
             style: {},
-            title: 'Service',
+            title: "",
             shape: 'default',
             size: 'middle',

[Survived] StringLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:50:23
           {
             buttonKey: 'secondButton',
             icon: <ServerCog />,
-            children: 'Topic',
+            children: "",
             isBlock: false,
             isDisabled: false,

[Survived] BooleanLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:51:22
             buttonKey: 'secondButton',
             icon: <ServerCog />,
             children: 'Topic',
-            isBlock: false,
+            isBlock: true,
             isDisabled: false,
             isLoading: false,

[Survived] StringLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:56:20
             isLoading: false,
             onClick: onAddTopic,
             style: {},
-            title: 'Topic',
+            title: "",
             size: 'middle',
             type: 'default',

[Survived] StringLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:61:24
             type: 'default',
           },
           {
-            buttonKey: 'thirdButton',
+            buttonKey: "",
             icon: <FileCode />,
             children: 'Event',

[Survived] StringLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:63:23
           {
             buttonKey: 'thirdButton',
             icon: <FileCode />,
-            children: 'Event',
+            children: "",
             isBlock: false,
             isDisabled: false,

[Survived] BooleanLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:64:22
             buttonKey: 'thirdButton',
             icon: <FileCode />,
             children: 'Event',
-            isBlock: false,
+            isBlock: true,
             isDisabled: false,
             isLoading: false,

[Survived] StringLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:69:20
             isLoading: false,
             onClick: onAddEvent,
             style: {},
-            title: 'Event',
+            title: "",
             size: 'middle',
             type: 'default',

[Survived] BooleanLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:77:22
             buttonKey: 'fourthButton',
             icon: <CircleLetterH />,
             children: 'HTTP',
-            isBlock: false,
+            isBlock: true,
             isDisabled: false,
             isLoading: false,

[Survived] BooleanLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:90:22
             buttonKey: 'fifthButton',
             icon: <ArrowGuide />,
             children: 'Link',
-            isBlock: false,
+            isBlock: true,
             isDisabled: false,
             isLoading: false,

[Survived] StringLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:104:69
       <ImportFileButton />
       <Button
         key="deleteBtn"
-        className={clsx(selectedItems.length ? 'text-color-error' : '')}
+        className={clsx(selectedItems.length ? 'text-color-error' : "Stryker was here!")}
         icon={<Trash />}
         iconPosition="start"

[Survived] BooleanLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:107:18
         className={clsx(selectedItems.length ? 'text-color-error' : '')}
         icon={<Trash />}
         iconPosition="start"
-        isBlock={false}
+        isBlock={true}
         isDisabled={!selectedItems.length}
         isLoading={false}

[Survived] BooleanLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:109:20
         iconPosition="start"
         isBlock={false}
         isDisabled={!selectedItems.length}
-        isLoading={false}
+        isLoading={true}
         onClick={onDelete}
         shape="default"

[Survived] BooleanLiteral
commons/diagram/buttons/DiagramButtonsGroup.tsx:115:18
         size="middle"
         title="Delete"
         type="default"
-        isGhost={false}
+        isGhost={true}
       >
         Delete
