[Survived] EqualityOperator
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:28:60
   const currentEvent = useUnit($selectedMenuItem);
   const eventGraph = useUnit($eventGraph);
   // Отобранный эвент из графа на основе выбранного эвента.
-  const selectedEventData = eventGraph?.events?.find(el => el?.id === currentEvent?.id);
+  const selectedEventData = eventGraph?.events?.find(el => el?.id !== currentEvent?.id);
 
   const [jsonSchema, setJsonSchema] = useState<TSchema | null>(null);

[Survived] OptionalChaining
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:28:71
   const currentEvent = useUnit($selectedMenuItem);
   const eventGraph = useUnit($eventGraph);
   // Отобранный эвент из графа на основе выбранного эвента.
-  const selectedEventData = eventGraph?.events?.find(el => el?.id === currentEvent?.id);
+  const selectedEventData = eventGraph?.events?.find(el => el?.id === currentEvent.id);
 
   const [jsonSchema, setJsonSchema] = useState<TSchema | null>(null);

[NoCoverage] BlockStatement
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:32:58
 
   const [jsonSchema, setJsonSchema] = useState<TSchema | null>(null);
 
-  const handleSchemaUpdate = (updatedSchema: TSchema) => {
-    console.log('updatedSchema', updatedSchema);
-    editEvent({id: selectedEventData?.id, updates: {schema: JSON.stringify(updatedSchema, null, 2)}});
-  };
+  const handleSchemaUpdate = (updatedSchema: TSchema) => {};
 
   const renderTreeNodes = (schemaObj: TSchema, parentPath = ''): ITreeNode[] | null => {

[NoCoverage] StringLiteral
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:33:17
   const [jsonSchema, setJsonSchema] = useState<TSchema | null>(null);
 
   const handleSchemaUpdate = (updatedSchema: TSchema) => {
-    console.log('updatedSchema', updatedSchema);
+    console.log("", updatedSchema);
     editEvent({id: selectedEventData?.id, updates: {schema: JSON.stringify(updatedSchema, null, 2)}});
   };

[NoCoverage] OptionalChaining
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:34:20
 
   const handleSchemaUpdate = (updatedSchema: TSchema) => {
     console.log('updatedSchema', updatedSchema);
-    editEvent({id: selectedEventData?.id, updates: {schema: JSON.stringify(updatedSchema, null, 2)}});
+    editEvent({id: selectedEventData.id, updates: {schema: JSON.stringify(updatedSchema, null, 2)}});
   };
 

[NoCoverage] ObjectLiteral
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:34:52
 
   const handleSchemaUpdate = (updatedSchema: TSchema) => {
     console.log('updatedSchema', updatedSchema);
-    editEvent({id: selectedEventData?.id, updates: {schema: JSON.stringify(updatedSchema, null, 2)}});
+    editEvent({id: selectedEventData?.id, updates: {}});
   };
 

[Killed] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:38:9
   };
 
   const renderTreeNodes = (schemaObj: TSchema, parentPath = ''): ITreeNode[] | null => {
-    if (!schemaObj || !isSchemaObject(schemaObj) || !schemaObj.properties) {
+    if (schemaObj || !isSchemaObject(schemaObj) || !schemaObj.properties) {
       return null;
     }
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 1

Ignored nodes: comments, script, style
<html>

[Killed] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:38:53
   };
 
   const renderTreeNodes = (schemaObj: TSchema, parentPath = ''): ITreeNode[] | null => {
-    if (!schemaObj || !isSchemaObject(schemaObj) || !schemaObj.properties) {
+    if (!schemaObj || !isSchemaObject(schemaObj) || schemaObj.properties) {
       return null;
     }
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 1

Ignored nodes: comments, script, style
<html>

[Survived] StringLiteral
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:43:84
     }
 
     return Object.entries(schemaObj.properties).map(([propertyKey, propertySchema]) => {
-      const currentPath = parentPath ? `${parentPath}.properties.${propertyKey}` : `properties.${propertyKey}`;
+      const currentPath = parentPath ? `${parentPath}.properties.${propertyKey}` : ``;
 
       const hasChildren =

[NoCoverage] StringLiteral
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:43:40
     }
 
     return Object.entries(schemaObj.properties).map(([propertyKey, propertySchema]) => {
-      const currentPath = parentPath ? `${parentPath}.properties.${propertyKey}` : `properties.${propertyKey}`;
+      const currentPath = parentPath ? `` : `properties.${propertyKey}`;
 
       const hasChildren =

[Survived] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:46:9
       const currentPath = parentPath ? `${parentPath}.properties.${propertyKey}` : `properties.${propertyKey}`;
 
       const hasChildren =
-        isSchemaObject(propertySchema) &&
-        propertySchema.type === 'object' &&
-        propertySchema.properties &&
-        Object.keys(propertySchema.properties).length > 0;
+        false;
 
       return {

[Survived] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:46:9
       const currentPath = parentPath ? `${parentPath}.properties.${propertyKey}` : `properties.${propertyKey}`;
 
       const hasChildren =
-        isSchemaObject(propertySchema) &&
-        propertySchema.type === 'object' &&
-        propertySchema.properties &&
-        Object.keys(propertySchema.properties).length > 0;
+        true;
 
       return {

[Survived] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:47:9
 
       const hasChildren =
         isSchemaObject(propertySchema) &&
-        propertySchema.type === 'object' &&
+        true &&
         propertySchema.properties &&
         Object.keys(propertySchema.properties).length > 0;

[Survived] EqualityOperator
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:47:9
 
       const hasChildren =
         isSchemaObject(propertySchema) &&
-        propertySchema.type === 'object' &&
+        propertySchema.type !== 'object' &&
         propertySchema.properties &&
         Object.keys(propertySchema.properties).length > 0;

[NoCoverage] EqualityOperator
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:49:9
         isSchemaObject(propertySchema) &&
         propertySchema.type === 'object' &&
         propertySchema.properties &&
-        Object.keys(propertySchema.properties).length > 0;
+        Object.keys(propertySchema.properties).length >= 0;
 
       return {

[NoCoverage] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:49:9
         isSchemaObject(propertySchema) &&
         propertySchema.type === 'object' &&
         propertySchema.properties &&
-        Object.keys(propertySchema.properties).length > 0;
+        true;
 
       return {

[Killed] ArrayDeclaration
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:67:33
     });
   };
 
-  const treeData: ITreeNode[] = [
-    {
-      title: (
-        <JsonSchemaFormRow mainSchema={jsonSchema} jsonSchema={jsonSchema} onUpdateJsonSchema={handleSchemaUpdate} />
-      ),
-      key: 'root',
-      children: isSchemaObject(jsonSchema) ? renderTreeNodes(jsonSchema) : undefined,
-    },
-  ];
+  const treeData: ITreeNode[] = [];
 
   useEffect(() => {
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: Unable to find role="treeitem"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="ant-tree ant-tree-icon-hide ant-tree-block-node ant-tree-unselectable css-dev-only-do-not-override-tjsggz"
    >

[Killed] BlockStatement
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:77:19
     },
   ];
 
-  useEffect(() => {
-    if (schema) {
-      setJsonSchema(parseOpenapi(schema));
-    }
-  }, [schema]);
+  useEffect(() => {}, [schema]);
 
   return jsonSchema ? (
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should parse and render schema when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "{\"type\":\"object\",\"properties\":{\"name\":{\"type\":\"string\"}}}"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:78:9
   ];
 
   useEffect(() => {
-    if (schema) {
+    if (false) {
       setJsonSchema(parseOpenapi(schema));
     }
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should parse and render schema when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "{\"type\":\"object\",\"properties\":{\"name\":{\"type\":\"string\"}}}"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:78:17
   ];
 
   useEffect(() => {
-    if (schema) {
-      setJsonSchema(parseOpenapi(schema));
-    }
+    if (schema) {}
   }, [schema]);
 
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should parse and render schema when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "{\"type\":\"object\",\"properties\":{\"name\":{\"type\":\"string\"}}}"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Survived] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaForm.tsx:85:21
 
   return jsonSchema ? (
     <Tree
-      isSelectable={false}
+      isSelectable={true}
       defaultExpandedKeys={['root']}
       treeData={treeData}
