[Survived] ArrowFunction
diagram/modals/delete-items-modal/DeleteSelectedItemsModal.tsx:16:54
 export const DeleteSelectedItemsModal = () => {
   const eventGraph = useUnit($eventGraph);
   const {isOpen, selectedItemIds} = useUnit($deleteSelectedItemsModal);
-  const isOnlyLinksSelected = selectedItemIds?.every(selectedId =>
-    eventGraph?.links?.some(link => link.id === selectedId)
+  const isOnlyLinksSelected = selectedItemIds?.every(() => undefined
   );
 

[Survived] MethodExpression
diagram/modals/delete-items-modal/DeleteSelectedItemsModal.tsx:16:31
 export const DeleteSelectedItemsModal = () => {
   const eventGraph = useUnit($eventGraph);
   const {isOpen, selectedItemIds} = useUnit($deleteSelectedItemsModal);
-  const isOnlyLinksSelected = selectedItemIds?.every(selectedId =>
-    eventGraph?.links?.some(link => link.id === selectedId)
-  );
+  const isOnlyLinksSelected = selectedItemIds?.some(selectedId => eventGraph?.links?.some(link => link.id === selectedId));
 
   const renderModalContentText = () => {

[NoCoverage] OptionalChaining
diagram/modals/delete-items-modal/DeleteSelectedItemsModal.tsx:17:5
   const eventGraph = useUnit($eventGraph);
   const {isOpen, selectedItemIds} = useUnit($deleteSelectedItemsModal);
   const isOnlyLinksSelected = selectedItemIds?.every(selectedId =>
-    eventGraph?.links?.some(link => link.id === selectedId)
+    eventGraph?.links.some(link => link.id === selectedId)
   );
 

[NoCoverage] ConditionalExpression
diagram/modals/delete-items-modal/DeleteSelectedItemsModal.tsx:17:37
   const eventGraph = useUnit($eventGraph);
   const {isOpen, selectedItemIds} = useUnit($deleteSelectedItemsModal);
   const isOnlyLinksSelected = selectedItemIds?.every(selectedId =>
-    eventGraph?.links?.some(link => link.id === selectedId)
+    eventGraph?.links?.some(link => false)
   );
 

[Survived] ConditionalExpression
diagram/modals/delete-items-modal/DeleteSelectedItemsModal.tsx:21:9
   );
 
   const renderModalContentText = () => {
-    if (isOnlyLinksSelected) {
+    if (true) {
       return 'Deleting is an irreversible action. The link will be lost.';
     }

[Survived] ConditionalExpression
diagram/modals/delete-items-modal/DeleteSelectedItemsModal.tsx:21:9
   );
 
   const renderModalContentText = () => {
-    if (isOnlyLinksSelected) {
+    if (false) {
       return 'Deleting is an irreversible action. The link will be lost.';
     }

[NoCoverage] BlockStatement
diagram/modals/delete-items-modal/DeleteSelectedItemsModal.tsx:27:29
     return 'Deleting objects is an irreversible action. All relationships with these objects will be lost.';
   };
 
-  const handleClose = () => {
-    closeDeleteSelectedItemsModal();
-  };
+  const handleClose = () => {};
 
   const handleDeleteNode = () => {

[NoCoverage] BlockStatement
diagram/modals/delete-items-modal/DeleteSelectedItemsModal.tsx:31:34
     closeDeleteSelectedItemsModal();
   };
 
-  const handleDeleteNode = () => {
-    removeNodes(selectedItemIds);
-    closeDeleteSelectedItemsModal();
-  };
+  const handleDeleteNode = () => {};
 
   const handleDeleteNodeAndLinks = () => {

[NoCoverage] BlockStatement
diagram/modals/delete-items-modal/DeleteSelectedItemsModal.tsx:36:42
     closeDeleteSelectedItemsModal();
   };
 
-  const handleDeleteNodeAndLinks = () => {
-    selectedItemIds.forEach((itemId: string) => {
-      removeNodeWithConnectedLinks(itemId);
-    });
-    closeDeleteSelectedItemsModal();
-  };
+  const handleDeleteNodeAndLinks = () => {};
 
   const handleDeleteLink = () => {

[NoCoverage] BlockStatement
diagram/modals/delete-items-modal/DeleteSelectedItemsModal.tsx:37:49
   };
 
   const handleDeleteNodeAndLinks = () => {
-    selectedItemIds.forEach((itemId: string) => {
-      removeNodeWithConnectedLinks(itemId);
-    });
+    selectedItemIds.forEach((itemId: string) => {});
     closeDeleteSelectedItemsModal();
   };

[NoCoverage] BlockStatement
diagram/modals/delete-items-modal/DeleteSelectedItemsModal.tsx:43:34
     closeDeleteSelectedItemsModal();
   };
 
-  const handleDeleteLink = () => {
-    removeLinks(selectedItemIds);
-    closeDeleteSelectedItemsModal();
-  };
+  const handleDeleteLink = () => {};
 
   return (
