[Survived] OptionalChaining
components/commons/popovers/PopoverMenu.tsx:22:17
 
   const {isOpen, itemId} = popoverMenu;
 
-  const nodes = eventGraph?.nodes || [];
+  const nodes = eventGraph.nodes || [];
   const currentNode = itemId ? nodes?.find(item => item && item.id === itemId) : null;
 

[NoCoverage] ConditionalExpression
components/commons/popovers/PopoverMenu.tsx:23:52
   const {isOpen, itemId} = popoverMenu;
 
   const nodes = eventGraph?.nodes || [];
-  const currentNode = itemId ? nodes?.find(item => item && item.id === itemId) : null;
+  const currentNode = itemId ? nodes?.find(item => true) : null;
 
   const handleClose = () => {

[NoCoverage] ArrowFunction
components/commons/popovers/PopoverMenu.tsx:23:44
   const {isOpen, itemId} = popoverMenu;
 
   const nodes = eventGraph?.nodes || [];
-  const currentNode = itemId ? nodes?.find(item => item && item.id === itemId) : null;
+  const currentNode = itemId ? nodes?.find(() => undefined) : null;
 
   const handleClose = () => {

[NoCoverage] BlockStatement
components/commons/popovers/PopoverMenu.tsx:25:29
   const nodes = eventGraph?.nodes || [];
   const currentNode = itemId ? nodes?.find(item => item && item.id === itemId) : null;
 
-  const handleClose = () => {
-    closePopoverMenu();
-  };
+  const handleClose = () => {};
 
   const openPopover = popoverId === currentNode?.id;

[Killed] OptionalChaining
components/commons/popovers/PopoverMenu.tsx:29:37
     closePopoverMenu();
   };
 
-  const openPopover = popoverId === currentNode?.id;
+  const openPopover = popoverId === currentNode.id;
 
   return (
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Survived] ConditionalExpression
components/commons/popovers/PopoverMenu.tsx:29:23
     closePopoverMenu();
   };
 
-  const openPopover = popoverId === currentNode?.id;
+  const openPopover = false;
 
   return (

[NoCoverage] BlockStatement
components/commons/popovers/PopoverMenu.tsx:37:29
       maxWidth={168}
       minWidth={168}
       content={<Menu items={items} style={{maxWidth: '160px', borderRight: 'none'}} />}
-      onOpenChange={open => {
-        if (!open) {
-          handleClose();
-        }
-      }}
+      onOpenChange={open => {}}
       placement="bottomRight"
       trigger="contextMenu"

[NoCoverage] ConditionalExpression
components/commons/popovers/PopoverMenu.tsx:38:13
       minWidth={168}
       content={<Menu items={items} style={{maxWidth: '160px', borderRight: 'none'}} />}
       onOpenChange={open => {
-        if (!open) {
+        if (true) {
           handleClose();
         }

[NoCoverage] BooleanLiteral
components/commons/popovers/PopoverMenu.tsx:38:13
       minWidth={168}
       content={<Menu items={items} style={{maxWidth: '160px', borderRight: 'none'}} />}
       onOpenChange={open => {
-        if (!open) {
+        if (open) {
           handleClose();
         }

[Survived] ConditionalExpression
components/commons/popovers/PopoverMenu.tsx:44:15
       }}
       placement="bottomRight"
       trigger="contextMenu"
-      isOpen={openPopover && isOpen}
+      isOpen={false}
       handleClose={handleClose}
     >

[Timeout] ConditionalExpression
components/commons/popovers/PopoverMenu.tsx:44:15
       }}
       placement="bottomRight"
       trigger="contextMenu"
-      isOpen={openPopover && isOpen}
+      isOpen={true}
       handleClose={handleClose}
     >
