[NoCoverage] ConditionalExpression
src/helpers/buildSidebarContextMenu.ts:12:84
 import {removeEvent} from '@/models/EventGraphModel';
 import {MenuItem} from '@/types/common';
 
-const isDisabledEditButton = (item: MenuItem): boolean => item.type !== 'TOPIC' && item.type !== 'EVENT' && item.type !== 'HTTP';
+const isDisabledEditButton = (item: MenuItem): boolean => item.type !== 'TOPIC' && true && item.type !== 'HTTP';
 
 export const buildSidebarContextMenu = (item: MenuItem, hiddenItems: string[]) =>

[NoCoverage] ConditionalExpression
src/helpers/buildSidebarContextMenu.ts:12:59
 import {removeEvent} from '@/models/EventGraphModel';
 import {MenuItem} from '@/types/common';
 
-const isDisabledEditButton = (item: MenuItem): boolean => item.type !== 'TOPIC' && item.type !== 'EVENT' && item.type !== 'HTTP';
+const isDisabledEditButton = (item: MenuItem): boolean => true;
 
 export const buildSidebarContextMenu = (item: MenuItem, hiddenItems: string[]) =>
