[NoCoverage] ArrowFunction
src/helpers/buildSidebarHeaderContextMenu.ts:10:32
 import {MenuItem} from '@/types/common';
 
 function isAllItemsHidden(items: MenuItem[], hiddenItems: string[]): boolean {
-  const allItemsId = items.map(item => item.id);
+  const allItemsId = items.map(() => undefined);
   return allItemsId.every(id => hiddenItems.includes(id));
 }

[NoCoverage] ArrowFunction
src/helpers/buildSidebarHeaderContextMenu.ts:11:27
 
 function isAllItemsHidden(items: MenuItem[], hiddenItems: string[]): boolean {
   const allItemsId = items.map(item => item.id);
-  return allItemsId.every(id => hiddenItems.includes(id));
+  return allItemsId.every(() => undefined);
 }
 

[NoCoverage] MethodExpression
src/helpers/buildSidebarHeaderContextMenu.ts:11:10
 
 function isAllItemsHidden(items: MenuItem[], hiddenItems: string[]): boolean {
   const allItemsId = items.map(item => item.id);
-  return allItemsId.every(id => hiddenItems.includes(id));
+  return allItemsId.some(id => hiddenItems.includes(id));
 }
 

[NoCoverage] BooleanLiteral
src/helpers/buildSidebarHeaderContextMenu.ts:14:108
   return allItemsId.every(id => hiddenItems.includes(id));
 }
 
-export const buildSidebarHeaderContextMenu = (items: MenuItem[], hiddenItems: string[], isEvent: boolean = false) =>
+export const buildSidebarHeaderContextMenu = (items: MenuItem[], hiddenItems: string[], isEvent: boolean = true) =>
   ({
     items: [
