[NoCoverage] BlockStatement
src/hooks/useNodePopover.tsx:25:49
   const hiddenItems = useUnit($hiddenItems);
   const expandableItems = useUnit($expandableItems);
 
-  const handleOpenEditTopic = useCallback(() => {
-    openDrawerEditTopic(id);
-    closePopoverMenu();
-  }, [id]);
+  const handleOpenEditTopic = useCallback(() => {}, [id]);
 
   const handleOpenHttpNodeEdit = useCallback(() => {

[NoCoverage] BlockStatement
src/hooks/useNodePopover.tsx:30:52
     closePopoverMenu();
   }, [id]);
 
-  const handleOpenHttpNodeEdit = useCallback(() => {
-    openEditHttpNodeModal(id);
-    closePopoverMenu();
-  }, [id]);
+  const handleOpenHttpNodeEdit = useCallback(() => {}, [id]);
 
   const handleOpenSpecificationEdit = useCallback(() => {

[NoCoverage] BlockStatement
src/hooks/useNodePopover.tsx:35:57
     closePopoverMenu();
   }, [id]);
 
-  const handleOpenSpecificationEdit = useCallback(() => {
-    openSpecificationModal(id);
-    closePopoverMenu();
-  }, [id]);
+  const handleOpenSpecificationEdit = useCallback(() => {}, [id]);
 
   const getFirstPopoverItem = (nodeType: string) => {

[Survived] ConditionalExpression
src/hooks/useNodePopover.tsx:42:7
 
   const getFirstPopoverItem = (nodeType: string) => {
     switch (nodeType) {
-      case 'TOPIC':
-        return {
-          key: 'editTopic',
-          label: 'Edit Topic',
-          onClick: () => handleOpenEditTopic(),
-          icon: <IconEdit />,
-        };
+      case 'TOPIC':
       case 'HTTP':
         return {

[Survived] ConditionalExpression
src/hooks/useNodePopover.tsx:49:7
           onClick: () => handleOpenEditTopic(),
           icon: <IconEdit />,
         };
-      case 'HTTP':
-        return {
-          key: 'editHTTP',
-          label: 'Edit HTTP-node',
-          onClick: () => handleOpenHttpNodeEdit(),
-          icon: <IconEdit />,
-        };
+      case 'HTTP':
       case 'SERVICE':
         return {

[Survived] StringLiteral
src/hooks/useNodePopover.tsx:49:12
           onClick: () => handleOpenEditTopic(),
           icon: <IconEdit />,
         };
-      case 'HTTP':
+      case "":
         return {
           key: 'editHTTP',

[Survived] StringLiteral
src/hooks/useNodePopover.tsx:52:18
       case 'HTTP':
         return {
           key: 'editHTTP',
-          label: 'Edit HTTP-node',
+          label: "",
           onClick: () => handleOpenHttpNodeEdit(),
           icon: <IconEdit />,

[Survived] ConditionalExpression
src/hooks/useNodePopover.tsx:56:7
           onClick: () => handleOpenHttpNodeEdit(),
           icon: <IconEdit />,
         };
-      case 'SERVICE':
-        return {
-          key: 'editService',
-          label: 'Specification',
-          onClick: () => handleOpenSpecificationEdit(),
-          icon: <IconFileCode />,
-        };
+      case 'SERVICE':
       default:
         return null;

[Survived] StringLiteral
src/hooks/useNodePopover.tsx:58:16
         };
       case 'SERVICE':
         return {
-          key: 'editService',
+          key: "",
           label: 'Specification',
           onClick: () => handleOpenSpecificationEdit(),

[Survived] ConditionalExpression
src/hooks/useNodePopover.tsx:69:9
   };
 
   const getExtraPopoverItems = (nodeType: string) => {
-    if (nodeType === NodeDTOTypeEnum.Http) return EMPTY_ARRAY;
+    if (false) return EMPTY_ARRAY;
 
     const baseExtraPopoverItems = [

[Survived] ConditionalExpression
src/hooks/useNodePopover.tsx:69:9
   };
 
   const getExtraPopoverItems = (nodeType: string) => {
-    if (nodeType === NodeDTOTypeEnum.Http) return EMPTY_ARRAY;
+    if (true) return EMPTY_ARRAY;
 
     const baseExtraPopoverItems = [

[Survived] StringLiteral
src/hooks/useNodePopover.tsx:73:14
 
     const baseExtraPopoverItems = [
       {
-        key: 'editEvent',
+        key: "",
         label: 'Edit event',
         onClick: () => {},

[Survived] StringLiteral
src/hooks/useNodePopover.tsx:79:14
         icon: <IconCodeDots />,
       },
       {
-        key: 'testContract',
+        key: "",
         label: 'Test contract',
         onClick: () => {},

[Survived] StringLiteral
src/hooks/useNodePopover.tsx:80:16
       },
       {
         key: 'testContract',
-        label: 'Test contract',
+        label: "",
         onClick: () => {},
         icon: <IconListCheck />,

[Killed] LogicalOperator
src/hooks/useNodePopover.tsx:86:9
       },
     ];
 
-    if (nodeType === NodeDTOTypeEnum.Topic && expandableItems.find(el => el.topicId === id)) {
+    if (nodeType === NodeDTOTypeEnum.Topic || expandableItems.find(el => el.topicId === id)) {
       return [
         ...baseExtraPopoverItems,
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of undefined (reading 'isExpanded')

[Killed] ConditionalExpression
src/hooks/useNodePopover.tsx:86:9
       },
     ];
 
-    if (nodeType === NodeDTOTypeEnum.Topic && expandableItems.find(el => el.topicId === id)) {
+    if (true) {
       return [
         ...baseExtraPopoverItems,
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of undefined (reading 'isExpanded')

[NoCoverage] StringLiteral
src/hooks/useNodePopover.tsx:90:16
       return [
         ...baseExtraPopoverItems,
         {
-          key: 'showEvents',
+          key: "",
           label: expandableItems.find(el => el.topicId === id).isExpanded ? 'Hide events' : 'Show events',
           onClick: expandableItems.find(el => el.topicId === id).isExpanded

[NoCoverage] ConditionalExpression
src/hooks/useNodePopover.tsx:91:45
         ...baseExtraPopoverItems,
         {
           key: 'showEvents',
-          label: expandableItems.find(el => el.topicId === id).isExpanded ? 'Hide events' : 'Show events',
+          label: expandableItems.find(el => false).isExpanded ? 'Hide events' : 'Show events',
           onClick: expandableItems.find(el => el.topicId === id).isExpanded
             ? () => shrinkItemByTopicId(id)

[NoCoverage] EqualityOperator
src/hooks/useNodePopover.tsx:91:45
         ...baseExtraPopoverItems,
         {
           key: 'showEvents',
-          label: expandableItems.find(el => el.topicId === id).isExpanded ? 'Hide events' : 'Show events',
+          label: expandableItems.find(el => el.topicId !== id).isExpanded ? 'Hide events' : 'Show events',
           onClick: expandableItems.find(el => el.topicId === id).isExpanded
             ? () => shrinkItemByTopicId(id)

[NoCoverage] ConditionalExpression
src/hooks/useNodePopover.tsx:92:47
         {
           key: 'showEvents',
           label: expandableItems.find(el => el.topicId === id).isExpanded ? 'Hide events' : 'Show events',
-          onClick: expandableItems.find(el => el.topicId === id).isExpanded
+          onClick: expandableItems.find(el => true).isExpanded
             ? () => shrinkItemByTopicId(id)
             : () => expandItemByTopicId(id),

[NoCoverage] EqualityOperator
src/hooks/useNodePopover.tsx:92:47
         {
           key: 'showEvents',
           label: expandableItems.find(el => el.topicId === id).isExpanded ? 'Hide events' : 'Show events',
-          onClick: expandableItems.find(el => el.topicId === id).isExpanded
+          onClick: expandableItems.find(el => el.topicId !== id).isExpanded
             ? () => shrinkItemByTopicId(id)
             : () => expandItemByTopicId(id),

[NoCoverage] ArrowFunction
src/hooks/useNodePopover.tsx:95:38
           onClick: expandableItems.find(el => el.topicId === id).isExpanded
             ? () => shrinkItemByTopicId(id)
             : () => expandItemByTopicId(id),
-          icon: expandableItems.find(el => el.topicId === id).isExpanded ? <SchemaOff /> : <Schema />,
+          icon: expandableItems.find(() => undefined).isExpanded ? <SchemaOff /> : <Schema />,
         },
       ];

[NoCoverage] ConditionalExpression
src/hooks/useNodePopover.tsx:95:44
           onClick: expandableItems.find(el => el.topicId === id).isExpanded
             ? () => shrinkItemByTopicId(id)
             : () => expandItemByTopicId(id),
-          icon: expandableItems.find(el => el.topicId === id).isExpanded ? <SchemaOff /> : <Schema />,
+          icon: expandableItems.find(el => false).isExpanded ? <SchemaOff /> : <Schema />,
         },
       ];

[Survived] StringLiteral
src/hooks/useNodePopover.tsx:113:12
     },
     ...getExtraPopoverItems(data.nodeType),
     {
-      key: 'delete',
+      key: "",
       label: 'Delete',
       onClick: () => openDeleteSelectedItemsModal([id]),

[NoCoverage] ArrayDeclaration
src/hooks/useNodePopover.tsx:115:51
     {
       key: 'delete',
       label: 'Delete',
-      onClick: () => openDeleteSelectedItemsModal([id]),
+      onClick: () => openDeleteSelectedItemsModal([]),
       icon: <IconTrash />,
     },
