[NoCoverage] BlockStatement
src/helpers/electron/handleReloadApp.ts:8:69
  * @param {BrowserWindow} mainWindow - Основное окно браузера Electron, содержимое которого будет перезагружено.
  * @returns {void}
  */
-export const handleReloadApp = (mainWindow: BrowserWindow): void => {
-  mainWindow.webContents.reload();
-};
+export const handleReloadApp = (mainWindow: BrowserWindow): void => {};
 
