[NoCoverage] ArrowFunction
src/components/layout/Layout.tsx:6:50
 
 import {Header} from '@/components/layout/header/Header';
 
-export const Layout: FC<{children: ReactNode}> = ({children}: {children: ReactNode}) => (
-  <UIKitLayout data-testid="layout">
-    <Header />
-    <Content className="flex h-full min-w-full flex-col">{children}</Content>
-  </UIKitLayout>
-);
+export const Layout: FC<{children: ReactNode}> = () => undefined;
 
