[Survived] EqualityOperator
src/hooks/useEdgeSelection.tsx:24:26
   const selectedItems = useUnit($selectedItems);
   const drawerEditLink = useUnit($drawerEditLink);
 
-  const isEdgeSelected = drawerEditLink.linkId === id || selectedItems.includes(id);
+  const isEdgeSelected = drawerEditLink.linkId !== id || selectedItems.includes(id);
 
   const handleEdgeDoubleClick = useCallback(() => {

[Survived] ConditionalExpression
src/hooks/useEdgeSelection.tsx:24:26
   const selectedItems = useUnit($selectedItems);
   const drawerEditLink = useUnit($drawerEditLink);
 
-  const isEdgeSelected = drawerEditLink.linkId === id || selectedItems.includes(id);
+  const isEdgeSelected = true;
 
   const handleEdgeDoubleClick = useCallback(() => {

[NoCoverage] BlockStatement
src/hooks/useEdgeSelection.tsx:26:51
 
   const isEdgeSelected = drawerEditLink.linkId === id || selectedItems.includes(id);
 
-  const handleEdgeDoubleClick = useCallback(() => {
-    openDrawerEditLink(id);
-  }, [id]);
+  const handleEdgeDoubleClick = useCallback(() => {}, [id]);
 
   const handleEdgeSelect = useCallback(

[NoCoverage] BlockStatement
src/hooks/useEdgeSelection.tsx:31:34
   }, [id]);
 
   const handleEdgeSelect = useCallback(
-    (event: React.MouseEvent) => {
-      if (event?.ctrlKey || event?.shiftKey) {
-        addMultipleSelection(id);
-      } else {
-        toggleItemSelection(id);
-      }
-    },
+    (event: React.MouseEvent) => {},
     [id]
   );

[NoCoverage] ConditionalExpression
src/hooks/useEdgeSelection.tsx:32:11
 
   const handleEdgeSelect = useCallback(
     (event: React.MouseEvent) => {
-      if (event?.ctrlKey || event?.shiftKey) {
+      if (false) {
         addMultipleSelection(id);
       } else {
