[Survived] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelModal.tsx:26:23
   const filterTags = useUnit($filterTags);
 
   const {isOpen, itemId} = infoPanelModal;
-  const showContent = isOpen && eventGraph && itemId;
+  const showContent = true;
 
   if (!showContent) return;

[Survived] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelModal.tsx:26:23
   const filterTags = useUnit($filterTags);
 
   const {isOpen, itemId} = infoPanelModal;
-  const showContent = isOpen && eventGraph && itemId;
+  const showContent = true && itemId;
 
   if (!showContent) return;

[Survived] BooleanLiteral
diagram/modals/info-panel-modal/InfoPanelModal.tsx:28:7
   const {isOpen, itemId} = infoPanelModal;
   const showContent = isOpen && eventGraph && itemId;
 
-  if (!showContent) return;
+  if (showContent) return;
 
   const nodes = eventGraph.nodes || [];

[Survived] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelModal.tsx:28:7
   const {isOpen, itemId} = infoPanelModal;
   const showContent = isOpen && eventGraph && itemId;
 
-  if (!showContent) return;
+  if (true) return;
 
   const nodes = eventGraph.nodes || [];

[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelModal.tsx:33:42
   const nodes = eventGraph.nodes || [];
   const links = eventGraph.links || [];
   const events = eventGraph.events || [];
-  const currentItem = nodes.find(item => item && item.id === itemId);
+  const currentItem = nodes.find(item => false);
   const icon = (currentItem?.brokerType && IconMap[currentItem?.brokerType]) ||
     (currentItem?.type && IconMap[currentItem.type]) || <IconServerCog size={16} />;

[NoCoverage] EqualityOperator
diagram/modals/info-panel-modal/InfoPanelModal.tsx:33:50
   const nodes = eventGraph.nodes || [];
   const links = eventGraph.links || [];
   const events = eventGraph.events || [];
-  const currentItem = nodes.find(item => item && item.id === itemId);
+  const currentItem = nodes.find(item => item && item.id !== itemId);
   const icon = (currentItem?.brokerType && IconMap[currentItem?.brokerType]) ||
     (currentItem?.type && IconMap[currentItem.type]) || <IconServerCog size={16} />;

[NoCoverage] LogicalOperator
diagram/modals/info-panel-modal/InfoPanelModal.tsx:34:17
   const links = eventGraph.links || [];
   const events = eventGraph.events || [];
   const currentItem = nodes.find(item => item && item.id === itemId);
-  const icon = (currentItem?.brokerType && IconMap[currentItem?.brokerType]) ||
+  const icon = (currentItem?.brokerType || IconMap[currentItem?.brokerType]) ||
     (currentItem?.type && IconMap[currentItem.type]) || <IconServerCog size={16} />;
 

[NoCoverage] LogicalOperator
diagram/modals/info-panel-modal/InfoPanelModal.tsx:34:16
   const links = eventGraph.links || [];
   const events = eventGraph.events || [];
   const currentItem = nodes.find(item => item && item.id === itemId);
-  const icon = (currentItem?.brokerType && IconMap[currentItem?.brokerType]) ||
-    (currentItem?.type && IconMap[currentItem.type]) || <IconServerCog size={16} />;
+  const icon = currentItem?.brokerType && IconMap[currentItem?.brokerType] && currentItem?.type && IconMap[currentItem.type] || <IconServerCog size={16} />;
 
   const {consumingData, producingData} = getInfoPanelData(currentItem?.id, links, nodes, events);

[NoCoverage] LogicalOperator
diagram/modals/info-panel-modal/InfoPanelModal.tsx:35:6
   const events = eventGraph.events || [];
   const currentItem = nodes.find(item => item && item.id === itemId);
   const icon = (currentItem?.brokerType && IconMap[currentItem?.brokerType]) ||
-    (currentItem?.type && IconMap[currentItem.type]) || <IconServerCog size={16} />;
+    (currentItem?.type || IconMap[currentItem.type]) || <IconServerCog size={16} />;
 
   const {consumingData, producingData} = getInfoPanelData(currentItem?.id, links, nodes, events);

[NoCoverage] OptionalChaining
diagram/modals/info-panel-modal/InfoPanelModal.tsx:35:6
   const events = eventGraph.events || [];
   const currentItem = nodes.find(item => item && item.id === itemId);
   const icon = (currentItem?.brokerType && IconMap[currentItem?.brokerType]) ||
-    (currentItem?.type && IconMap[currentItem.type]) || <IconServerCog size={16} />;
+    (currentItem.type && IconMap[currentItem.type]) || <IconServerCog size={16} />;
 
   const {consumingData, producingData} = getInfoPanelData(currentItem?.id, links, nodes, events);

[NoCoverage] OptionalChaining
diagram/modals/info-panel-modal/InfoPanelModal.tsx:37:59
   const icon = (currentItem?.brokerType && IconMap[currentItem?.brokerType]) ||
     (currentItem?.type && IconMap[currentItem.type]) || <IconServerCog size={16} />;
 
-  const {consumingData, producingData} = getInfoPanelData(currentItem?.id, links, nodes, events);
+  const {consumingData, producingData} = getInfoPanelData(currentItem.id, links, nodes, events);
 
   const handleClose = () => {

[NoCoverage] BlockStatement
diagram/modals/info-panel-modal/InfoPanelModal.tsx:39:29
 
   const {consumingData, producingData} = getInfoPanelData(currentItem?.id, links, nodes, events);
 
-  const handleClose = () => {
-    closeInfoPanelModal();
-  };
+  const handleClose = () => {};
 
   const handleChangeTag = (tag: string) => {

[NoCoverage] BlockStatement
diagram/modals/info-panel-modal/InfoPanelModal.tsx:43:44
     closeInfoPanelModal();
   };
 
-  const handleChangeTag = (tag: string) => {
-    if (filterTags.includes(tag)) {
-      removeTagFromFilter(tag);
-    } else {
-      addTagToFilter(tag);
-    }
-  };
+  const handleChangeTag = (tag: string) => {};
 
   return (

[NoCoverage] BlockStatement
diagram/modals/info-panel-modal/InfoPanelModal.tsx:44:35
   };
 
   const handleChangeTag = (tag: string) => {
-    if (filterTags.includes(tag)) {
-      removeTagFromFilter(tag);
-    } else {
+    if (filterTags.includes(tag)) {} else {
       addTagToFilter(tag);
     }

[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelModal.tsx:44:9
   };
 
   const handleChangeTag = (tag: string) => {
-    if (filterTags.includes(tag)) {
+    if (true) {
       removeTagFromFilter(tag);
     } else {

[NoCoverage] BlockStatement
diagram/modals/info-panel-modal/InfoPanelModal.tsx:46:12
   const handleChangeTag = (tag: string) => {
     if (filterTags.includes(tag)) {
       removeTagFromFilter(tag);
-    } else {
-      addTagToFilter(tag);
-    }
+    } else {}
   };
 

[NoCoverage] BooleanLiteral
diagram/modals/info-panel-modal/InfoPanelModal.tsx:61:13
       isOpen={isOpen}
       afterClose={handleClose}
       closable
-      mask={false}
+      mask={true}
       onOk={handleClose}
       onCancel={handleClose}

[NoCoverage] ObjectLiteral
diagram/modals/info-panel-modal/InfoPanelModal.tsx:64:19
       mask={false}
       onOk={handleClose}
       onCancel={handleClose}
-      classNames={{
-        // @ts-ignore
-        content: 'pt-10 px-6 pb-8 h-full',
-        header: 'm-0',
-        footer: 'm-0',
-      }}
+      classNames={{}}
     >
       <div className={clsx('flex flex-col gap-5')}>

[NoCoverage] StringLiteral
diagram/modals/info-panel-modal/InfoPanelModal.tsx:71:28
         footer: 'm-0',
       }}
     >
-      <div className={clsx('flex flex-col gap-5')}>
+      <div className={clsx("")}>
         <div className="heading-4 flex flex-row items-center gap-1">
           <Icon icon={icon} size={20} />

[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelModal.tsx:74:78
       <div className={clsx('flex flex-col gap-5')}>
         <div className="heading-4 flex flex-row items-center gap-1">
           <Icon icon={icon} size={20} />
-          <span className="overflow-hidden text-ellipsis whitespace-nowrap">{currentItem && currentItem.name}</span>
+          <span className="overflow-hidden text-ellipsis whitespace-nowrap">{true}</span>
         </div>
 

[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelModal.tsx:74:78
       <div className={clsx('flex flex-col gap-5')}>
         <div className="heading-4 flex flex-row items-center gap-1">
           <Icon icon={icon} size={20} />
-          <span className="overflow-hidden text-ellipsis whitespace-nowrap">{currentItem && currentItem.name}</span>
+          <span className="overflow-hidden text-ellipsis whitespace-nowrap">{false}</span>
         </div>
 

[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelModal.tsx:77:10
           <span className="overflow-hidden text-ellipsis whitespace-nowrap">{currentItem && currentItem.name}</span>
         </div>
 
-        {currentItem?.tags && (
-          <div className="flex flex-wrap gap-2">
-            {currentItem?.tags.map(tag => (
-              <Tag
-                className="m-0"
-                key={tag}
-                isCheckable
-                isChecked={filterTags.includes(tag)}
-                onCheck={() => handleChangeTag(tag)}
-              >
-                {tag}
-              </Tag>
-            ))}
-          </div>
-        )}
+        {false}
 
         {!consumingData.length && !producingData.length ? <InfoPanelNoEventsStub /> : null}

[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelModal.tsx:77:10
           <span className="overflow-hidden text-ellipsis whitespace-nowrap">{currentItem && currentItem.name}</span>
         </div>
 
-        {currentItem?.tags && (
-          <div className="flex flex-wrap gap-2">
-            {currentItem?.tags.map(tag => (
-              <Tag
-                className="m-0"
-                key={tag}
-                isCheckable
-                isChecked={filterTags.includes(tag)}
-                onCheck={() => handleChangeTag(tag)}
-              >
-                {tag}
-              </Tag>
-            ))}
-          </div>
-        )}
+        {true}
 
         {!consumingData.length && !producingData.length ? <InfoPanelNoEventsStub /> : null}

[NoCoverage] OptionalChaining
diagram/modals/info-panel-modal/InfoPanelModal.tsx:79:14
 
         {currentItem?.tags && (
           <div className="flex flex-wrap gap-2">
-            {currentItem?.tags.map(tag => (
+            {currentItem.tags.map(tag => (
               <Tag
                 className="m-0"

[NoCoverage] ArrowFunction
diagram/modals/info-panel-modal/InfoPanelModal.tsx:79:36
 
         {currentItem?.tags && (
           <div className="flex flex-wrap gap-2">
-            {currentItem?.tags.map(tag => (
-              <Tag
-                className="m-0"
-                key={tag}
-                isCheckable
-                isChecked={filterTags.includes(tag)}
-                onCheck={() => handleChangeTag(tag)}
-              >
-                {tag}
-              </Tag>
-            ))}
+            {currentItem?.tags.map(() => undefined)}
           </div>
         )}

[NoCoverage] ArrowFunction
diagram/modals/info-panel-modal/InfoPanelModal.tsx:85:26
                 key={tag}
                 isCheckable
                 isChecked={filterTags.includes(tag)}
-                onCheck={() => handleChangeTag(tag)}
+                onCheck={() => undefined}
               >
                 {tag}

[NoCoverage] LogicalOperator
diagram/modals/info-panel-modal/InfoPanelModal.tsx:93:10
           </div>
         )}
 
-        {!consumingData.length && !producingData.length ? <InfoPanelNoEventsStub /> : null}
+        {!consumingData.length || !producingData.length ? <InfoPanelNoEventsStub /> : null}
 
         {/* 264px - отступ сверху (176px), отступ (20px), заголовок модалки (28px), padding (40px) */}

[NoCoverage] ConditionalExpression
diagram/modals/info-panel-modal/InfoPanelModal.tsx:93:10
           </div>
         )}
 
-        {!consumingData.length && !producingData.length ? <InfoPanelNoEventsStub /> : null}
+        {true ? <InfoPanelNoEventsStub /> : null}
 
         {/* 264px - отступ сверху (176px), отступ (20px), заголовок модалки (28px), padding (40px) */}

[NoCoverage] StringLiteral
diagram/modals/info-panel-modal/InfoPanelModal.tsx:96:30
         {!consumingData.length && !producingData.length ? <InfoPanelNoEventsStub /> : null}
 
         {/* 264px - отступ сверху (176px), отступ (20px), заголовок модалки (28px), padding (40px) */}
-        <div className={clsx('flex flex-col gap-8', 'scrollbar max-h-[calc(90vh-264px)] overflow-y-auto')}>
+        <div className={clsx("", 'scrollbar max-h-[calc(90vh-264px)] overflow-y-auto')}>
           {consumingData.length ? (
             <div className="flex flex-col gap-4">
