[NoCoverage] BlockStatement
src/helpers/reload-app.ts:5:38
  * Перезагружает приложение через вызов метода `reloadApp` в electronAPI
  * @returns {void}
  */
-export const reloadApp = (): void => {
-  window.electronAPI.reloadApp();
-};
+export const reloadApp = (): void => {};
 
