[NoCoverage] BlockStatement
src/helpers/download-file.ts:4:54
 import {TDownloadItem} from '@/types/common';
 
 // For single file download
-export const downloadFile = (file: TDownloadItem) => {
-  window.electronAPI.downloadFile(file);
-};
+export const downloadFile = (file: TDownloadItem) => {};
 
 // For multiple files download

[NoCoverage] BlockStatement
src/helpers/download-file.ts:9:58
 };
 
 // For multiple files download
-export const downloadFiles = (files: TDownloadItem[]) => {
-  window.electronAPI.downloadFiles(files);
-};
+export const downloadFiles = (files: TDownloadItem[]) => {};
 
