[Survived] BlockStatement
src/hooks/useSingleAndDoubleClick.tsx:11:19
   const [click, setClick] = useState(0);
   const [lastEvent, setLastEvent] = useState<React.MouseEvent | null>(null);
 
-  useEffect(() => {
-    const timer = setTimeout(() => {
-      if (click === 1) {
-        actionSimpleClick(lastEvent || undefined);
-      }
-      setClick(0);
-      setLastEvent(null);
-    }, delay);
-
-    if (click === 2) {
-      actionDoubleClick(lastEvent || undefined);
-      setLastEvent(null);
-    }
-
-    return () => clearTimeout(timer);
-  }, [actionDoubleClick, actionSimpleClick, click, delay, lastEvent]);
+  useEffect(() => {}, [actionDoubleClick, actionSimpleClick, click, delay, lastEvent]);
 
   return (event?: React.MouseEvent) => {

[NoCoverage] BlockStatement
src/hooks/useSingleAndDoubleClick.tsx:12:36
   const [lastEvent, setLastEvent] = useState<React.MouseEvent | null>(null);
 
   useEffect(() => {
-    const timer = setTimeout(() => {
-      if (click === 1) {
-        actionSimpleClick(lastEvent || undefined);
-      }
-      setClick(0);
-      setLastEvent(null);
-    }, delay);
+    const timer = setTimeout(() => {}, delay);
 
     if (click === 2) {

[NoCoverage] BlockStatement
src/hooks/useSingleAndDoubleClick.tsx:13:24
 
   useEffect(() => {
     const timer = setTimeout(() => {
-      if (click === 1) {
-        actionSimpleClick(lastEvent || undefined);
-      }
+      if (click === 1) {}
       setClick(0);
       setLastEvent(null);

[NoCoverage] ConditionalExpression
src/hooks/useSingleAndDoubleClick.tsx:13:11
 
   useEffect(() => {
     const timer = setTimeout(() => {
-      if (click === 1) {
+      if (false) {
         actionSimpleClick(lastEvent || undefined);
       }

[NoCoverage] LogicalOperator
src/hooks/useSingleAndDoubleClick.tsx:14:27
   useEffect(() => {
     const timer = setTimeout(() => {
       if (click === 1) {
-        actionSimpleClick(lastEvent || undefined);
+        actionSimpleClick(lastEvent && undefined);
       }
       setClick(0);

[Survived] ConditionalExpression
src/hooks/useSingleAndDoubleClick.tsx:20:9
       setLastEvent(null);
     }, delay);
 
-    if (click === 2) {
+    if (false) {
       actionDoubleClick(lastEvent || undefined);
       setLastEvent(null);

[NoCoverage] BlockStatement
src/hooks/useSingleAndDoubleClick.tsx:20:22
       setLastEvent(null);
     }, delay);
 
-    if (click === 2) {
-      actionDoubleClick(lastEvent || undefined);
-      setLastEvent(null);
-    }
+    if (click === 2) {}
 
     return () => clearTimeout(timer);

[NoCoverage] LogicalOperator
src/hooks/useSingleAndDoubleClick.tsx:21:25
     }, delay);
 
     if (click === 2) {
-      actionDoubleClick(lastEvent || undefined);
+      actionDoubleClick(lastEvent && undefined);
       setLastEvent(null);
     }

[Survived] BlockStatement
src/hooks/useSingleAndDoubleClick.tsx:28:40
     return () => clearTimeout(timer);
   }, [actionDoubleClick, actionSimpleClick, click, delay, lastEvent]);
 
-  return (event?: React.MouseEvent) => {
-    setLastEvent(event || null);
-    setClick(prev => prev + 1);
-  };
+  return (event?: React.MouseEvent) => {};
 };
 

[Survived] LogicalOperator
src/hooks/useSingleAndDoubleClick.tsx:29:18
   }, [actionDoubleClick, actionSimpleClick, click, delay, lastEvent]);
 
   return (event?: React.MouseEvent) => {
-    setLastEvent(event || null);
+    setLastEvent(event && null);
     setClick(prev => prev + 1);
   };

[Survived] ArithmeticOperator
src/hooks/useSingleAndDoubleClick.tsx:30:22
 
   return (event?: React.MouseEvent) => {
     setLastEvent(event || null);
-    setClick(prev => prev + 1);
+    setClick(prev => prev - 1);
   };
 };

[Survived] ArrowFunction
src/hooks/useSingleAndDoubleClick.tsx:30:14
 
   return (event?: React.MouseEvent) => {
     setLastEvent(event || null);
-    setClick(prev => prev + 1);
+    setClick(() => undefined);
   };
 };
