[NoCoverage] ConditionalExpression
src/index.ts:22:5
 let childPid: number;
 
 // Handle creating/removing shortcuts on Windows when installing/uninstalling.
-if (electronSquirrelStartup) app.quit();
+if (false) app.quit();
 
 const createWindow = (): void => {

[NoCoverage] ConditionalExpression
src/index.ts:22:5
 let childPid: number;
 
 // Handle creating/removing shortcuts on Windows when installing/uninstalling.
-if (electronSquirrelStartup) app.quit();
+if (true) app.quit();
 
 const createWindow = (): void => {

[NoCoverage] ConditionalExpression
src/index.ts:26:21
 
 const createWindow = (): void => {
   // Determine if the app is running in development mode or test mode
-  const isDevMode = process.env.NODE_ENV === 'development';
+  const isDevMode = true;
 
   // Create the browser window.

[NoCoverage] EqualityOperator
src/index.ts:26:21
 
 const createWindow = (): void => {
   // Determine if the app is running in development mode or test mode
-  const isDevMode = process.env.NODE_ENV === 'development';
+  const isDevMode = process.env.NODE_ENV !== 'development';
 
   // Create the browser window.

[NoCoverage] ObjectLiteral
src/index.ts:32:21
   const mainWindow = new BrowserWindow({
     height: 768,
     width: 1024,
-    webPreferences: {
-      preload: MAIN_WINDOW_PRELOAD_WEBPACK_ENTRY,
-      nodeIntegration: false,
-      contextIsolation: true,
-      defaultEncoding: 'UTF-8',
-    },
+    webPreferences: {},
     title: 'AxenApi',
     icon: path.resolve(__dirname, '/src/assets/logo.png'),

[NoCoverage] BooleanLiteral
src/index.ts:34:24
     width: 1024,
     webPreferences: {
       preload: MAIN_WINDOW_PRELOAD_WEBPACK_ENTRY,
-      nodeIntegration: false,
+      nodeIntegration: true,
       contextIsolation: true,
       defaultEncoding: 'UTF-8',

[NoCoverage] BooleanLiteral
src/index.ts:35:25
     webPreferences: {
       preload: MAIN_WINDOW_PRELOAD_WEBPACK_ENTRY,
       nodeIntegration: false,
-      contextIsolation: true,
+      contextIsolation: false,
       defaultEncoding: 'UTF-8',
     },

[NoCoverage] ConditionalExpression
src/index.ts:47:7
   mainWindow.loadURL(MAIN_WINDOW_WEBPACK_ENTRY);
 
   // Open DevTools only when running in development mode
-  if (isDevMode) mainWindow.webContents.openDevTools();
+  if (true) mainWindow.webContents.openDevTools();
 
   ipcMain.on('download', async (event, downloads) => {

[NoCoverage] ConditionalExpression
src/index.ts:47:7
   mainWindow.loadURL(MAIN_WINDOW_WEBPACK_ENTRY);
 
   // Open DevTools only when running in development mode
-  if (isDevMode) mainWindow.webContents.openDevTools();
+  if (false) mainWindow.webContents.openDevTools();
 
   ipcMain.on('download', async (event, downloads) => {

[NoCoverage] BlockStatement
src/index.ts:49:54
   // Open DevTools only when running in development mode
   if (isDevMode) mainWindow.webContents.openDevTools();
 
-  ipcMain.on('download', async (event, downloads) => {
-    try {
-      await handleDownload(event, downloads);
-    } catch (error) {
-      console.error('Download failed:', error);
-    }
-  });
+  ipcMain.on('download', async (event, downloads) => {});
 
   ipcMain.on('reload-app', () => {

[NoCoverage] StringLiteral
src/index.ts:49:14
   // Open DevTools only when running in development mode
   if (isDevMode) mainWindow.webContents.openDevTools();
 
-  ipcMain.on('download', async (event, downloads) => {
+  ipcMain.on("", async (event, downloads) => {
     try {
       await handleDownload(event, downloads);

[NoCoverage] BlockStatement
src/index.ts:50:9
   if (isDevMode) mainWindow.webContents.openDevTools();
 
   ipcMain.on('download', async (event, downloads) => {
-    try {
-      await handleDownload(event, downloads);
-    } catch (error) {
+    try {} catch (error) {
       console.error('Download failed:', error);
     }

[NoCoverage] BlockStatement
src/index.ts:52:21
   ipcMain.on('download', async (event, downloads) => {
     try {
       await handleDownload(event, downloads);
-    } catch (error) {
-      console.error('Download failed:', error);
-    }
+    } catch (error) {}
   });
 

[NoCoverage] BlockStatement
src/index.ts:57:34
     }
   });
 
-  ipcMain.on('reload-app', () => {
-    if (mainWindow) {
-      handleReloadApp(mainWindow);
-    }
-  });
+  ipcMain.on('reload-app', () => {});
 };
 

[NoCoverage] BlockStatement
src/index.ts:58:21
   });
 
   ipcMain.on('reload-app', () => {
-    if (mainWindow) {
-      handleReloadApp(mainWindow);
-    }
+    if (mainWindow) {}
   });
 };

[NoCoverage] ConditionalExpression
src/index.ts:58:9
   });
 
   ipcMain.on('reload-app', () => {
-    if (mainWindow) {
+    if (true) {
       handleReloadApp(mainWindow);
     }

[NoCoverage] BlockStatement
src/index.ts:68:7
 // initialization and is ready to create browser windows.
 // Some APIs can only be used after this event occurs.
 app.whenReady().then(async () => {
-  try {
-    await checkJavaVersion();
-  } catch (error) {
+  try {} catch (error) {
     const message = getJavaErrorMessage(error);
     const options: MessageBoxOptions = {

[NoCoverage] BlockStatement
src/index.ts:70:19
 app.whenReady().then(async () => {
   try {
     await checkJavaVersion();
-  } catch (error) {
-    const message = getJavaErrorMessage(error);
-    const options: MessageBoxOptions = {
-      title: 'Error',
-      detail: message,
-      type: 'question',
-      buttons: ['Restart', 'Quit'],
-      defaultId: 0,
-      message,
-    };
-    const response = dialog.showMessageBox(options);
-
-    if ((await response).response === 0) {
-      app.relaunch();
-      app.exit(0);
-    } else {
-      app.quit();
-    }
-  }
+  } catch (error) {}
 
   createWindow();

[NoCoverage] StringLiteral
src/index.ts:76:28
       title: 'Error',
       detail: message,
       type: 'question',
-      buttons: ['Restart', 'Quit'],
+      buttons: ['Restart', ""],
       defaultId: 0,
       message,

[NoCoverage] ConditionalExpression
src/index.ts:82:9
     };
     const response = dialog.showMessageBox(options);
 
-    if ((await response).response === 0) {
+    if (true) {
       app.relaunch();
       app.exit(0);

[NoCoverage] ConditionalExpression
src/index.ts:82:9
     };
     const response = dialog.showMessageBox(options);
 
-    if ((await response).response === 0) {
+    if (false) {
       app.relaunch();
       app.exit(0);

[NoCoverage] BlockStatement
src/index.ts:85:12
     if ((await response).response === 0) {
       app.relaunch();
       app.exit(0);
-    } else {
-      app.quit();
-    }
+    } else {}
   }
 

[NoCoverage] StringLiteral
src/index.ts:92:39
 
   createWindow();
 
-  const childProcess = spawn('java', ['-jar', getJarPath()]);
+  const childProcess = spawn('java', ["", getJarPath()]);
   childPid = childProcess.pid;
 

[NoCoverage] BlockStatement
src/index.ts:95:34
   const childProcess = spawn('java', ['-jar', getJarPath()]);
   childPid = childProcess.pid;
 
-  childProcess.on('spawn', () => {
-    console.log(`Process started with PID: ${childPid}`);
-  });
+  childProcess.on('spawn', () => {});
 
   childProcess.stderr.on('data', data => {

[NoCoverage] BlockStatement
src/index.ts:99:42
     console.log(`Process started with PID: ${childPid}`);
   });
 
-  childProcess.stderr.on('data', data => {
-    coreErrorLogger.info(`\n${data}`);
-  });
+  childProcess.stderr.on('data', data => {});
 
   childProcess.on('exit', code => {

[NoCoverage] BlockStatement
src/index.ts:103:35
     coreErrorLogger.info(`\n${data}`);
   });
 
-  childProcess.on('exit', code => {
-    appExitLogger.info(`Child process exited with code: ${code}`);
-  });
+  childProcess.on('exit', code => {});
 
   childProcess.stdout.on('data', data => {

[NoCoverage] StringLiteral
src/index.ts:103:19
     coreErrorLogger.info(`\n${data}`);
   });
 
-  childProcess.on('exit', code => {
+  childProcess.on("", code => {
     appExitLogger.info(`Child process exited with code: ${code}`);
   });

[NoCoverage] BlockStatement
src/index.ts:107:42
     appExitLogger.info(`Child process exited with code: ${code}`);
   });
 
-  childProcess.stdout.on('data', data => {
-    coreLogger.info(`\n${data}`);
-  });
+  childProcess.stdout.on('data', data => {});
 
   app.on('activate', () => {

[NoCoverage] StringLiteral
src/index.ts:108:21
   });
 
   childProcess.stdout.on('data', data => {
-    coreLogger.info(`\n${data}`);
+    coreLogger.info(``);
   });
 

[NoCoverage] BlockStatement
src/index.ts:111:28
     coreLogger.info(`\n${data}`);
   });
 
-  app.on('activate', () => {
-    // On OS X it's common to re-create a window in the app when the
-    // dock icon is clicked and there are no other windows open.
-    if (BrowserWindow.getAllWindows().length === 0) createWindow();
-  });
+  app.on('activate', () => {});
 });
 

[NoCoverage] EqualityOperator
src/index.ts:114:9
   app.on('activate', () => {
     // On OS X it's common to re-create a window in the app when the
     // dock icon is clicked and there are no other windows open.
-    if (BrowserWindow.getAllWindows().length === 0) createWindow();
+    if (BrowserWindow.getAllWindows().length !== 0) createWindow();
   });
 });

[NoCoverage] ConditionalExpression
src/index.ts:114:9
   app.on('activate', () => {
     // On OS X it's common to re-create a window in the app when the
     // dock icon is clicked and there are no other windows open.
-    if (BrowserWindow.getAllWindows().length === 0) createWindow();
+    if (true) createWindow();
   });
 });

[NoCoverage] BlockStatement
src/index.ts:118:27
   });
 });
 
-app.on('will-quit', () => {
-  killProcess(childPid);
-});
+app.on('will-quit', () => {});
 
 app.on('before-quit', () => {

[NoCoverage] BlockStatement
src/index.ts:122:29
   killProcess(childPid);
 });
 
-app.on('before-quit', () => {
-  killProcess(childPid);
-});
+app.on('before-quit', () => {});
 
 app.on('window-all-closed', () => {

[NoCoverage] BlockStatement
src/index.ts:126:35
   killProcess(childPid);
 });
 
-app.on('window-all-closed', () => {
-  killProcess(childPid);
-
-  if (process.platform !== 'darwin') app.quit();
-});
+app.on('window-all-closed', () => {});
 

[NoCoverage] ConditionalExpression
src/index.ts:129:7
 app.on('window-all-closed', () => {
   killProcess(childPid);
 
-  if (process.platform !== 'darwin') app.quit();
+  if (false) app.quit();
 });
 

[NoCoverage] ConditionalExpression
src/index.ts:129:7
 app.on('window-all-closed', () => {
   killProcess(childPid);
 
-  if (process.platform !== 'darwin') app.quit();
+  if (true) app.quit();
 });
 
