[NoCoverage] BlockStatement
commons/diagram/buttons/ImportFileButton.tsx:11:59
   const [fileList, setFileList] = useState<NFileInput.TUploadFile[]>([]);
 
   /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
-  const handleCustomRequest = ({file, onSuccess}: any) => {
-    if (onSuccess) {
-      onSuccess('File added successfully', file);
-    }
-  };
+  const handleCustomRequest = ({file, onSuccess}: any) => {};
 
   const handleOnChange = ({fileList: newFileList}: NFileInput.TUploadChangeParam) => {

[NoCoverage] BlockStatement
commons/diagram/buttons/ImportFileButton.tsx:12:20
 
   /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
   const handleCustomRequest = ({file, onSuccess}: any) => {
-    if (onSuccess) {
-      onSuccess('File added successfully', file);
-    }
+    if (onSuccess) {}
   };
 

[NoCoverage] ConditionalExpression
commons/diagram/buttons/ImportFileButton.tsx:12:9
 
   /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
   const handleCustomRequest = ({file, onSuccess}: any) => {
-    if (onSuccess) {
+    if (false) {
       onSuccess('File added successfully', file);
     }

[NoCoverage] StringLiteral
commons/diagram/buttons/ImportFileButton.tsx:13:17
   /* eslint-disable-next-line @typescript-eslint/no-explicit-any */
   const handleCustomRequest = ({file, onSuccess}: any) => {
     if (onSuccess) {
-      onSuccess('File added successfully', file);
+      onSuccess("", file);
     }
   };

[NoCoverage] BlockStatement
commons/diagram/buttons/ImportFileButton.tsx:17:86
     }
   };
 
-  const handleOnChange = ({fileList: newFileList}: NFileInput.TUploadChangeParam) => {
-    setFileList([...newFileList]);
-
-    const allFilesSelected = newFileList.every(file => file.status === 'done');
-
-    if (allFilesSelected) {
-      fetchEventGraphDataFx({fileList}).finally(() => {
-        setFileList([]);
-      });
-    }
-  };
+  const handleOnChange = ({fileList: newFileList}: NFileInput.TUploadChangeParam) => {};
 
   return (

[NoCoverage] ArrayDeclaration
commons/diagram/buttons/ImportFileButton.tsx:18:17
   };
 
   const handleOnChange = ({fileList: newFileList}: NFileInput.TUploadChangeParam) => {
-    setFileList([...newFileList]);
+    setFileList([]);
 
     const allFilesSelected = newFileList.every(file => file.status === 'done');

[NoCoverage] ConditionalExpression
commons/diagram/buttons/ImportFileButton.tsx:20:56
   const handleOnChange = ({fileList: newFileList}: NFileInput.TUploadChangeParam) => {
     setFileList([...newFileList]);
 
-    const allFilesSelected = newFileList.every(file => file.status === 'done');
+    const allFilesSelected = newFileList.every(file => true);
 
     if (allFilesSelected) {

[NoCoverage] MethodExpression
commons/diagram/buttons/ImportFileButton.tsx:20:30
   const handleOnChange = ({fileList: newFileList}: NFileInput.TUploadChangeParam) => {
     setFileList([...newFileList]);
 
-    const allFilesSelected = newFileList.every(file => file.status === 'done');
+    const allFilesSelected = newFileList.some(file => file.status === 'done');
 
     if (allFilesSelected) {

[NoCoverage] BlockStatement
commons/diagram/buttons/ImportFileButton.tsx:22:27
 
     const allFilesSelected = newFileList.every(file => file.status === 'done');
 
-    if (allFilesSelected) {
-      fetchEventGraphDataFx({fileList}).finally(() => {
-        setFileList([]);
-      });
-    }
+    if (allFilesSelected) {}
   };
 

[NoCoverage] ConditionalExpression
commons/diagram/buttons/ImportFileButton.tsx:22:9
 
     const allFilesSelected = newFileList.every(file => file.status === 'done');
 
-    if (allFilesSelected) {
+    if (false) {
       fetchEventGraphDataFx({fileList}).finally(() => {
         setFileList([]);

[NoCoverage] BlockStatement
commons/diagram/buttons/ImportFileButton.tsx:23:55
     const allFilesSelected = newFileList.every(file => file.status === 'done');
 
     if (allFilesSelected) {
-      fetchEventGraphDataFx({fileList}).finally(() => {
-        setFileList([]);
-      });
+      fetchEventGraphDataFx({fileList}).finally(() => {});
     }
   };

[Survived] BooleanLiteral
commons/diagram/buttons/ImportFileButton.tsx:35:29
       accept=".yaml,.yml,.json"
       onChange={handleOnChange}
       customRequest={handleCustomRequest}
-      shouldShowUploadList={false}
+      shouldShowUploadList={true}
       fileList={fileList}
       isMultiple

[Survived] BooleanLiteral
commons/diagram/buttons/ImportFileButton.tsx:43:18
         data-testid="import-file-btn"
         key="sixButton"
         icon={<FileImport />}
-        isBlock={false}
+        isBlock={true}
         isDisabled={false}
         isLoading={false}

[Survived] BooleanLiteral
commons/diagram/buttons/ImportFileButton.tsx:44:21
         key="sixButton"
         icon={<FileImport />}
         isBlock={false}
-        isDisabled={false}
+        isDisabled={true}
         isLoading={false}
         size="middle"

[Survived] BooleanLiteral
commons/diagram/buttons/ImportFileButton.tsx:45:20
         icon={<FileImport />}
         isBlock={false}
         isDisabled={false}
-        isLoading={false}
+        isLoading={true}
         size="middle"
         type="default"
