[Survived] LogicalOperator
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:28:58
   parentPath,
   propertyKey,
 }: IJsonSchemaFormRowProps) => {
-  const [keyName, setPropertyKeyName] = useState<string>(propertyKey ?? '');
+  const [keyName, setPropertyKeyName] = useState<string>(propertyKey && '');
   const isSchema = isSchemaObject(jsonSchema);
   const isObjectType = isSchema && getSchemaType(jsonSchema) === 'object';

[Killed] EqualityOperator
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:30:36
 }: IJsonSchemaFormRowProps) => {
   const [keyName, setPropertyKeyName] = useState<string>(propertyKey ?? '');
   const isSchema = isSchemaObject(jsonSchema);
-  const isObjectType = isSchema && getSchemaType(jsonSchema) === 'object';
+  const isObjectType = isSchema && getSchemaType(jsonSchema) !== 'object';
 
   const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "object{2}"
Received string:    "object"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:30:24
 }: IJsonSchemaFormRowProps) => {
   const [keyName, setPropertyKeyName] = useState<string>(propertyKey ?? '');
   const isSchema = isSchemaObject(jsonSchema);
-  const isObjectType = isSchema && getSchemaType(jsonSchema) === 'object';
+  const isObjectType = true;
 
   const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should render basic type display for non-object root schema
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span class="ant-typography ant-typography-secondary css-dev-only-do-not-override-tjsggz">{null}</span> instead

[Killed] BlockStatement
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:32:68
   const isSchema = isSchemaObject(jsonSchema);
   const isObjectType = isSchema && getSchemaType(jsonSchema) === 'object';
 
-  const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {
-    setPropertyKeyName(e.target.value);
-  };
+  const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   const handleUpdate = () => {
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should update property name on blur for nested property
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"properties": {"parentObj": {"properties": {"newName": {"type": "string"}}, "required": ["prop1"], "type": "object"}}, "type": "object"}

Number of calls: 0

[Killed] BlockStatement
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:36:30
     setPropertyKeyName(e.target.value);
   };
 
-  const handleUpdate = () => {
-    if (!isSchema) return;
-
-    // Создаем обновленную вложенную схему с новым свойством
-    const tempKey = `newProperty_${Date.now()}`;
-    const updatedNestedSchema: TSchema = {
-      ...jsonSchema,
-      properties: {
-        ...jsonSchema.properties,
-        [tempKey]: {type: 'string'},
-      },
-    };
-
-    // Если нет пути - обновляем корневую схему
-    if (!parentPath) {
-      onUpdateJsonSchema(updatedNestedSchema);
-      return;
-    }
-
-    // Обновляем главную схему по указанному пути
-    const pathParts = parentPath.split('.');
-    const updatedMainSchema = addOrUpdateNestedSchema(mainSchema, updatedNestedSchema, pathParts);
-
-    onUpdateJsonSchema(updatedMainSchema);
-  };
+  const handleUpdate = () => {};
 
   const handleSave = () => {
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should call onUpdateJsonSchema with new property when adding to root object
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:43:19
     const tempKey = `newProperty_${Date.now()}`;
     const updatedNestedSchema: TSchema = {
       ...jsonSchema,
-      properties: {
-        ...jsonSchema.properties,
-        [tempKey]: {type: 'string'},
-      },
+      properties: {},
     };
 
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should call onUpdateJsonSchema with new property when adding to root object
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] ObjectLiteral
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:45:20
       ...jsonSchema,
       properties: {
         ...jsonSchema.properties,
-        [tempKey]: {type: 'string'},
+        [tempKey]: {},
       },
     };
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should call onUpdateJsonSchema with new property when adding to root object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: undefined

[Killed] BlockStatement
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:50:22
     };
 
     // Если нет пути - обновляем корневую схему
-    if (!parentPath) {
-      onUpdateJsonSchema(updatedNestedSchema);
-      return;
-    }
+    if (!parentPath) {}
 
     // Обновляем главную схему по указанному пути
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should call onUpdateJsonSchema with new property when adding to root object
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:50:9
     };
 
     // Если нет пути - обновляем корневую схему
-    if (!parentPath) {
+    if (false) {
       onUpdateJsonSchema(updatedNestedSchema);
       return;
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should call onUpdateJsonSchema with new property when adding to root object
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] StringLiteral
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:56:40
     }
 
     // Обновляем главную схему по указанному пути
-    const pathParts = parentPath.split('.');
+    const pathParts = parentPath.split("");
     const updatedMainSchema = addOrUpdateNestedSchema(mainSchema, updatedNestedSchema, pathParts);
 
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should add new property to nested object schema
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:63:36
   };
 
   const handleSave = () => {
-    if (keyName === propertyKey || !keyName || !propertyKey || !mainSchema || !parentPath) return;
+    if (keyName === propertyKey || keyName || !propertyKey || !mainSchema || !parentPath) return;
 
     const pathParts = parentPath.split('.');
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should update property name on blur for nested property
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"properties": {"parentObj": {"properties": {"newName": {"type": "string"}}, "required": ["prop1"], "type": "object"}}, "type": "object"}

Number of calls: 0

[Killed] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:63:9
   };
 
   const handleSave = () => {
-    if (keyName === propertyKey || !keyName || !propertyKey || !mainSchema || !parentPath) return;
+    if (false || !parentPath) return;
 
     const pathParts = parentPath.split('.');
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should not update property name if unchanged or empty
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"prop1": undefined, "properties": {"prop1": {"type": "string"}}, "type": "object"}

[Killed] StringLiteral
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:65:40
   const handleSave = () => {
     if (keyName === propertyKey || !keyName || !propertyKey || !mainSchema || !parentPath) return;
 
-    const pathParts = parentPath.split('.');
+    const pathParts = parentPath.split("");
     if (pathParts.length === 0) return;
 
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should update property name on blur for nested property
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,81 @@
  Object {
+   "p": Object {

[Killed] EqualityOperator
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:66:9
     if (keyName === propertyKey || !keyName || !propertyKey || !mainSchema || !parentPath) return;
 
     const pathParts = parentPath.split('.');
-    if (pathParts.length === 0) return;
+    if (pathParts.length !== 0) return;
 
     // Рекурсивная функция для неизменяемого обновления
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should update property name on blur for nested property
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"properties": {"parentObj": {"properties": {"newName": {"type": "string"}}, "required": ["prop1"], "type": "object"}}, "type": "object"}

Number of calls: 0

[Killed] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:66:9
     if (keyName === propertyKey || !keyName || !propertyKey || !mainSchema || !parentPath) return;
 
     const pathParts = parentPath.split('.');
-    if (pathParts.length === 0) return;
+    if (true) return;
 
     // Рекурсивная функция для неизменяемого обновления
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should update property name on blur for nested property
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"properties": {"parentObj": {"properties": {"newName": {"type": "string"}}, "required": ["prop1"], "type": "object"}}, "type": "object"}

Number of calls: 0

[Killed] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:70:11
 
     // Рекурсивная функция для неизменяемого обновления
     const updateSchema = (current: Record<string, unknown>, path: string[], index = 0): TSchema => {
-      if (index === path.length - 1) {
+      if (true) {
         const currentKey = path[index];
         if (!current[currentKey]) {
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should update property name on blur for nested property
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,11 @@
  Object {
+   "newName": undefined,

[Killed] BlockStatement
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:70:38
 
     // Рекурсивная функция для неизменяемого обновления
     const updateSchema = (current: Record<string, unknown>, path: string[], index = 0): TSchema => {
-      if (index === path.length - 1) {
-        const currentKey = path[index];
-        if (!current[currentKey]) {
-          console.warn(`Property "${propertyKey}" not found`);
-          return current;
-        }
-
-        // Создаем копию с обновленным ключом
-        const {[propertyKey]: value, ...rest} = current;
-        return {
-          ...rest,
-          [keyName]: value,
-        };
-      }
+      if (index === path.length - 1) {}
 
       const part = path[index];
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should update property name on blur for nested property
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:72:13
     const updateSchema = (current: Record<string, unknown>, path: string[], index = 0): TSchema => {
       if (index === path.length - 1) {
         const currentKey = path[index];
-        if (!current[currentKey]) {
+        if (current[currentKey]) {
           console.warn(`Property "${propertyKey}" not found`);
           return current;
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should update property name on blur for nested property
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "properties": Object {

[Killed] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:72:13
     const updateSchema = (current: Record<string, unknown>, path: string[], index = 0): TSchema => {
       if (index === path.length - 1) {
         const currentKey = path[index];
-        if (!current[currentKey]) {
+        if (true) {
           console.warn(`Property "${propertyKey}" not found`);
           return current;
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should update property name on blur for nested property
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "properties": Object {

[Timeout] ArithmeticOperator
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:88:85
       const part = path[index];
       return {
         ...current,
-        [part]: updateSchema({...(current[part] as Record<string, unknown>)}, path, index + 1),
+        [part]: updateSchema({...(current[part] as Record<string, unknown>)}, path, index - 1),
       };
     };

[Killed] ObjectLiteral
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:88:30
       const part = path[index];
       return {
         ...current,
-        [part]: updateSchema({...(current[part] as Record<string, unknown>)}, path, index + 1),
+        [part]: updateSchema({}, path, index + 1),
       };
     };
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should update property name on blur for nested property
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "properties": Object {
      "parentObj": Object {

[Killed] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:97:9
   };
 
   const renderField = () => {
-    if (propertyKey !== undefined) {
+    if (true) {
       return (
         <div className="flex h-[2.5rem] items-center gap-1">
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3

Ignored nodes: comments, script, style
<html>

[Killed] EqualityOperator
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:97:9
   };
 
   const renderField = () => {
-    if (propertyKey !== undefined) {
+    if (propertyKey === undefined) {
       return (
         <div className="flex h-[2.5rem] items-center gap-1">
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should render object type with properties count and add button for root object
statusReason: TestingLibraryElementError: Unable to find an element with the text: {1}. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hover-container flex justify-between"
    >

[Survived] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:116:12
             propertyKey={propertyKey}
             onUpdateJsonSchema={onUpdateJsonSchema}
           />
-          {isObjectType && (
-            <Button
-              data-testid="property-add-btn"
-              size="small"
-              icon={<Plus size={16} />}
-              type="text"
-              className="min-h-4 min-w-4 !px-0"
-              onClick={handleUpdate}
-            />
-          )}
+          {true}
         </div>
       );

[Timeout] LogicalOperator
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:116:12
             propertyKey={propertyKey}
             onUpdateJsonSchema={onUpdateJsonSchema}
           />
-          {isObjectType && (
-            <Button
-              data-testid="property-add-btn"
-              size="small"
-              icon={<Plus size={16} />}
-              type="text"
-              className="min-h-4 min-w-4 !px-0"
-              onClick={handleUpdate}
-            />
-          )}
+          {isObjectType || <Button data-testid="property-add-btn" size="small" icon={<Plus size={16} />} type="text" className="min-h-4 min-w-4 !px-0" onClick={handleUpdate} />}
         </div>
       );

[Killed] LogicalOperator
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:140:12
             propertyKey={propertyKey}
             onUpdateJsonSchema={onUpdateJsonSchema}
           />
-          {isObjectType && <Text type="secondary">{`{${getPropertiesLength(jsonSchema)}}`}</Text>}
+          {isObjectType || <Text type="secondary">{`{${getPropertiesLength(jsonSchema)}}`}</Text>}
         </div>
 
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "object{2}"
Received string:    "object"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:140:12
             propertyKey={propertyKey}
             onUpdateJsonSchema={onUpdateJsonSchema}
           />
-          {isObjectType && <Text type="secondary">{`{${getPropertiesLength(jsonSchema)}}`}</Text>}
+          {false}
         </div>
 
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaForm.tsx should render correct tree structure for object schema
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "object{2}"
Received string:    "object"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:143:10
           {isObjectType && <Text type="secondary">{`{${getPropertiesLength(jsonSchema)}}`}</Text>}
         </div>
 
-        {isObjectType && (
-          <Button
-            data-testid="property-add-btn"
-            size="small"
-            icon={<Plus size={16} />}
-            type="text"
-            className="min-h-4 min-w-4 !px-0"
-            onClick={handleUpdate}
-          />
-        )}
+        {true}
       </div>
     );
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should render object type with properties count and add button for root object
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="property-add-btn"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hover-container flex justify-between"
    >

[Killed] LogicalOperator
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:143:10
           {isObjectType && <Text type="secondary">{`{${getPropertiesLength(jsonSchema)}}`}</Text>}
         </div>
 
-        {isObjectType && (
-          <Button
-            data-testid="property-add-btn"
-            size="small"
-            icon={<Plus size={16} />}
-            type="text"
-            className="min-h-4 min-w-4 !px-0"
-            onClick={handleUpdate}
-          />
-        )}
+        {isObjectType || <Button data-testid="property-add-btn" size="small" icon={<Plus size={16} />} type="text" className="min-h-4 min-w-4 !px-0" onClick={handleUpdate} />}
       </div>
     );
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should render basic type display for non-object root schema
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] BlockStatement
components/jsonEditor/json-schema-form/JsonSchemaFormRow.tsx:157:19
     );
   };
 
-  useEffect(() => {
-    setPropertyKeyName(propertyKey);
-  }, [propertyKey]);
+  useEffect(() => {}, [propertyKey]);
 
   return (
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should update displayed property key when prop changes
statusReason: TestingLibraryElementError: Unable to find an element with the display value: newName.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hover-container flex justify-between"
    >
