[NoCoverage] ConditionalExpression
components/commons/diagram/Diagram.tsx:51:22
 
   const onConnect: OnConnect = useCallback(
     params => {
-      const fromId = params.sourceHandle === null ? params.target : params.source;
+      const fromId = true ? params.target : params.source;
       const toId = params.sourceHandle === null ? params.source : params.target;
 

[NoCoverage] ConditionalExpression
components/commons/diagram/Diagram.tsx:51:22
 
   const onConnect: OnConnect = useCallback(
     params => {
-      const fromId = params.sourceHandle === null ? params.target : params.source;
+      const fromId = false ? params.target : params.source;
       const toId = params.sourceHandle === null ? params.source : params.target;
 

[NoCoverage] EqualityOperator
components/commons/diagram/Diagram.tsx:52:20
   const onConnect: OnConnect = useCallback(
     params => {
       const fromId = params.sourceHandle === null ? params.target : params.source;
-      const toId = params.sourceHandle === null ? params.source : params.target;
+      const toId = params.sourceHandle !== null ? params.source : params.target;
 
       // Проверка на самосоединение

[NoCoverage] ConditionalExpression
components/commons/diagram/Diagram.tsx:52:20
   const onConnect: OnConnect = useCallback(
     params => {
       const fromId = params.sourceHandle === null ? params.target : params.source;
-      const toId = params.sourceHandle === null ? params.source : params.target;
+      const toId = true ? params.source : params.target;
 
       // Проверка на самосоединение

[NoCoverage] ConditionalExpression
components/commons/diagram/Diagram.tsx:55:11
       const toId = params.sourceHandle === null ? params.source : params.target;
 
       // Проверка на самосоединение
-      if (fromId === toId) return;
+      if (true) return;
 
       // Получаем типы узлов

[NoCoverage] EqualityOperator
components/commons/diagram/Diagram.tsx:55:11
       const toId = params.sourceHandle === null ? params.source : params.target;
 
       // Проверка на самосоединение
-      if (fromId === toId) return;
+      if (fromId !== toId) return;
 
       // Получаем типы узлов

[NoCoverage] LogicalOperator
components/commons/diagram/Diagram.tsx:63:10
 
       // Проверяем допустимые соединения
       const isValidConnection =
-        (fromNodeType === 'SERVICE' && toNodeType === 'TOPIC') ||
+        (fromNodeType === 'SERVICE' || toNodeType === 'TOPIC') ||
         (fromNodeType === 'TOPIC' && toNodeType === 'SERVICE') ||
         (fromNodeType === 'HTTP' && toNodeType === 'SERVICE');

[NoCoverage] EqualityOperator
components/commons/diagram/Diagram.tsx:63:40
 
       // Проверяем допустимые соединения
       const isValidConnection =
-        (fromNodeType === 'SERVICE' && toNodeType === 'TOPIC') ||
+        (fromNodeType === 'SERVICE' && toNodeType !== 'TOPIC') ||
         (fromNodeType === 'TOPIC' && toNodeType === 'SERVICE') ||
         (fromNodeType === 'HTTP' && toNodeType === 'SERVICE');

[NoCoverage] EqualityOperator
components/commons/diagram/Diagram.tsx:64:38
       // Проверяем допустимые соединения
       const isValidConnection =
         (fromNodeType === 'SERVICE' && toNodeType === 'TOPIC') ||
-        (fromNodeType === 'TOPIC' && toNodeType === 'SERVICE') ||
+        (fromNodeType === 'TOPIC' && toNodeType !== 'SERVICE') ||
         (fromNodeType === 'HTTP' && toNodeType === 'SERVICE');
 

[NoCoverage] ConditionalExpression
components/commons/diagram/Diagram.tsx:64:10
       // Проверяем допустимые соединения
       const isValidConnection =
         (fromNodeType === 'SERVICE' && toNodeType === 'TOPIC') ||
-        (fromNodeType === 'TOPIC' && toNodeType === 'SERVICE') ||
+        (false) ||
         (fromNodeType === 'HTTP' && toNodeType === 'SERVICE');
 

[NoCoverage] EqualityOperator
components/commons/diagram/Diagram.tsx:65:37
       const isValidConnection =
         (fromNodeType === 'SERVICE' && toNodeType === 'TOPIC') ||
         (fromNodeType === 'TOPIC' && toNodeType === 'SERVICE') ||
-        (fromNodeType === 'HTTP' && toNodeType === 'SERVICE');
+        (fromNodeType === 'HTTP' && toNodeType !== 'SERVICE');
 
       // Если соединение недопустимо, выходим из функции

[NoCoverage] ConditionalExpression
components/commons/diagram/Diagram.tsx:65:10
       const isValidConnection =
         (fromNodeType === 'SERVICE' && toNodeType === 'TOPIC') ||
         (fromNodeType === 'TOPIC' && toNodeType === 'SERVICE') ||
-        (fromNodeType === 'HTTP' && toNodeType === 'SERVICE');
+        (false);
 
       // Если соединение недопустимо, выходим из функции

[NoCoverage] ConditionalExpression
components/commons/diagram/Diagram.tsx:68:11
         (fromNodeType === 'HTTP' && toNodeType === 'SERVICE');
 
       // Если соединение недопустимо, выходим из функции
-      if (!isValidConnection) return;
+      if (true) return;
 
       const newEdge = {

[NoCoverage] ConditionalExpression
components/commons/diagram/Diagram.tsx:68:11
         (fromNodeType === 'HTTP' && toNodeType === 'SERVICE');
 
       // Если соединение недопустимо, выходим из функции
-      if (!isValidConnection) return;
+      if (false) return;
 
       const newEdge = {

[NoCoverage] StringLiteral
components/commons/diagram/Diagram.tsx:74:18
         fromId,
         toId,
         group: '',
-        eventId: '',
+        eventId: "Stryker was here!",
       };
       addLink(newEdge);

[Survived] BooleanLiteral
components/commons/diagram/Diagram.tsx:94:39
         onConnect={onConnect}
         edgeTypes={edgeTypes}
         nodeTypes={nodeTypes}
-        proOptions={{hideAttribution: true}}
+        proOptions={{hideAttribution: false}}
         fitViewOptions={{minZoom: 1, maxZoom: 1}}
         fitView

[Survived] StringLiteral
components/commons/diagram/Diagram.tsx:101:103
         <Panel
           position="top-right"
           data-testid="panel"
-          className={clsx('ml-2 flex w-[calc(100%-30px)] gap-14 pb-3', 'overflow-x-auto scroll-auto', 'scrollbar')}
+          className={clsx('ml-2 flex w-[calc(100%-30px)] gap-14 pb-3', 'overflow-x-auto scroll-auto', "")}
         >
           <FilterByTag/>

[Survived] StringLiteral
components/commons/diagram/Diagram.tsx:101:27
         <Panel
           position="top-right"
           data-testid="panel"
-          className={clsx('ml-2 flex w-[calc(100%-30px)] gap-14 pb-3', 'overflow-x-auto scroll-auto', 'scrollbar')}
+          className={clsx("", 'overflow-x-auto scroll-auto', 'scrollbar')}
         >
           <FilterByTag/>

[Survived] ArrowFunction
components/commons/diagram/Diagram.tsx:105:27
         >
           <FilterByTag/>
           <DiagramGroupButtons
-            onAddService={() => addNode(NodeDTOTypeEnum.Service)}
+            onAddService={() => undefined}
             onAddTopic={() => addNode(NodeDTOTypeEnum.Topic)}
             onAddEvent={() => openDrawerCreateEvent(null)}

[Survived] ArrowFunction
components/commons/diagram/Diagram.tsx:106:25
           <FilterByTag/>
           <DiagramGroupButtons
             onAddService={() => addNode(NodeDTOTypeEnum.Service)}
-            onAddTopic={() => addNode(NodeDTOTypeEnum.Topic)}
+            onAddTopic={() => undefined}
             onAddEvent={() => openDrawerCreateEvent(null)}
             onAddHttp={() => addNode(NodeDTOTypeEnum.Http)}

[Survived] ArrowFunction
components/commons/diagram/Diagram.tsx:107:25
           <DiagramGroupButtons
             onAddService={() => addNode(NodeDTOTypeEnum.Service)}
             onAddTopic={() => addNode(NodeDTOTypeEnum.Topic)}
-            onAddEvent={() => openDrawerCreateEvent(null)}
+            onAddEvent={() => undefined}
             onAddHttp={() => addNode(NodeDTOTypeEnum.Http)}
             onAddLink={() => openDrawerAddLink('')}

[Survived] ArrowFunction
components/commons/diagram/Diagram.tsx:108:24
             onAddService={() => addNode(NodeDTOTypeEnum.Service)}
             onAddTopic={() => addNode(NodeDTOTypeEnum.Topic)}
             onAddEvent={() => openDrawerCreateEvent(null)}
-            onAddHttp={() => addNode(NodeDTOTypeEnum.Http)}
+            onAddHttp={() => undefined}
             onAddLink={() => openDrawerAddLink('')}
             onDelete={() => openDeleteSelectedItemsModal(selectedItems)}

[Survived] ArrowFunction
components/commons/diagram/Diagram.tsx:109:24
             onAddTopic={() => addNode(NodeDTOTypeEnum.Topic)}
             onAddEvent={() => openDrawerCreateEvent(null)}
             onAddHttp={() => addNode(NodeDTOTypeEnum.Http)}
-            onAddLink={() => openDrawerAddLink('')}
+            onAddLink={() => undefined}
             onDelete={() => openDeleteSelectedItemsModal(selectedItems)}
           />

[Survived] ArrowFunction
components/commons/diagram/Diagram.tsx:110:23
             onAddEvent={() => openDrawerCreateEvent(null)}
             onAddHttp={() => addNode(NodeDTOTypeEnum.Http)}
             onAddLink={() => openDrawerAddLink('')}
-            onDelete={() => openDeleteSelectedItemsModal(selectedItems)}
+            onDelete={() => undefined}
           />
         </Panel>

[Survived] ArrowFunction
components/commons/diagram/Diagram.tsx:114:64
           />
         </Panel>
         <Controls orientation="horizontal" position="bottom-center" className="text-color-icon gap-1 shadow-none">
-          <ControlButton data-testid="delete-all-btn" onClick={() => openDeleteItemsModal()}>
+          <ControlButton data-testid="delete-all-btn" onClick={() => undefined}>
             <IconEraser className="fill-none" size={16} />
           </ControlButton>
