[NoCoverage] StringLiteral
src/components/jsonEditor/JsonEditorSidebar.tsx:16:73
 export const JsonEditorSidebar: FC = () => {
   const eventGraphData = useUnit($eventGraph);
 
-  const containerClassName = clsx('h-full w-[20rem] bg-white shrink-0', 'side-bar');
+  const containerClassName = clsx('h-full w-[20rem] bg-white shrink-0', "");
 
   const scrollAreaClassName = clsx(`w-full h-full overflow-y-scroll scroll-auto pt-10 pl-6 pr-6 pb-16`, 'scrollbar');

[NoCoverage] StringLiteral
src/components/jsonEditor/JsonEditorSidebar.tsx:18:36
 
   const containerClassName = clsx('h-full w-[20rem] bg-white shrink-0', 'side-bar');
 
-  const scrollAreaClassName = clsx(`w-full h-full overflow-y-scroll scroll-auto pt-10 pl-6 pr-6 pb-16`, 'scrollbar');
+  const scrollAreaClassName = clsx(``, 'scrollbar');
   return (
     <div className={containerClassName} data-testid="json-editor-sidebar">

[NoCoverage] StringLiteral
src/components/jsonEditor/JsonEditorSidebar.tsx:18:105
 
   const containerClassName = clsx('h-full w-[20rem] bg-white shrink-0', 'side-bar');
 
-  const scrollAreaClassName = clsx(`w-full h-full overflow-y-scroll scroll-auto pt-10 pl-6 pr-6 pb-16`, 'scrollbar');
+  const scrollAreaClassName = clsx(`w-full h-full overflow-y-scroll scroll-auto pt-10 pl-6 pr-6 pb-16`, "");
   return (
     <div className={containerClassName} data-testid="json-editor-sidebar">

[NoCoverage] ArrayDeclaration
src/components/jsonEditor/JsonEditorSidebar.tsx:28:26
       <div className="absolute bottom-0 h-[4rem] w-[20rem] border-t border-gray-200 bg-white p-3">
         <ButtonsGroup
           className="flex items-center justify-start gap-3"
-          buttonsConfig={[
-            {
-              buttonKey: 'new-event-button',
-              icon: <Plus />,
-              iconPosition: 'start',
-              children: 'New Event',
-              isBlock: false,
-              isDisabled: false,
-              isLoading: false,
-              onClick: () => openDrawerCreateEvent(null),
-              type: 'primary',
-            },
-          ]}
+          buttonsConfig={[]}
         />
       </div>

[NoCoverage] StringLiteral
src/components/jsonEditor/JsonEditorSidebar.tsx:33:25
               buttonKey: 'new-event-button',
               icon: <Plus />,
               iconPosition: 'start',
-              children: 'New Event',
+              children: "",
               isBlock: false,
               isDisabled: false,

[NoCoverage] BooleanLiteral
src/components/jsonEditor/JsonEditorSidebar.tsx:34:24
               icon: <Plus />,
               iconPosition: 'start',
               children: 'New Event',
-              isBlock: false,
+              isBlock: true,
               isDisabled: false,
               isLoading: false,

[NoCoverage] ArrowFunction
src/components/jsonEditor/JsonEditorSidebar.tsx:37:24
               isBlock: false,
               isDisabled: false,
               isLoading: false,
-              onClick: () => openDrawerCreateEvent(null),
+              onClick: () => undefined,
               type: 'primary',
             },
