[NoCoverage] OptionalChaining
src/helpers/buildSidebar.tsx:25:5
 
 export const buildSidebar = (eventGraph: EventGraphDTO, hiddenItems: string[]) => {
   const services: MenuItem[] =
-    eventGraph?.nodes
-      ?.filter(node => node.type === 'SERVICE' && node.name)
+    eventGraph?.nodes.filter(node => node.type === 'SERVICE' && node.name)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 

[NoCoverage] OptionalChaining
src/helpers/buildSidebar.tsx:25:5
 
 export const buildSidebar = (eventGraph: EventGraphDTO, hiddenItems: string[]) => {
   const services: MenuItem[] =
-    eventGraph?.nodes
+    eventGraph.nodes
       ?.filter(node => node.type === 'SERVICE' && node.name)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];

[NoCoverage] LogicalOperator
src/helpers/buildSidebar.tsx:26:24
 export const buildSidebar = (eventGraph: EventGraphDTO, hiddenItems: string[]) => {
   const services: MenuItem[] =
     eventGraph?.nodes
-      ?.filter(node => node.type === 'SERVICE' && node.name)
+      ?.filter(node => node.type === 'SERVICE' || node.name)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:26:16
 export const buildSidebar = (eventGraph: EventGraphDTO, hiddenItems: string[]) => {
   const services: MenuItem[] =
     eventGraph?.nodes
-      ?.filter(node => node.type === 'SERVICE' && node.name)
+      ?.filter(() => undefined)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:27:12
   const services: MenuItem[] =
     eventGraph?.nodes
       ?.filter(node => node.type === 'SERVICE' && node.name)
-      .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
+      .map(() => undefined) || [];
 
   const topics: MenuItem[] =

[NoCoverage] MethodExpression
src/helpers/buildSidebar.tsx:30:5
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 
   const topics: MenuItem[] =
-    eventGraph?.nodes
-      ?.filter(node => node.type === 'TOPIC' && node.name)
+    eventGraph?.nodes
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 

[NoCoverage] OptionalChaining
src/helpers/buildSidebar.tsx:30:5
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 
   const topics: MenuItem[] =
-    eventGraph?.nodes
-      ?.filter(node => node.type === 'TOPIC' && node.name)
+    eventGraph?.nodes.filter(node => node.type === 'TOPIC' && node.name)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:31:16
 
   const topics: MenuItem[] =
     eventGraph?.nodes
-      ?.filter(node => node.type === 'TOPIC' && node.name)
+      ?.filter(() => undefined)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 

[NoCoverage] EqualityOperator
src/helpers/buildSidebar.tsx:31:24
 
   const topics: MenuItem[] =
     eventGraph?.nodes
-      ?.filter(node => node.type === 'TOPIC' && node.name)
+      ?.filter(node => node.type !== 'TOPIC' && node.name)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:32:12
   const topics: MenuItem[] =
     eventGraph?.nodes
       ?.filter(node => node.type === 'TOPIC' && node.name)
-      .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
+      .map(() => undefined) || [];
 
   const events: MenuItem[] = eventGraph?.events?.map(event => ({name: event.name, id: event.id, type: 'EVENT'})) || [];

[NoCoverage] LogicalOperator
src/helpers/buildSidebar.tsx:34:30
       ?.filter(node => node.type === 'TOPIC' && node.name)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 
-  const events: MenuItem[] = eventGraph?.events?.map(event => ({name: event.name, id: event.id, type: 'EVENT'})) || [];
+  const events: MenuItem[] = eventGraph?.events?.map(event => ({
+  name: event.name,
+  id: event.id,
+  type: 'EVENT'
+})) && [];
 
   const https: MenuItem[] =

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:34:54
       ?.filter(node => node.type === 'TOPIC' && node.name)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 
-  const events: MenuItem[] = eventGraph?.events?.map(event => ({name: event.name, id: event.id, type: 'EVENT'})) || [];
+  const events: MenuItem[] = eventGraph?.events?.map(() => undefined) || [];
 
   const https: MenuItem[] =

[NoCoverage] OptionalChaining
src/helpers/buildSidebar.tsx:37:5
   const events: MenuItem[] = eventGraph?.events?.map(event => ({name: event.name, id: event.id, type: 'EVENT'})) || [];
 
   const https: MenuItem[] =
-    eventGraph?.nodes
+    eventGraph.nodes
       ?.filter(node => node.type === 'HTTP' && node.name)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];

[NoCoverage] LogicalOperator
src/helpers/buildSidebar.tsx:37:5
   const events: MenuItem[] = eventGraph?.events?.map(event => ({name: event.name, id: event.id, type: 'EVENT'})) || [];
 
   const https: MenuItem[] =
-    eventGraph?.nodes
-      ?.filter(node => node.type === 'HTTP' && node.name)
-      .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
+    eventGraph?.nodes?.filter(node => node.type === 'HTTP' && node.name).map(node => ({
+  name: node.name,
+  id: node.id,
+  type: node.type
+})) && [];
 
   const buildData: SidebarItems = {

[NoCoverage] ConditionalExpression
src/helpers/buildSidebar.tsx:38:24
 
   const https: MenuItem[] =
     eventGraph?.nodes
-      ?.filter(node => node.type === 'HTTP' && node.name)
+      ?.filter(node => true)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 

[NoCoverage] ConditionalExpression
src/helpers/buildSidebar.tsx:38:24
 
   const https: MenuItem[] =
     eventGraph?.nodes
-      ?.filter(node => node.type === 'HTTP' && node.name)
+      ?.filter(node => true && node.name)
       .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
 

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:39:12
   const https: MenuItem[] =
     eventGraph?.nodes
       ?.filter(node => node.type === 'HTTP' && node.name)
-      .map(node => ({name: node.name, id: node.id, type: node.type})) || [];
+      .map(() => undefined) || [];
 
   const buildData: SidebarItems = {

[NoCoverage] ArithmeticOperator
src/helpers/buildSidebar.tsx:49:28
   };
 
   const topicsStartIndex = buildData.services.length;
-  const eventsStartIndex = topicsStartIndex + buildData.topics.length;
+  const eventsStartIndex = topicsStartIndex - buildData.topics.length;
   const httpStartIndex = buildData.https.length + buildData.topics.length + buildData.events.length;
   const linkStartIndex = eventGraph?.links?.length;

[NoCoverage] ArithmeticOperator
src/helpers/buildSidebar.tsx:50:26
 
   const topicsStartIndex = buildData.services.length;
   const eventsStartIndex = topicsStartIndex + buildData.topics.length;
-  const httpStartIndex = buildData.https.length + buildData.topics.length + buildData.events.length;
+  const httpStartIndex = buildData.https.length - buildData.topics.length + buildData.events.length;
   const linkStartIndex = eventGraph?.links?.length;
 

[NoCoverage] ArithmeticOperator
src/helpers/buildSidebar.tsx:50:26
 
   const topicsStartIndex = buildData.services.length;
   const eventsStartIndex = topicsStartIndex + buildData.topics.length;
-  const httpStartIndex = buildData.https.length + buildData.topics.length + buildData.events.length;
+  const httpStartIndex = buildData.https.length + buildData.topics.length - buildData.events.length;
   const linkStartIndex = eventGraph?.links?.length;
 

[NoCoverage] OptionalChaining
src/helpers/buildSidebar.tsx:51:26
   const topicsStartIndex = buildData.services.length;
   const eventsStartIndex = topicsStartIndex + buildData.topics.length;
   const httpStartIndex = buildData.https.length + buildData.topics.length + buildData.events.length;
-  const linkStartIndex = eventGraph?.links?.length;
+  const linkStartIndex = eventGraph?.links.length;
 
   const nodes = eventGraph?.nodes;

[NoCoverage] OptionalChaining
src/helpers/buildSidebar.tsx:51:26
   const topicsStartIndex = buildData.services.length;
   const eventsStartIndex = topicsStartIndex + buildData.topics.length;
   const httpStartIndex = buildData.https.length + buildData.topics.length + buildData.events.length;
-  const linkStartIndex = eventGraph?.links?.length;
+  const linkStartIndex = eventGraph.links?.length;
 
   const nodes = eventGraph?.nodes;

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:57:40
 
   const items: ItemType[] = [
     {
-      children: buildData.services.map((service, index) => ({
-        key: index,
-        className: clsx(hiddenItems.includes(service.id) && 'opacity-30'),
-        label: (
-          <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(service, hiddenItems)}>
-            {service.name}
-          </Dropdown>
-        ),
-        onClick: () => openInfoPanelModal(service.id),
-      })),
+      children: buildData.services.map(() => undefined),
       icon: IconMap.SERVICE,
       key: 'sub1',

[NoCoverage] ConditionalExpression
src/helpers/buildSidebar.tsx:59:25
     {
       children: buildData.services.map((service, index) => ({
         key: index,
-        className: clsx(hiddenItems.includes(service.id) && 'opacity-30'),
+        className: clsx(false),
         label: (
           <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(service, hiddenItems)}>

[NoCoverage] LogicalOperator
src/helpers/buildSidebar.tsx:59:25
     {
       children: buildData.services.map((service, index) => ({
         key: index,
-        className: clsx(hiddenItems.includes(service.id) && 'opacity-30'),
+        className: clsx(hiddenItems.includes(service.id) || 'opacity-30'),
         label: (
           <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(service, hiddenItems)}>

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:65:18
             {service.name}
           </Dropdown>
         ),
-        onClick: () => openInfoPanelModal(service.id),
+        onClick: () => undefined,
       })),
       icon: IconMap.SERVICE,

[NoCoverage] BooleanLiteral
src/helpers/buildSidebar.tsx:72:17
       label: (
         <Dropdown
           trigger={['contextMenu']}
-          menu={!isEmpty(buildData.services) && buildSidebarHeaderContextMenu(buildData.services, hiddenItems)}
+          menu={isEmpty(buildData.services) && buildSidebarHeaderContextMenu(buildData.services, hiddenItems)}
         >
           Services

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:80:38
       ),
     },
     {
-      children: buildData.topics.map((topic, index) => ({
-        key: topicsStartIndex + index,
-        className: clsx(hiddenItems.includes(topic.id) && 'opacity-30'),
-        label: (
-          <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(topic, hiddenItems)}>
-            {topic.name}
-          </Dropdown>
-        ),
-        itemIcon: <AlertCircle size={16} className="text-red-500"/>,
-        onClick: () => openInfoPanelModal(topic.id),
-      })),
+      children: buildData.topics.map(() => undefined),
       icon: IconMap.TOPIC,
       key: 'sub2',

[NoCoverage] ArithmeticOperator
src/helpers/buildSidebar.tsx:81:14
     },
     {
       children: buildData.topics.map((topic, index) => ({
-        key: topicsStartIndex + index,
+        key: topicsStartIndex - index,
         className: clsx(hiddenItems.includes(topic.id) && 'opacity-30'),
         label: (

[NoCoverage] ConditionalExpression
src/helpers/buildSidebar.tsx:82:25
     {
       children: buildData.topics.map((topic, index) => ({
         key: topicsStartIndex + index,
-        className: clsx(hiddenItems.includes(topic.id) && 'opacity-30'),
+        className: clsx(false),
         label: (
           <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(topic, hiddenItems)}>

[NoCoverage] LogicalOperator
src/helpers/buildSidebar.tsx:82:25
     {
       children: buildData.topics.map((topic, index) => ({
         key: topicsStartIndex + index,
-        className: clsx(hiddenItems.includes(topic.id) && 'opacity-30'),
+        className: clsx(hiddenItems.includes(topic.id) || 'opacity-30'),
         label: (
           <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(topic, hiddenItems)}>

[NoCoverage] ArrayDeclaration
src/helpers/buildSidebar.tsx:84:30
         key: topicsStartIndex + index,
         className: clsx(hiddenItems.includes(topic.id) && 'opacity-30'),
         label: (
-          <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(topic, hiddenItems)}>
+          <Dropdown trigger={[]} menu={buildSidebarContextMenu(topic, hiddenItems)}>
             {topic.name}
           </Dropdown>

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:89:18
           </Dropdown>
         ),
         itemIcon: <AlertCircle size={16} className="text-red-500"/>,
-        onClick: () => openInfoPanelModal(topic.id),
+        onClick: () => undefined,
       })),
       icon: IconMap.TOPIC,

[NoCoverage] BooleanLiteral
src/helpers/buildSidebar.tsx:96:17
       label: (
         <Dropdown
           trigger={['contextMenu']}
-          menu={!isEmpty(buildData.topics) && buildSidebarHeaderContextMenu(buildData.topics, hiddenItems)}
+          menu={isEmpty(buildData.topics) && buildSidebarHeaderContextMenu(buildData.topics, hiddenItems)}
         >
           Topics

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:104:38
       ),
     },
     {
-      children: buildData.events.map((event, index) => ({
-        key: eventsStartIndex + index,
-        className: clsx(hiddenItems.includes(event.id) && 'opacity-30'),
-        label: (
-          <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(event, hiddenItems)}>
-            {event.name}
-          </Dropdown>
-        ),
-        onClick: () => console.log(`Click ${event.name}, id:${event.id}`),
-        itemIcon: (
-          <div className="flex items-center gap-1">
-            <AlertCircle size={16} className="text-red-500"/>
-            <CloudLock size={16} className="text-neutral-300"/>
-          </div>
-        ),
-      })),
+      children: buildData.events.map(() => undefined),
       icon: <TopologyStar size={16} strokeWidth={2} color="black"/>,
       key: 'sub3',

[NoCoverage] ArithmeticOperator
src/helpers/buildSidebar.tsx:105:14
     },
     {
       children: buildData.events.map((event, index) => ({
-        key: eventsStartIndex + index,
+        key: eventsStartIndex - index,
         className: clsx(hiddenItems.includes(event.id) && 'opacity-30'),
         label: (

[NoCoverage] ConditionalExpression
src/helpers/buildSidebar.tsx:106:25
     {
       children: buildData.events.map((event, index) => ({
         key: eventsStartIndex + index,
-        className: clsx(hiddenItems.includes(event.id) && 'opacity-30'),
+        className: clsx(false),
         label: (
           <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(event, hiddenItems)}>

[NoCoverage] LogicalOperator
src/helpers/buildSidebar.tsx:106:25
     {
       children: buildData.events.map((event, index) => ({
         key: eventsStartIndex + index,
-        className: clsx(hiddenItems.includes(event.id) && 'opacity-30'),
+        className: clsx(hiddenItems.includes(event.id) || 'opacity-30'),
         label: (
           <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(event, hiddenItems)}>

[NoCoverage] ArrayDeclaration
src/helpers/buildSidebar.tsx:108:30
         key: eventsStartIndex + index,
         className: clsx(hiddenItems.includes(event.id) && 'opacity-30'),
         label: (
-          <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(event, hiddenItems)}>
+          <Dropdown trigger={[]} menu={buildSidebarContextMenu(event, hiddenItems)}>
             {event.name}
           </Dropdown>

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:112:18
             {event.name}
           </Dropdown>
         ),
-        onClick: () => console.log(`Click ${event.name}, id:${event.id}`),
+        onClick: () => undefined,
         itemIcon: (
           <div className="flex items-center gap-1">

[NoCoverage] BooleanLiteral
src/helpers/buildSidebar.tsx:125:17
       label: (
         <Dropdown
           trigger={['contextMenu']}
-          menu={!isEmpty(buildData.events) && buildSidebarHeaderContextMenu(buildData.events, hiddenItems, true)}
+          menu={isEmpty(buildData.events) && buildSidebarHeaderContextMenu(buildData.events, hiddenItems, true)}
         >
           Events

[NoCoverage] BooleanLiteral
src/helpers/buildSidebar.tsx:125:108
       label: (
         <Dropdown
           trigger={['contextMenu']}
-          menu={!isEmpty(buildData.events) && buildSidebarHeaderContextMenu(buildData.events, hiddenItems, true)}
+          menu={!isEmpty(buildData.events) && buildSidebarHeaderContextMenu(buildData.events, hiddenItems, false)}
         >
           Events

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:133:37
       ),
     },
     {
-      children: buildData.https.map((http, index) => ({
-        key: httpStartIndex + index,
-        className: clsx(hiddenItems.includes(http.id) && 'opacity-30'),
-        label: (
-          <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(http, hiddenItems)}>
-            {http.name}
-          </Dropdown>
-        ),
-        itemIcon: <AlertCircle size={16} className="text-red-500"/>,
-        onClick: () => openInfoPanelModal(http.id),
-      })),
+      children: buildData.https.map(() => undefined),
       icon: IconMap.HTTP,
       key: 'sub4',

[NoCoverage] ArithmeticOperator
src/helpers/buildSidebar.tsx:134:14
     },
     {
       children: buildData.https.map((http, index) => ({
-        key: httpStartIndex + index,
+        key: httpStartIndex - index,
         className: clsx(hiddenItems.includes(http.id) && 'opacity-30'),
         label: (

[NoCoverage] ConditionalExpression
src/helpers/buildSidebar.tsx:135:25
     {
       children: buildData.https.map((http, index) => ({
         key: httpStartIndex + index,
-        className: clsx(hiddenItems.includes(http.id) && 'opacity-30'),
+        className: clsx(false),
         label: (
           <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(http, hiddenItems)}>

[NoCoverage] ConditionalExpression
src/helpers/buildSidebar.tsx:135:25
     {
       children: buildData.https.map((http, index) => ({
         key: httpStartIndex + index,
-        className: clsx(hiddenItems.includes(http.id) && 'opacity-30'),
+        className: clsx(true),
         label: (
           <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(http, hiddenItems)}>

[NoCoverage] ArrayDeclaration
src/helpers/buildSidebar.tsx:137:30
         key: httpStartIndex + index,
         className: clsx(hiddenItems.includes(http.id) && 'opacity-30'),
         label: (
-          <Dropdown trigger={['contextMenu']} menu={buildSidebarContextMenu(http, hiddenItems)}>
+          <Dropdown trigger={[]} menu={buildSidebarContextMenu(http, hiddenItems)}>
             {http.name}
           </Dropdown>

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:142:18
           </Dropdown>
         ),
         itemIcon: <AlertCircle size={16} className="text-red-500"/>,
-        onClick: () => openInfoPanelModal(http.id),
+        onClick: () => undefined,
       })),
       icon: IconMap.HTTP,

[NoCoverage] ArrayDeclaration
src/helpers/buildSidebar.tsx:148:20
       key: 'sub4',
       label: (
         <Dropdown
-          trigger={['contextMenu']}
+          trigger={[]}
           menu={!isEmpty(buildData.https) && buildSidebarHeaderContextMenu(buildData.https, hiddenItems)}
         >

[NoCoverage] BooleanLiteral
src/helpers/buildSidebar.tsx:149:17
       label: (
         <Dropdown
           trigger={['contextMenu']}
-          menu={!isEmpty(buildData.https) && buildSidebarHeaderContextMenu(buildData.https, hiddenItems)}
+          menu={isEmpty(buildData.https) && buildSidebarHeaderContextMenu(buildData.https, hiddenItems)}
         >
           HTTP-nodes

[NoCoverage] OptionalChaining
src/helpers/buildSidebar.tsx:157:17
       ),
     },
     {
-      children: eventGraph?.links?.map((link, index) => {
+      children: eventGraph?.links.map((link, index) => {
         const {fromId, toId} = eventGraph?.links?.find(({id}) => id === link.id) ?? {};
 

[NoCoverage] OptionalChaining
src/helpers/buildSidebar.tsx:157:17
       ),
     },
     {
-      children: eventGraph?.links?.map((link, index) => {
+      children: eventGraph.links?.map((link, index) => {
         const {fromId, toId} = eventGraph?.links?.find(({id}) => id === link.id) ?? {};
 

[NoCoverage] OptionalChaining
src/helpers/buildSidebar.tsx:158:32
     },
     {
       children: eventGraph?.links?.map((link, index) => {
-        const {fromId, toId} = eventGraph?.links?.find(({id}) => id === link.id) ?? {};
+        const {fromId, toId} = eventGraph.links?.find(({id}) => id === link.id) ?? {};
 
         const {connectionType, httpNode, serviceNode, topicNode} = getLinkFormData(nodes, fromId, toId);

[NoCoverage] ConditionalExpression
src/helpers/buildSidebar.tsx:158:66
     },
     {
       children: eventGraph?.links?.map((link, index) => {
-        const {fromId, toId} = eventGraph?.links?.find(({id}) => id === link.id) ?? {};
+        const {fromId, toId} = eventGraph?.links?.find(({id}) => false) ?? {};
 
         const {connectionType, httpNode, serviceNode, topicNode} = getLinkFormData(nodes, fromId, toId);

[NoCoverage] ArithmeticOperator
src/helpers/buildSidebar.tsx:163:16
         const {connectionType, httpNode, serviceNode, topicNode} = getLinkFormData(nodes, fromId, toId);
 
         return ({
-          key: linkStartIndex + index,
+          key: linkStartIndex - index,
           className: clsx(hiddenItems.includes(link.id) && 'opacity-30'),
           label: (

[NoCoverage] ConditionalExpression
src/helpers/buildSidebar.tsx:164:27
 
         return ({
           key: linkStartIndex + index,
-          className: clsx(hiddenItems.includes(link.id) && 'opacity-30'),
+          className: clsx(false),
           label: (
             <Dropdown>

[NoCoverage] LogicalOperator
src/helpers/buildSidebar.tsx:164:27
 
         return ({
           key: linkStartIndex + index,
-          className: clsx(hiddenItems.includes(link.id) && 'opacity-30'),
+          className: clsx(hiddenItems.includes(link.id) || 'opacity-30'),
           label: (
             <Dropdown>

[NoCoverage] ArrowFunction
src/helpers/buildSidebar.tsx:170:20
               {getLinkItemTitle(serviceNode, topicNode, httpNode, connectionType)}
             </Dropdown>
           ),
-          onClick: () => openDrawerEditLink(link.id),
+          onClick: () => undefined,
         })
       }),

[NoCoverage] OptionalChaining
src/helpers/buildSidebar.tsx:178:40
       label: (
         <Dropdown>
           Links
-          <Badge type="default" count={eventGraph?.links?.length}/>
+          <Badge type="default" count={eventGraph?.links.length}/>
         </Dropdown>
       ),

[NoCoverage] OptionalChaining
src/helpers/buildSidebar.tsx:178:40
       label: (
         <Dropdown>
           Links
-          <Badge type="default" count={eventGraph?.links?.length}/>
+          <Badge type="default" count={eventGraph.links?.length}/>
         </Dropdown>
       ),
