[Killed] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:27:50
   propertyKey,
 }: IJsonSchemaTypeProps) => {
   const eventGraph = useUnit($eventGraph);
-  const [popoverOpen, setPopoverOpen] = useState(false);
+  const [popoverOpen, setPopoverOpen] = useState(true);
 
   const targetSchema = jsonSchema;
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should render basic type display for non-object root schema
statusReason: TestingLibraryElementError: Found multiple elements with the text: string

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  aria-describedby="test-id"
  class="ant-typography ant-popover-open css-dev-only-do-not-override-tjsggz"

[NoCoverage] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:37:26
     (selectedType: TSchemaObjectType) => {
       const newSchema = getInitialSchemaByType(selectedType);
 
-      if (!parentPath || !propertyKey) {
+      if (!parentPath || propertyKey) {
         onUpdateJsonSchema(newSchema);
         return;

[NoCoverage] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:37:11
     (selectedType: TSchemaObjectType) => {
       const newSchema = getInitialSchemaByType(selectedType);
 
-      if (!parentPath || !propertyKey) {
+      if (parentPath || !propertyKey) {
         onUpdateJsonSchema(newSchema);
         return;

[NoCoverage] EqualityOperator
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:45:13
       const pathParts = parentPath.split('.');
 
       const updateSchema = (current: Record<string, unknown>, path: string[], index = 0): Record<string, unknown> => {
-        if (index === path.length - 1) {
+        if (index !== path.length - 1) {
           if (!current[propertyKey]) {
             console.warn(`Property "${propertyKey}" not found`);

[NoCoverage] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:45:13
       const pathParts = parentPath.split('.');
 
       const updateSchema = (current: Record<string, unknown>, path: string[], index = 0): Record<string, unknown> => {
-        if (index === path.length - 1) {
+        if (true) {
           if (!current[propertyKey]) {
             console.warn(`Property "${propertyKey}" not found`);

[NoCoverage] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:46:15
 
       const updateSchema = (current: Record<string, unknown>, path: string[], index = 0): Record<string, unknown> => {
         if (index === path.length - 1) {
-          if (!current[propertyKey]) {
+          if (current[propertyKey]) {
             console.warn(`Property "${propertyKey}" not found`);
             return current;

[NoCoverage] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:46:15
 
       const updateSchema = (current: Record<string, unknown>, path: string[], index = 0): Record<string, unknown> => {
         if (index === path.length - 1) {
-          if (!current[propertyKey]) {
+          if (true) {
             console.warn(`Property "${propertyKey}" not found`);
             return current;

[NoCoverage] StringLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:47:26
       const updateSchema = (current: Record<string, unknown>, path: string[], index = 0): Record<string, unknown> => {
         if (index === path.length - 1) {
           if (!current[propertyKey]) {
-            console.warn(`Property "${propertyKey}" not found`);
+            console.warn(``);
             return current;
           }

[NoCoverage] ObjectLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:50:18
             console.warn(`Property "${propertyKey}" not found`);
             return current;
           }
-          return {...current, [propertyKey]: newSchema};
+          return {};
         }
 

[NoCoverage] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:62:22
 
       const updatedSchema = updateSchema({...mainSchema}, pathParts);
       onUpdateJsonSchema(updatedSchema);
-      setPopoverOpen(false);
+      setPopoverOpen(true);
     },
     [mainSchema, parentPath, propertyKey, onUpdateJsonSchema]

[NoCoverage] BlockStatement
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:67:44
     [mainSchema, parentPath, propertyKey, onUpdateJsonSchema]
   );
 
-  const handleRefClick = useCallback(() => {
-    if (!isNotRefTargetSchema) {
-      const selectedEventData = eventGraph?.events?.find(el => el?.name === type);
-      selectMenuItem(selectedEventData);
-    }
-  }, [isNotRefTargetSchema, eventGraph, type]);
+  const handleRefClick = useCallback(() => {}, [isNotRefTargetSchema, eventGraph, type]);
 
   const popoverItems = useMemo(

[NoCoverage] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:68:9
   );
 
   const handleRefClick = useCallback(() => {
-    if (!isNotRefTargetSchema) {
+    if (true) {
       const selectedEventData = eventGraph?.events?.find(el => el?.name === type);
       selectMenuItem(selectedEventData);

[NoCoverage] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:68:9
   );
 
   const handleRefClick = useCallback(() => {
-    if (!isNotRefTargetSchema) {
+    if (isNotRefTargetSchema) {
       const selectedEventData = eventGraph?.events?.find(el => el?.name === type);
       selectMenuItem(selectedEventData);

[NoCoverage] OptionalChaining
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:69:64
 
   const handleRefClick = useCallback(() => {
     if (!isNotRefTargetSchema) {
-      const selectedEventData = eventGraph?.events?.find(el => el?.name === type);
+      const selectedEventData = eventGraph?.events?.find(el => el.name === type);
       selectMenuItem(selectedEventData);
     }

[NoCoverage] OptionalChaining
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:69:33
 
   const handleRefClick = useCallback(() => {
     if (!isNotRefTargetSchema) {
-      const selectedEventData = eventGraph?.events?.find(el => el?.name === type);
+      const selectedEventData = eventGraph.events?.find(el => el?.name === type);
       selectMenuItem(selectedEventData);
     }

[Killed] ArrowFunction
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:75:5
   }, [isNotRefTargetSchema, eventGraph, type]);
 
   const popoverItems = useMemo(
-    () =>
-      TYPE_OPTIONS.map(typeEl => ({
-        key: typeEl,
-        label: <span style={{color: getColorByType(typeEl)}}>{typeEl}</span>,
-        onClick: () => handleTypeChange(typeEl),
-      })),
+    () => undefined,
     [handleTypeChange]
   );
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should show type selector when type is clicked for root element
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "menuitem"

Here are the accessible roles:

  button:

  Name "":
  <button

[Survived] ArrowFunction
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:76:24
 
   const popoverItems = useMemo(
     () =>
-      TYPE_OPTIONS.map(typeEl => ({
-        key: typeEl,
-        label: <span style={{color: getColorByType(typeEl)}}>{typeEl}</span>,
-        onClick: () => handleTypeChange(typeEl),
-      })),
+      TYPE_OPTIONS.map(() => undefined),
     [handleTypeChange]
   );

[Survived] ArrowFunction
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:79:18
       TYPE_OPTIONS.map(typeEl => ({
         key: typeEl,
         label: <span style={{color: getColorByType(typeEl)}}>{typeEl}</span>,
-        onClick: () => handleTypeChange(typeEl),
+        onClick: () => undefined,
       })),
     [handleTypeChange]

[Killed] ConditionalExpression
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:84:7
     [handleTypeChange]
   );
 
-  if (!isNotRefTargetSchema) {
+  if (true) {
     return (
       <Button type="link" onClick={handleRefClick}>
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should show type selector when type is clicked for root element
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "menu"

Here are the accessible roles:

  button:

  Name "string":
  <button

[Killed] BooleanLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:84:7
     [handleTypeChange]
   );
 
-  if (!isNotRefTargetSchema) {
+  if (isNotRefTargetSchema) {
     return (
       <Button type="link" onClick={handleRefClick}>
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should show type selector when type is clicked for root element
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "menu"

Here are the accessible roles:

  button:

  Name "string":
  <button

[Survived] StringLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:98:61
       onOpenChange={setPopoverOpen}
       maxWidth={265}
       minWidth={265}
-      content={<Menu items={popoverItems} style={{maxWidth: '100%', borderRight: 'none'}} />}
+      content={<Menu items={popoverItems} style={{maxWidth: "", borderRight: 'none'}} />}
       placement="right"
       trigger="click"

[Survived] StringLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:98:82
       onOpenChange={setPopoverOpen}
       maxWidth={265}
       minWidth={265}
-      content={<Menu items={popoverItems} style={{maxWidth: '100%', borderRight: 'none'}} />}
+      content={<Menu items={popoverItems} style={{maxWidth: '100%', borderRight: ""}} />}
       placement="right"
       trigger="click"

[Survived] ObjectLiteral
components/jsonEditor/json-schema-form/JsonSchemaType.tsx:102:20
       placement="right"
       trigger="click"
     >
-      <Text style={{color: getTypeColor(targetSchema)}}>{type}</Text>
+      <Text style={{}}>{type}</Text>
     </Popover>
   );
