[Killed] BooleanLiteral
helpers/json-editor/json-form-helpers/addOrUpdateNestedSchema.ts:12:7
  * @param path - путь до обновления
  */
 export function addOrUpdateNestedSchema(schema: TSchema, nestedSchema: TSchema, path: string[]): TSchema {
-  if (!isSchemaObject(schema) || !isSchemaObject(nestedSchema)) {
+  if (isSchemaObject(schema) || !isSchemaObject(nestedSchema)) {
     throw new Error('Root schema must be a SchemaObject, not a ReferenceObject');
   }
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should add new property to nested object schema
statusReason: Error: Root schema must be a SchemaObject, not a ReferenceObject

[Killed] EqualityOperator
helpers/json-editor/json-form-helpers/addOrUpdateNestedSchema.ts:18:9
 
   // Рекурсивная функция для обхода и обновления схемы
   const updateSchema = (currentSchema: Record<string, unknown>, remainingPath: string[]): Record<string, unknown> => {
-    if (remainingPath.length === 1) {
+    if (remainingPath.length !== 1) {
       const key = remainingPath[0];
       const existingValue = currentSchema[key];
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should add new property to nested object schema
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] BlockStatement
helpers/json-editor/json-form-helpers/addOrUpdateNestedSchema.ts:18:37
 
   // Рекурсивная функция для обхода и обновления схемы
   const updateSchema = (currentSchema: Record<string, unknown>, remainingPath: string[]): Record<string, unknown> => {
-    if (remainingPath.length === 1) {
-      const key = remainingPath[0];
-      const existingValue = currentSchema[key];
-
-      return {
-        ...currentSchema, // Копируем текущий уровень
-        [key]: existingValue
-          ? {
-              ...(existingValue as Record<string, unknown>), // Если значение есть - мерджим с новой схемой
-              ...nestedSchema,
-              properties: {
-                // Мерджим свойства, чтобы не потерять существующие
-                ...((existingValue as Record<string, unknown>)?.properties as Record<string, unknown>),
-                ...nestedSchema?.properties,
-              },
-            }
-          : nestedSchema,
-      };
-    }
+    if (remainingPath.length === 1) {}
 
     // Разбираем путь на текущий ключ и остаток
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should add new property to nested object schema
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ObjectLiteral
helpers/json-editor/json-form-helpers/addOrUpdateNestedSchema.ts:25:13
       return {
         ...currentSchema, // Копируем текущий уровень
         [key]: existingValue
-          ? {
-              ...(existingValue as Record<string, unknown>), // Если значение есть - мерджим с новой схемой
-              ...nestedSchema,
-              properties: {
-                // Мерджим свойства, чтобы не потерять существующие
-                ...((existingValue as Record<string, unknown>)?.properties as Record<string, unknown>),
-                ...nestedSchema?.properties,
-              },
-            }
+          ? {}
           : nestedSchema,
       };
killedBy: /src/components/jsonEditor/json-schema-form/JsonSchemaFormRow should add new property to nested object schema
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "object"
Received: undefined

[Survived] OptionalChaining
helpers/json-editor/json-form-helpers/addOrUpdateNestedSchema.ts:31:20
               properties: {
                 // Мерджим свойства, чтобы не потерять существующие
                 ...((existingValue as Record<string, unknown>)?.properties as Record<string, unknown>),
-                ...nestedSchema?.properties,
+                ...nestedSchema.properties,
               },
             }

[Survived] LogicalOperator
helpers/json-editor/json-form-helpers/addOrUpdateNestedSchema.ts:40:24
 
     // Разбираем путь на текущий ключ и остаток
     const [currentKey, ...restPath] = remainingPath;
-    const nextSchema = currentSchema[currentKey] || {}; // Берем следующую вложенность или пустой объект
+    const nextSchema = currentSchema[currentKey] && {}; // Берем следующую вложенность или пустой объект
 
     return {

[Survived] ObjectLiteral
helpers/json-editor/json-form-helpers/addOrUpdateNestedSchema.ts:44:34
 
     return {
       ...currentSchema,
-      [currentKey]: updateSchema({...(nextSchema as Record<string, unknown>)}, restPath),
+      [currentKey]: updateSchema({}, restPath),
     };
   };
