[NoCoverage] BlockStatement
src/helpers/copy-to-clipboard.ts:1:56
-export const copyToClipboard = async (text: string) => {
-  try {
-    await navigator.clipboard.writeText(text);
-  } catch (err) {
-    console.error('Не удалось скопировать текст: ', err);
-  }
-};
+export const copyToClipboard = async (text: string) => {};
 

[NoCoverage] BlockStatement
src/helpers/copy-to-clipboard.ts:2:7
 export const copyToClipboard = async (text: string) => {
-  try {
-    await navigator.clipboard.writeText(text);
-  } catch (err) {
+  try {} catch (err) {
     console.error('Не удалось скопировать текст: ', err);
   }

[NoCoverage] BlockStatement
src/helpers/copy-to-clipboard.ts:4:17
 export const copyToClipboard = async (text: string) => {
   try {
     await navigator.clipboard.writeText(text);
-  } catch (err) {
-    console.error('Не удалось скопировать текст: ', err);
-  }
+  } catch (err) {}
 };
 
