[Survived] ArrowFunction
src/helpers/SimpleValues.ts:12:23
     super(...(values as [])); // хак, чтобы не переусложнять типизацию
 
     // eslint-disable-next-line no-constructor-return
-    return values.map(value => ({
-      label: value,
-      value,
-    }));
+    return values.map(() => undefined);
   }
 }
