[Survived] StringLiteral
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:50:39
       <SelectField
         data-testid="create-link-drawer-service-select"
         className="mb-2"
-        dropdownStyle={{borderRadius: '3px'}}
+        dropdownStyle={{borderRadius: ""}}
         label="Service"
         fieldName={fromNodeFieldName}

[Survived] LogicalOperator
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:53:18
         dropdownStyle={{borderRadius: '3px'}}
         label="Service"
         fieldName={fromNodeFieldName}
-        options={serviceOptions ?? []}
+        options={serviceOptions && []}
         control={methods.control}
       />

[Survived] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:67:24
           <RadioButton
             style={{borderRadius: '3px 0 0 3px'}}
             value="TOPIC"
-            isChecked={objectToConnectField.value === EObjectToConnect.TOPIC}
+            isChecked={true}
           >
             Topic

[Survived] EqualityOperator
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:67:24
           <RadioButton
             style={{borderRadius: '3px 0 0 3px'}}
             value="TOPIC"
-            isChecked={objectToConnectField.value === EObjectToConnect.TOPIC}
+            isChecked={objectToConnectField.value !== EObjectToConnect.TOPIC}
           >
             Topic

[Survived] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:75:24
           <RadioButton
             style={{borderRadius: '0 3px 3px 0'}}
             value={EObjectToConnect.HTTP_NODE}
-            isChecked={objectToConnectField.value === EObjectToConnect.HTTP_NODE}
+            isChecked={false}
             onClick={() => {
               // @ts-ignore

[Survived] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:75:24
           <RadioButton
             style={{borderRadius: '0 3px 3px 0'}}
             value={EObjectToConnect.HTTP_NODE}
-            isChecked={objectToConnectField.value === EObjectToConnect.HTTP_NODE}
+            isChecked={true}
             onClick={() => {
               // @ts-ignore

[NoCoverage] BlockStatement
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:76:28
             style={{borderRadius: '0 3px 3px 0'}}
             value={EObjectToConnect.HTTP_NODE}
             isChecked={objectToConnectField.value === EObjectToConnect.HTTP_NODE}
-            onClick={() => {
-              // @ts-ignore
-              methods.setValue(connectionTypeFieldName, CONSUME);
-            }}
+            onClick={() => {}}
           >
             HTTP-node

[Survived] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:86:8
         </RadioGroup>
       </FormItem>
 
-      {objectToConnectField.value === EObjectToConnect.TOPIC ? (
+      {false ? (
         <SelectField
           data-testid="create-link-drawer-topic-select"

[Survived] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:86:8
         </RadioGroup>
       </FormItem>
 
-      {objectToConnectField.value === EObjectToConnect.TOPIC ? (
+      {true ? (
         <SelectField
           data-testid="create-link-drawer-topic-select"

[NoCoverage] LogicalOperator
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:92:20
           className="mb-2"
           dropdownStyle={{borderRadius: '3px'}}
           fieldName={toNodeFieldName}
-          options={topicOptions ?? []}
+          options={topicOptions && []}
           control={methods.control}
         />

[Survived] ObjectLiteral
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:98:26
       ) : (
         <SelectField
           className="mb-2"
-          dropdownStyle={{borderRadius: '3px'}}
+          dropdownStyle={{}}
           fieldName={toNodeFieldName}
           options={httpOptions ?? []}

[Survived] LogicalOperator
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:100:20
           className="mb-2"
           dropdownStyle={{borderRadius: '3px'}}
           fieldName={toNodeFieldName}
-          options={httpOptions ?? []}
+          options={httpOptions && []}
           control={methods.control}
         />

[Survived] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:115:24
           <RadioButton
             style={{borderRadius: '3px 0 0 3px'}}
             value={PRODUCE}
-            isChecked={connectionTypeField.value === PRODUCE}
+            isChecked={true}
             isDisabled={objectToConnectField.value === EObjectToConnect.HTTP_NODE}
           >

[Survived] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:115:24
           <RadioButton
             style={{borderRadius: '3px 0 0 3px'}}
             value={PRODUCE}
-            isChecked={connectionTypeField.value === PRODUCE}
+            isChecked={false}
             isDisabled={objectToConnectField.value === EObjectToConnect.HTTP_NODE}
           >

[Survived] EqualityOperator
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:116:25
             style={{borderRadius: '3px 0 0 3px'}}
             value={PRODUCE}
             isChecked={connectionTypeField.value === PRODUCE}
-            isDisabled={objectToConnectField.value === EObjectToConnect.HTTP_NODE}
+            isDisabled={objectToConnectField.value !== EObjectToConnect.HTTP_NODE}
           >
             Produce

[Survived] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:116:25
             style={{borderRadius: '3px 0 0 3px'}}
             value={PRODUCE}
             isChecked={connectionTypeField.value === PRODUCE}
-            isDisabled={objectToConnectField.value === EObjectToConnect.HTTP_NODE}
+            isDisabled={false}
           >
             Produce

[Survived] StringLiteral
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:122:35
           </RadioButton>
 
           <RadioButton
-            style={{borderRadius: '0 3px 3px 0'}}
+            style={{borderRadius: ""}}
             value={CONSUME}
             isChecked={connectionTypeField.value === CONSUME}

[Survived] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:124:24
           <RadioButton
             style={{borderRadius: '0 3px 3px 0'}}
             value={CONSUME}
-            isChecked={connectionTypeField.value === CONSUME}
+            isChecked={true}
           >
             Consume

[Survived] ConditionalExpression
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:124:24
           <RadioButton
             style={{borderRadius: '0 3px 3px 0'}}
             value={CONSUME}
-            isChecked={connectionTypeField.value === CONSUME}
+            isChecked={false}
           >
             Consume

[Survived] StringLiteral
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:134:39
       <SelectField
         data-testid="create-link-drawer-event-select"
         className="mb-0"
-        dropdownStyle={{borderRadius: '3px'}}
+        dropdownStyle={{borderRadius: ""}}
         label="Event"
         fieldName={eventFieldName}

[Survived] LogicalOperator
diagram/modals/drawer-link-modal/DrawerLinkItem.tsx:137:18
         dropdownStyle={{borderRadius: '3px'}}
         label="Event"
         fieldName={eventFieldName}
-        options={eventsOptions ?? []}
+        options={eventsOptions && []}
         control={methods.control}
       />
