[Killed] EqualityOperator
src/helpers/modal-helpers/getDeterminedLinkIds.ts:17:10
   const id = uuidV4();
 
   switch (true) {
-    case link.objectToConnect === EObjectToConnect.HTTP_NODE:
+    case link.objectToConnect !== EObjectToConnect.HTTP_NODE:
       return {
         id,
killedBy: getDeterminedLinkIds should correctly determine IDs for PRODUCE connection type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "eventId": "event-id",
-   "fromId": "producer-id",

[Killed] ConditionalExpression
src/helpers/modal-helpers/getDeterminedLinkIds.ts:17:10
   const id = uuidV4();
 
   switch (true) {
-    case link.objectToConnect === EObjectToConnect.HTTP_NODE:
+    case true:
       return {
         id,
killedBy: getDeterminedLinkIds should correctly determine IDs for PRODUCE connection type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "eventId": "event-id",
-   "fromId": "producer-id",

[Killed] ConditionalExpression
src/helpers/modal-helpers/getDeterminedLinkIds.ts:25:5
         eventId: link.eventId,
       };
 
-    case type === EConnectionType.CONSUME:
-      // toId и fromId меняются местами, т.к. по дефолту в fromId заполняется service
-      return {
-        id,
-        fromId: link.toId,
-        toId: link.fromId,
-        eventId: link.eventId,
-      };
+    case type === EConnectionType.CONSUME:
 
     case type === EConnectionType.PRODUCE:
killedBy: getDeterminedLinkIds should correctly determine IDs for CONSUME connection type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "eventId": "event-id",
-   "fromId": "consumer-id",

[Killed] ConditionalExpression
src/helpers/modal-helpers/getDeterminedLinkIds.ts:25:10
         eventId: link.eventId,
       };
 
-    case type === EConnectionType.CONSUME:
+    case true:
       // toId и fromId меняются местами, т.к. по дефолту в fromId заполняется service
       return {
killedBy: getDeterminedLinkIds should correctly determine IDs for PRODUCE connection type
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "eventId": "event-id",
-   "fromId": "producer-id",

[Killed] EqualityOperator
src/helpers/modal-helpers/getDeterminedLinkIds.ts:34:10
         eventId: link.eventId,
       };
 
-    case type === EConnectionType.PRODUCE:
+    case type !== EConnectionType.PRODUCE:
       return {
         id,
killedBy: getDeterminedLinkIds should correctly determine IDs for PRODUCE connection type
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"eventId": "event-id", "fromId": "producer-id", "id": "mock-uuid", "toId": "service-id"}
Received: null

[Killed] ConditionalExpression
src/helpers/modal-helpers/getDeterminedLinkIds.ts:34:5
         eventId: link.eventId,
       };
 
-    case type === EConnectionType.PRODUCE:
-      return {
-        id,
-        fromId: link.fromId,
-        toId: link.toId,
-        eventId: link.eventId,
-      };
+    case type === EConnectionType.PRODUCE:
 
     default:
killedBy: getDeterminedLinkIds should correctly determine IDs for PRODUCE connection type
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"eventId": "event-id", "fromId": "producer-id", "id": "mock-uuid", "toId": "service-id"}
Received: null
