[NoCoverage] EqualityOperator
src/helpers/modal-helpers/getLinkFormData.ts:5:50
 import {NodeDTO, NodeDTOTypeEnum} from '@/shared/api/event-graph-api';
 
 export const getLinkFormData = (nodes: NodeDTO[], fromId: string, toId: string) => {
-  const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
+  const serviceNodes = nodes?.filter(({type}) => type !== NodeDTOTypeEnum.Service);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);

[NoCoverage] ConditionalExpression
src/helpers/modal-helpers/getLinkFormData.ts:5:50
 import {NodeDTO, NodeDTOTypeEnum} from '@/shared/api/event-graph-api';
 
 export const getLinkFormData = (nodes: NodeDTO[], fromId: string, toId: string) => {
-  const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
+  const serviceNodes = nodes?.filter(({type}) => false);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);

[Survived] OptionalChaining
src/helpers/modal-helpers/getLinkFormData.ts:6:22
 
 export const getLinkFormData = (nodes: NodeDTO[], fromId: string, toId: string) => {
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
-  const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
+  const topicNodes = nodes.filter(({type}) => type === NodeDTOTypeEnum.Topic);
   const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
 

[Survived] OptionalChaining
src/helpers/modal-helpers/getLinkFormData.ts:7:21
 export const getLinkFormData = (nodes: NodeDTO[], fromId: string, toId: string) => {
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
-  const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
+  const httpNodes = nodes.filter(({type}) => type === NodeDTOTypeEnum.Http);
 
   let serviceNode;

[NoCoverage] ConditionalExpression
src/helpers/modal-helpers/getLinkFormData.ts:7:47
 export const getLinkFormData = (nodes: NodeDTO[], fromId: string, toId: string) => {
   const serviceNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Service);
   const topicNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Topic);
-  const httpNodes = nodes?.filter(({type}) => type === NodeDTOTypeEnum.Http);
+  const httpNodes = nodes?.filter(({type}) => true);
 
   let serviceNode;

[Survived] OptionalChaining
src/helpers/modal-helpers/getLinkFormData.ts:15:36
   let objectToConnect: EObjectToConnect;
   let httpNode;
 
-  const fromServiceNode: NodeDTO = serviceNodes?.find(({id}) => id === fromId);
+  const fromServiceNode: NodeDTO = serviceNodes.find(({id}) => id === fromId);
   const toServiceNode = serviceNodes?.find(({id}) => id === toId);
 

[NoCoverage] EqualityOperator
src/helpers/modal-helpers/getLinkFormData.ts:15:65
   let objectToConnect: EObjectToConnect;
   let httpNode;
 
-  const fromServiceNode: NodeDTO = serviceNodes?.find(({id}) => id === fromId);
+  const fromServiceNode: NodeDTO = serviceNodes?.find(({id}) => id !== fromId);
   const toServiceNode = serviceNodes?.find(({id}) => id === toId);
 

[NoCoverage] ConditionalExpression
src/helpers/modal-helpers/getLinkFormData.ts:16:54
   let httpNode;
 
   const fromServiceNode: NodeDTO = serviceNodes?.find(({id}) => id === fromId);
-  const toServiceNode = serviceNodes?.find(({id}) => id === toId);
+  const toServiceNode = serviceNodes?.find(({id}) => true);
 
   if (fromServiceNode) {

[Survived] OptionalChaining
src/helpers/modal-helpers/getLinkFormData.ts:16:25
   let httpNode;
 
   const fromServiceNode: NodeDTO = serviceNodes?.find(({id}) => id === fromId);
-  const toServiceNode = serviceNodes?.find(({id}) => id === toId);
+  const toServiceNode = serviceNodes.find(({id}) => id === toId);
 
   if (fromServiceNode) {

[Survived] ConditionalExpression
src/helpers/modal-helpers/getLinkFormData.ts:18:7
   const fromServiceNode: NodeDTO = serviceNodes?.find(({id}) => id === fromId);
   const toServiceNode = serviceNodes?.find(({id}) => id === toId);
 
-  if (fromServiceNode) {
+  if (false) {
     serviceNode = fromServiceNode;
     connectionType = EConnectionType.PRODUCE;

[Survived] ConditionalExpression
src/helpers/modal-helpers/getLinkFormData.ts:18:7
   const fromServiceNode: NodeDTO = serviceNodes?.find(({id}) => id === fromId);
   const toServiceNode = serviceNodes?.find(({id}) => id === toId);
 
-  if (fromServiceNode) {
+  if (true) {
     serviceNode = fromServiceNode;
     connectionType = EConnectionType.PRODUCE;

[NoCoverage] ConditionalExpression
src/helpers/modal-helpers/getLinkFormData.ts:21:44
   if (fromServiceNode) {
     serviceNode = fromServiceNode;
     connectionType = EConnectionType.PRODUCE;
-    topicNode = topicNodes?.find(({id}) => id === toId);
+    topicNode = topicNodes?.find(({id}) => false);
     objectToConnect = EObjectToConnect.TOPIC;
   }

[NoCoverage] ArrowFunction
src/helpers/modal-helpers/getLinkFormData.ts:21:34
   if (fromServiceNode) {
     serviceNode = fromServiceNode;
     connectionType = EConnectionType.PRODUCE;
-    topicNode = topicNodes?.find(({id}) => id === toId);
+    topicNode = topicNodes?.find(() => undefined);
     objectToConnect = EObjectToConnect.TOPIC;
   }

[NoCoverage] ConditionalExpression
src/helpers/modal-helpers/getLinkFormData.ts:28:54
   if (toServiceNode) {
     serviceNode = toServiceNode;
     connectionType = EConnectionType.CONSUME;
-    const fromTopicNode = topicNodes?.find(({id}) => id === fromId);
+    const fromTopicNode = topicNodes?.find(({id}) => false);
 
     if (fromTopicNode) {

[NoCoverage] ConditionalExpression
src/helpers/modal-helpers/getLinkFormData.ts:28:54
   if (toServiceNode) {
     serviceNode = toServiceNode;
     connectionType = EConnectionType.CONSUME;
-    const fromTopicNode = topicNodes?.find(({id}) => id === fromId);
+    const fromTopicNode = topicNodes?.find(({id}) => true);
 
     if (fromTopicNode) {

[NoCoverage] ConditionalExpression
src/helpers/modal-helpers/getLinkFormData.ts:30:9
     connectionType = EConnectionType.CONSUME;
     const fromTopicNode = topicNodes?.find(({id}) => id === fromId);
 
-    if (fromTopicNode) {
+    if (false) {
       topicNode = fromTopicNode;
       objectToConnect = EObjectToConnect.TOPIC;

[NoCoverage] BlockStatement
src/helpers/modal-helpers/getLinkFormData.ts:30:24
     connectionType = EConnectionType.CONSUME;
     const fromTopicNode = topicNodes?.find(({id}) => id === fromId);
 
-    if (fromTopicNode) {
-      topicNode = fromTopicNode;
-      objectToConnect = EObjectToConnect.TOPIC;
-    } else {
+    if (fromTopicNode) {} else {
       httpNode = httpNodes?.find(({id}) => id === fromId);
       objectToConnect = EObjectToConnect.HTTP_NODE;

[NoCoverage] ArrowFunction
src/helpers/modal-helpers/getLinkFormData.ts:34:34
       topicNode = fromTopicNode;
       objectToConnect = EObjectToConnect.TOPIC;
     } else {
-      httpNode = httpNodes?.find(({id}) => id === fromId);
+      httpNode = httpNodes?.find(() => undefined);
       objectToConnect = EObjectToConnect.HTTP_NODE;
     }

[NoCoverage] EqualityOperator
src/helpers/modal-helpers/getLinkFormData.ts:34:44
       topicNode = fromTopicNode;
       objectToConnect = EObjectToConnect.TOPIC;
     } else {
-      httpNode = httpNodes?.find(({id}) => id === fromId);
+      httpNode = httpNodes?.find(({id}) => id !== fromId);
       objectToConnect = EObjectToConnect.HTTP_NODE;
     }
