[NoCoverage] ConditionalExpression
src/components/jsonEditor/JsonEditorContent.tsx:20:60
   const currentEvent = useUnit($selectedMenuItem);
   const eventGraph = useUnit($eventGraph);
   // Отобранный эвент из графа на основе выбранного эвента.
-  const selectedEventData = eventGraph?.events?.find(el => el?.id === currentEvent?.id);
+  const selectedEventData = eventGraph?.events?.find(el => true);
 
   const tagOptions = eventGraph && eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];

[NoCoverage] ConditionalExpression
src/components/jsonEditor/JsonEditorContent.tsx:22:22
   // Отобранный эвент из графа на основе выбранного эвента.
   const selectedEventData = eventGraph?.events?.find(el => el?.id === currentEvent?.id);
 
-  const tagOptions = eventGraph && eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];
+  const tagOptions = true ? new SimpleValues(...eventGraph.tags) : [];
   // Отфильтрованные теги для отображения в выпадающем списке
   const filteredTagOptions = tagOptions?.filter(el => !selectedEventData?.tags?.includes(el.label));

[NoCoverage] ConditionalExpression
src/components/jsonEditor/JsonEditorContent.tsx:22:22
   // Отобранный эвент из графа на основе выбранного эвента.
   const selectedEventData = eventGraph?.events?.find(el => el?.id === currentEvent?.id);
 
-  const tagOptions = eventGraph && eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];
+  const tagOptions = false ? new SimpleValues(...eventGraph.tags) : [];
   // Отфильтрованные теги для отображения в выпадающем списке
   const filteredTagOptions = tagOptions?.filter(el => !selectedEventData?.tags?.includes(el.label));

[NoCoverage] ArrowFunction
src/components/jsonEditor/JsonEditorContent.tsx:24:49
 
   const tagOptions = eventGraph && eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];
   // Отфильтрованные теги для отображения в выпадающем списке
-  const filteredTagOptions = tagOptions?.filter(el => !selectedEventData?.tags?.includes(el.label));
+  const filteredTagOptions = tagOptions?.filter(() => undefined);
 
   const {contextHandler: jsonEditorNotificationContextHandler} = useJsonEditorNotification();

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:24:56
 
   const tagOptions = eventGraph && eventGraph.tags ? new SimpleValues(...eventGraph.tags) : [];
   // Отфильтрованные теги для отображения в выпадающем списке
-  const filteredTagOptions = tagOptions?.filter(el => !selectedEventData?.tags?.includes(el.label));
+  const filteredTagOptions = tagOptions?.filter(el => !selectedEventData.tags?.includes(el.label));
 
   const {contextHandler: jsonEditorNotificationContextHandler} = useJsonEditorNotification();

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:27:48
   const filteredTagOptions = tagOptions?.filter(el => !selectedEventData?.tags?.includes(el.label));
 
   const {contextHandler: jsonEditorNotificationContextHandler} = useJsonEditorNotification();
-  const [schema, setSchema] = useState<string>(selectedEventData?.schema);
+  const [schema, setSchema] = useState<string>(selectedEventData.schema);
   const [isEditorChosen, setIsEditorChosen] = useState<boolean>(true);
   const [isDataExampleChosen, setIsDataExampleChosen] = useState<boolean>(false);

[NoCoverage] BooleanLiteral
src/components/jsonEditor/JsonEditorContent.tsx:28:65
 
   const {contextHandler: jsonEditorNotificationContextHandler} = useJsonEditorNotification();
   const [schema, setSchema] = useState<string>(selectedEventData?.schema);
-  const [isEditorChosen, setIsEditorChosen] = useState<boolean>(true);
+  const [isEditorChosen, setIsEditorChosen] = useState<boolean>(false);
   const [isDataExampleChosen, setIsDataExampleChosen] = useState<boolean>(false);
   const [isAddTagOpen, setIsAddTagOpen] = useState<boolean>(false);

[NoCoverage] BooleanLiteral
src/components/jsonEditor/JsonEditorContent.tsx:29:75
   const {contextHandler: jsonEditorNotificationContextHandler} = useJsonEditorNotification();
   const [schema, setSchema] = useState<string>(selectedEventData?.schema);
   const [isEditorChosen, setIsEditorChosen] = useState<boolean>(true);
-  const [isDataExampleChosen, setIsDataExampleChosen] = useState<boolean>(false);
+  const [isDataExampleChosen, setIsDataExampleChosen] = useState<boolean>(true);
   const [isAddTagOpen, setIsAddTagOpen] = useState<boolean>(false);
 

[NoCoverage] BooleanLiteral
src/components/jsonEditor/JsonEditorContent.tsx:30:61
   const [schema, setSchema] = useState<string>(selectedEventData?.schema);
   const [isEditorChosen, setIsEditorChosen] = useState<boolean>(true);
   const [isDataExampleChosen, setIsDataExampleChosen] = useState<boolean>(false);
-  const [isAddTagOpen, setIsAddTagOpen] = useState<boolean>(false);
+  const [isAddTagOpen, setIsAddTagOpen] = useState<boolean>(true);
 
   // Проверка наличия элемента с соответствующим id

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:33:32
   const [isAddTagOpen, setIsAddTagOpen] = useState<boolean>(false);
 
   // Проверка наличия элемента с соответствующим id
-  const eventDataHasSelected = eventGraph?.events?.some(event => event?.id === selectedEventData?.id);
+  const eventDataHasSelected = eventGraph?.events.some(event => event?.id === selectedEventData?.id);
 
   const handleSchemaChange = (value: string | undefined) => {

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:33:80
   const [isAddTagOpen, setIsAddTagOpen] = useState<boolean>(false);
 
   // Проверка наличия элемента с соответствующим id
-  const eventDataHasSelected = eventGraph?.events?.some(event => event?.id === selectedEventData?.id);
+  const eventDataHasSelected = eventGraph?.events?.some(event => event?.id === selectedEventData.id);
 
   const handleSchemaChange = (value: string | undefined) => {

[NoCoverage] BlockStatement
src/components/jsonEditor/JsonEditorContent.tsx:35:61
   // Проверка наличия элемента с соответствующим id
   const eventDataHasSelected = eventGraph?.events?.some(event => event?.id === selectedEventData?.id);
 
-  const handleSchemaChange = (value: string | undefined) => {
-    setSchema(value);
-  };
+  const handleSchemaChange = (value: string | undefined) => {};
 
   const handleSaveSchema = () => {

[NoCoverage] BlockStatement
src/components/jsonEditor/JsonEditorContent.tsx:39:34
     setSchema(value);
   };
 
-  const handleSaveSchema = () => {
-    editEvent({id: selectedEventData?.id, updates: {schema}});
-  };
+  const handleSaveSchema = () => {};
 
   useEffect(() => {

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:40:20
   };
 
   const handleSaveSchema = () => {
-    editEvent({id: selectedEventData?.id, updates: {schema}});
+    editEvent({id: selectedEventData.id, updates: {schema}});
   };
 

[NoCoverage] BlockStatement
src/components/jsonEditor/JsonEditorContent.tsx:43:19
     editEvent({id: selectedEventData?.id, updates: {schema}});
   };
 
-  useEffect(() => {
-    setSchema(selectedEventData?.schema);
-  }, [selectedEventData]);
+  useEffect(() => {}, [selectedEventData]);
 
   return (

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:44:15
   };
 
   useEffect(() => {
-    setSchema(selectedEventData?.schema);
+    setSchema(selectedEventData.schema);
   }, [selectedEventData]);
 

[NoCoverage] ArrayDeclaration
src/components/jsonEditor/JsonEditorContent.tsx:45:6
 
   useEffect(() => {
     setSchema(selectedEventData?.schema);
-  }, [selectedEventData]);
+  }, []);
 
   return (

[NoCoverage] StringLiteral
src/components/jsonEditor/JsonEditorContent.tsx:57:39
         >
           <div className="flex min-h-[160px] w-full justify-between pt-10">
             <div className="flex h-full flex-col items-start justify-between">
-              <Text style={{fontSize: '24px'}} isStrong>
+              <Text style={{fontSize: ""}} isStrong>
                 {selectedEventData?.name}
               </Text>

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:58:18
           <div className="flex min-h-[160px] w-full justify-between pt-10">
             <div className="flex h-full flex-col items-start justify-between">
               <Text style={{fontSize: '24px'}} isStrong>
-                {selectedEventData?.name}
+                {selectedEventData.name}
               </Text>
 

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:62:18
               </Text>
 
               <Row className="flex cursor-pointer items-center gap-2">
-                {selectedEventData?.tags?.map(tag => (
+                {selectedEventData.tags?.map(tag => (
                   <Tag
                     className="mr-0"

[NoCoverage] ArrowFunction
src/components/jsonEditor/JsonEditorContent.tsx:62:47
               </Text>
 
               <Row className="flex cursor-pointer items-center gap-2">
-                {selectedEventData?.tags?.map(tag => (
-                  <Tag
-                    className="mr-0"
-                    icon={
-                      <X
-                        size={10}
-                        onClick={() => {
-                          editEvent({
-                            id: selectedEventData?.id,
-                            updates: {tags: selectedEventData?.tags.filter(el => el !== tag)},
-                          });
-                        }}
-                      />
-                    }
-                  >
-                    {tag}
-                  </Tag>
-                ))}
+                {selectedEventData?.tags?.map(() => undefined)}
 
                 {!isAddTagOpen && (

[NoCoverage] BlockStatement
src/components/jsonEditor/JsonEditorContent.tsx:68:40
                     icon={
                       <X
                         size={10}
-                        onClick={() => {
-                          editEvent({
-                            id: selectedEventData?.id,
-                            updates: {tags: selectedEventData?.tags.filter(el => el !== tag)},
-                          });
-                        }}
+                        onClick={() => {}}
                       />
                     }

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:70:33
                         size={10}
                         onClick={() => {
                           editEvent({
-                            id: selectedEventData?.id,
+                            id: selectedEventData.id,
                             updates: {tags: selectedEventData?.tags.filter(el => el !== tag)},
                           });

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:71:45
                         onClick={() => {
                           editEvent({
                             id: selectedEventData?.id,
-                            updates: {tags: selectedEventData?.tags.filter(el => el !== tag)},
+                            updates: {tags: selectedEventData.tags.filter(el => el !== tag)},
                           });
                         }}

[NoCoverage] MethodExpression
src/components/jsonEditor/JsonEditorContent.tsx:71:45
                         onClick={() => {
                           editEvent({
                             id: selectedEventData?.id,
-                            updates: {tags: selectedEventData?.tags.filter(el => el !== tag)},
+                            updates: {tags: selectedEventData?.tags},
                           });
                         }}

[NoCoverage] ConditionalExpression
src/components/jsonEditor/JsonEditorContent.tsx:81:18
                   </Tag>
                 ))}
 
-                {!isAddTagOpen && (
-                  <div className="flex items-center" onClick={() => setIsAddTagOpen(true)}>
-                    <Tag icon={<Plus size={16} />}>Add tag</Tag>
-                  </div>
-                )}
+                {false}
 
                 {isAddTagOpen && (

[NoCoverage] BooleanLiteral
src/components/jsonEditor/JsonEditorContent.tsx:81:18
                   </Tag>
                 ))}
 
-                {!isAddTagOpen && (
+                {isAddTagOpen && (
                   <div className="flex items-center" onClick={() => setIsAddTagOpen(true)}>
                     <Tag icon={<Plus size={16} />}>Add tag</Tag>

[NoCoverage] BooleanLiteral
src/components/jsonEditor/JsonEditorContent.tsx:82:85
                 ))}
 
                 {!isAddTagOpen && (
-                  <div className="flex items-center" onClick={() => setIsAddTagOpen(true)}>
+                  <div className="flex items-center" onClick={() => setIsAddTagOpen(false)}>
                     <Tag icon={<Plus size={16} />}>Add tag</Tag>
                   </div>

[NoCoverage] ArrowFunction
src/components/jsonEditor/JsonEditorContent.tsx:82:63
                 ))}
 
                 {!isAddTagOpen && (
-                  <div className="flex items-center" onClick={() => setIsAddTagOpen(true)}>
+                  <div className="flex items-center" onClick={() => undefined}>
                     <Tag icon={<Plus size={16} />}>Add tag</Tag>
                   </div>

[NoCoverage] ConditionalExpression
src/components/jsonEditor/JsonEditorContent.tsx:87:18
                   </div>
                 )}
 
-                {isAddTagOpen && (
-                  <UIKitMultipleSelect
-                    className="max-h-[32px] min-w-[302px] [&>div]:rounded-[3px]"
-                    dropdownStyle={{borderRadius: '3px'}}
-                    isAllowClear
-                    maxTagTextLength={8}
-                    maxTagCount={2}
-                    mode="multiple"
-                    style={{borderRadius: '3px'}}
-                    options={filteredTagOptions}
-                    onAddOption={addTag}
-                    data-testid="add-tag-select"
-                    isAddOption
-                    onChange={value => {
-                      addTagToEvent({id: selectedEventData?.id, newTag: value});
-                      setIsAddTagOpen(false);
-                    }}
-                  />
-                )}
+                {true}
               </Row>
 

[NoCoverage] LogicalOperator
src/components/jsonEditor/JsonEditorContent.tsx:87:18
                   </div>
                 )}
 
-                {isAddTagOpen && (
-                  <UIKitMultipleSelect
-                    className="max-h-[32px] min-w-[302px] [&>div]:rounded-[3px]"
-                    dropdownStyle={{borderRadius: '3px'}}
-                    isAllowClear
-                    maxTagTextLength={8}
-                    maxTagCount={2}
-                    mode="multiple"
-                    style={{borderRadius: '3px'}}
-                    options={filteredTagOptions}
-                    onAddOption={addTag}
-                    data-testid="add-tag-select"
-                    isAddOption
-                    onChange={value => {
-                      addTagToEvent({id: selectedEventData?.id, newTag: value});
-                      setIsAddTagOpen(false);
-                    }}
-                  />
-                )}
+                {isAddTagOpen || <UIKitMultipleSelect className="max-h-[32px] min-w-[302px] [&>div]:rounded-[3px]" dropdownStyle={{
+  borderRadius: '3px'
+}} isAllowClear maxTagTextLength={8} maxTagCount={2} mode="multiple" style={{
+  borderRadius: '3px'
+}} options={filteredTagOptions} onAddOption={addTag} data-testid="add-tag-select" isAddOption onChange={value => {
+  addTagToEvent({
+    id: selectedEventData?.id,
+    newTag: value
+  });
+  setIsAddTagOpen(false);
+}} />}
               </Row>
 

[NoCoverage] BlockStatement
src/components/jsonEditor/JsonEditorContent.tsx:100:40
                     onAddOption={addTag}
                     data-testid="add-tag-select"
                     isAddOption
-                    onChange={value => {
-                      addTagToEvent({id: selectedEventData?.id, newTag: value});
-                      setIsAddTagOpen(false);
-                    }}
+                    onChange={value => {}}
                   />
                 )}

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:101:42
                     data-testid="add-tag-select"
                     isAddOption
                     onChange={value => {
-                      addTagToEvent({id: selectedEventData?.id, newTag: value});
+                      addTagToEvent({id: selectedEventData.id, newTag: value});
                       setIsAddTagOpen(false);
                     }}

[NoCoverage] BooleanLiteral
src/components/jsonEditor/JsonEditorContent.tsx:102:39
                     isAddOption
                     onChange={value => {
                       addTagToEvent({id: selectedEventData?.id, newTag: value});
-                      setIsAddTagOpen(false);
+                      setIsAddTagOpen(true);
                     }}
                   />

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:109:56
               </Row>
 
               <Text className="text-[#A1A1A1]">
-                {selectedEventData?.eventDescription ? selectedEventData?.eventDescription : 'Event description'}
+                {selectedEventData?.eventDescription ? selectedEventData.eventDescription : 'Event description'}
               </Text>
             </div>

[NoCoverage] OptionalChaining
src/components/jsonEditor/JsonEditorContent.tsx:109:18
               </Row>
 
               <Text className="text-[#A1A1A1]">
-                {selectedEventData?.eventDescription ? selectedEventData?.eventDescription : 'Event description'}
+                {selectedEventData.eventDescription ? selectedEventData?.eventDescription : 'Event description'}
               </Text>
             </div>

[NoCoverage] BlockStatement
src/components/jsonEditor/JsonEditorContent.tsx:121:36
                     icon: <List />,
                     key: 'form',
                     label: 'Form',
-                    onClick: () => {
-                      setIsEditorChosen(false);
-                    },
+                    onClick: () => {},
                   },
                   {

[NoCoverage] BooleanLiteral
src/components/jsonEditor/JsonEditorContent.tsx:122:41
                     key: 'form',
                     label: 'Form',
                     onClick: () => {
-                      setIsEditorChosen(false);
+                      setIsEditorChosen(true);
                     },
                   },

[NoCoverage] StringLiteral
src/components/jsonEditor/JsonEditorContent.tsx:128:28
                   {
                     icon: <Code />,
                     key: 'code',
-                    label: 'Code',
+                    label: "",
                     onClick: () => {
                       setIsEditorChosen(true);

[NoCoverage] BlockStatement
src/components/jsonEditor/JsonEditorContent.tsx:129:36
                     icon: <Code />,
                     key: 'code',
                     label: 'Code',
-                    onClick: () => {
-                      setIsEditorChosen(true);
-                    },
+                    onClick: () => {},
                   },
                 ]}

[NoCoverage] BooleanLiteral
src/components/jsonEditor/JsonEditorContent.tsx:130:41
                     key: 'code',
                     label: 'Code',
                     onClick: () => {
-                      setIsEditorChosen(true);
+                      setIsEditorChosen(false);
                     },
                   },

[NoCoverage] StringLiteral
src/components/jsonEditor/JsonEditorContent.tsx:144:24
             <Menu
               items={[
                 {
-                  key: 'schema',
+                  key: "",
                   label: 'Schema',
                   onClick: () => setIsDataExampleChosen(false),

[NoCoverage] BooleanLiteral
src/components/jsonEditor/JsonEditorContent.tsx:146:57
                 {
                   key: 'schema',
                   label: 'Schema',
-                  onClick: () => setIsDataExampleChosen(false),
+                  onClick: () => setIsDataExampleChosen(true),
                 },
                 {

[NoCoverage] ArrowFunction
src/components/jsonEditor/JsonEditorContent.tsx:146:28
                 {
                   key: 'schema',
                   label: 'Schema',
-                  onClick: () => setIsDataExampleChosen(false),
+                  onClick: () => undefined,
                 },
                 {

[NoCoverage] ArrowFunction
src/components/jsonEditor/JsonEditorContent.tsx:151:28
                 {
                   key: 'example',
                   label: 'Data example',
-                  onClick: () => setIsDataExampleChosen(true),
+                  onClick: () => undefined,
                 },
               ]}

[NoCoverage] BooleanLiteral
src/components/jsonEditor/JsonEditorContent.tsx:151:57
                 {
                   key: 'example',
                   label: 'Data example',
-                  onClick: () => setIsDataExampleChosen(true),
+                  onClick: () => setIsDataExampleChosen(false),
                 },
               ]}

[NoCoverage] StringLiteral
src/components/jsonEditor/JsonEditorContent.tsx:155:37
                 },
               ]}
               mode="horizontal"
-              defaultSelectedKeys={['schema']}
+              defaultSelectedKeys={[""]}
             />
 

[NoCoverage] ArrayDeclaration
src/components/jsonEditor/JsonEditorContent.tsx:155:36
                 },
               ]}
               mode="horizontal"
-              defaultSelectedKeys={['schema']}
+              defaultSelectedKeys={[]}
             />
 
