[Killed] ConditionalExpression
src/helpers/adapters/adapt-diagram-links.tsx:19:10
   key1: string,
   key2: string
 ): boolean {
-  return seenPairs.has(key1) && seenPairs.has(key2);
+  return false;
 }
 
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2

[Killed] ConditionalExpression
src/helpers/adapters/adapt-diagram-links.tsx:19:10
   key1: string,
   key2: string
 ): boolean {
-  return seenPairs.has(key1) && seenPairs.has(key2);
+  return true;
 }
 
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] LogicalOperator
src/helpers/adapters/adapt-diagram-links.tsx:26:19
  * Возвращает значение поля data для "обычных" связей
  */
 function getLinkData (link: LinkDTO) {
-  const eventId = link.eventId ?? ''
+  const eventId = link.eventId && ''
 
   return {

[NoCoverage] StringLiteral
src/helpers/adapters/adapt-diagram-links.tsx:26:35
  * Возвращает значение поля data для "обычных" связей
  */
 function getLinkData (link: LinkDTO) {
-  const eventId = link.eventId ?? ''
+  const eventId = link.eventId ?? "Stryker was here!"
 
   return {

[Killed] LogicalOperator
src/helpers/adapters/adapt-diagram-links.tsx:35:7
 }
 
 export function adaptDiagramLinks(rawData: EventGraphDTO, expandableItems?: TExpandableItem[]): Edge[] {
-  if (!expandableItems || !expandableItems.length) return formatBaseLinks(rawData);
+  if (!expandableItems && !expandableItems.length) return formatBaseLinks(rawData);
 
   const seenPairs = new Set<string>(); // Множество для отслеживания уникальных пар (fromId, toId)
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: Error: ELK is not properly initialized

[Killed] ConditionalExpression
src/helpers/adapters/adapt-diagram-links.tsx:35:7
 }
 
 export function adaptDiagramLinks(rawData: EventGraphDTO, expandableItems?: TExpandableItem[]): Edge[] {
-  if (!expandableItems || !expandableItems.length) return formatBaseLinks(rawData);
+  if (true) return formatBaseLinks(rawData);
 
   const seenPairs = new Set<string>(); // Множество для отслеживания уникальных пар (fromId, toId)
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2

[Killed] OptionalChaining
src/helpers/adapters/adapt-diagram-links.tsx:40:3
   const seenPairs = new Set<string>(); // Множество для отслеживания уникальных пар (fromId, toId)
   const edges: Edge[] = [];
 
-  rawData.links?.forEach(el => {
+  rawData.links.forEach(el => {
     const currentExpandedItem = expandableItems?.find(item => getExpandableLinkId(el) === item.compoundLinkId);
     const isExpanded = currentExpandedItem?.isExpanded;
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should handle null links and not call forEach when expandableItems exist
statusReason: TypeError: Cannot read properties of null (reading 'forEach')

[Killed] ArrowFunction
src/helpers/adapters/adapt-diagram-links.tsx:41:55
   const edges: Edge[] = [];
 
   rawData.links?.forEach(el => {
-    const currentExpandedItem = expandableItems?.find(item => getExpandableLinkId(el) === item.compoundLinkId);
+    const currentExpandedItem = expandableItems?.find(() => undefined);
     const isExpanded = currentExpandedItem?.isExpanded;
     const linkType = getLinkType(el, rawData, currentExpandedItem?.isExpanded);
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 1
Received array:  [{"data": {}, "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef&b2c3d4e5-f678-9012-3456-7890abcdef01", "source": "b2c3d4e5-f678-9012-3456-7890abcdef01", "target": "a1b2c3d4-e5f6-7890-1234-567890abcdef", "type": "expandable"}]

[Killed] ConditionalExpression
src/helpers/adapters/adapt-diagram-links.tsx:41:63
   const edges: Edge[] = [];
 
   rawData.links?.forEach(el => {
-    const currentExpandedItem = expandableItems?.find(item => getExpandableLinkId(el) === item.compoundLinkId);
+    const currentExpandedItem = expandableItems?.find(item => false);
     const isExpanded = currentExpandedItem?.isExpanded;
     const linkType = getLinkType(el, rawData, currentExpandedItem?.isExpanded);
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 1
Received array:  [{"data": {}, "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef&b2c3d4e5-f678-9012-3456-7890abcdef01", "source": "b2c3d4e5-f678-9012-3456-7890abcdef01", "target": "a1b2c3d4-e5f6-7890-1234-567890abcdef", "type": "expandable"}]

[Survived] OptionalChaining
src/helpers/adapters/adapt-diagram-links.tsx:42:24
 
   rawData.links?.forEach(el => {
     const currentExpandedItem = expandableItems?.find(item => getExpandableLinkId(el) === item.compoundLinkId);
-    const isExpanded = currentExpandedItem?.isExpanded;
+    const isExpanded = currentExpandedItem.isExpanded;
     const linkType = getLinkType(el, rawData, currentExpandedItem?.isExpanded);
 

[Survived] OptionalChaining
src/helpers/adapters/adapt-diagram-links.tsx:43:47
   rawData.links?.forEach(el => {
     const currentExpandedItem = expandableItems?.find(item => getExpandableLinkId(el) === item.compoundLinkId);
     const isExpanded = currentExpandedItem?.isExpanded;
-    const linkType = getLinkType(el, rawData, currentExpandedItem?.isExpanded);
+    const linkType = getLinkType(el, rawData, currentExpandedItem.isExpanded);
 
     const key1 = generateDirectionString(el.fromId, el.toId); // Ключ для пары (fromId, toId)

[Killed] ConditionalExpression
src/helpers/adapters/adapt-diagram-links.tsx:49:9
     const key2 = generateDirectionString(el.toId, el.fromId); // Обратный ключ
 
     // Проверяем, была ли уже обработана эта пара или её обратная версия
-    if (!isPairProcessed(seenPairs, key1, key2)) {
+    if (true) {
       // Помечаем оба ключа как обработанные
       seenPairs.add(key1);
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2

[Killed] ConditionalExpression
src/helpers/adapters/adapt-diagram-links.tsx:49:9
     const key2 = generateDirectionString(el.toId, el.fromId); // Обратный ключ
 
     // Проверяем, была ли уже обработана эта пара или её обратная версия
-    if (!isPairProcessed(seenPairs, key1, key2)) {
+    if (false) {
       // Помечаем оба ключа как обработанные
       seenPairs.add(key1);
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should collapse grouped links into single expandable edge
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] EqualityOperator
src/helpers/adapters/adapt-diagram-links.tsx:54:11
       seenPairs.add(key1);
       seenPairs.add(key2);
 
-      if (linkType === EEdgeTypes.EXPANDABLE) {
+      if (linkType !== EEdgeTypes.EXPANDABLE) {
         // Здесь id === currentExpandedItem.compoundLinkId
         edges.push({
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should collapse grouped links into single expandable edge
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a1b2c3d4-e5f6-7890-1234-567890abcdef&b2c3d4e5-f678-9012-3456-7890abcdef01"
Received: "dd0d6793-427e-46da-8b48-a769dd07ab2d"

[Killed] BlockStatement
src/helpers/adapters/adapt-diagram-links.tsx:54:47
       seenPairs.add(key1);
       seenPairs.add(key2);
 
-      if (linkType === EEdgeTypes.EXPANDABLE) {
-        // Здесь id === currentExpandedItem.compoundLinkId
-        edges.push({
-          id: getExpandableLinkId(el),
-          source: el.fromId,
-          target: el.toId,
-          type: linkType,
-          data: {...currentExpandedItem},
-        });
-      } else {
+      if (linkType === EEdgeTypes.EXPANDABLE) {} else {
         const data = !isExpanded
           ? getLinkData(el)
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should collapse grouped links into single expandable edge
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] ObjectLiteral
src/helpers/adapters/adapt-diagram-links.tsx:61:17
           source: el.fromId,
           target: el.toId,
           type: linkType,
-          data: {...currentExpandedItem},
+          data: {},
         });
       } else {

[Killed] BlockStatement
src/helpers/adapters/adapt-diagram-links.tsx:63:14
           type: linkType,
           data: {...currentExpandedItem},
         });
-      } else {
-        const data = !isExpanded
-          ? getLinkData(el)
-          : {...currentExpandedItem};
-
-        edges.push({
-          id: !isExpanded ? el.id : getExpandableLinkId(el),
-          source: el.fromId,
-          target: el.toId,
-          type: isExpanded ? EEdgeTypes.SIMPLE : linkType,
-          data: {...data},
-        });
-      }
+      } else {}
     }
 
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2

[Survived] BooleanLiteral
src/helpers/adapters/adapt-diagram-links.tsx:64:22
           data: {...currentExpandedItem},
         });
       } else {
-        const data = !isExpanded
+        const data = isExpanded
           ? getLinkData(el)
           : {...currentExpandedItem};

[Survived] ObjectLiteral
src/helpers/adapters/adapt-diagram-links.tsx:66:13
       } else {
         const data = !isExpanded
           ? getLinkData(el)
-          : {...currentExpandedItem};
+          : {};
 
         edges.push({

[Survived] BooleanLiteral
src/helpers/adapters/adapt-diagram-links.tsx:69:15
           : {...currentExpandedItem};
 
         edges.push({
-          id: !isExpanded ? el.id : getExpandableLinkId(el),
+          id: isExpanded ? el.id : getExpandableLinkId(el),
           source: el.fromId,
           target: el.toId,

[Killed] BlockStatement
src/helpers/adapters/adapt-diagram-links.tsx:78:21
       }
     }
 
-    if (isExpanded) {
-      const relatedItem = currentExpandedItem.relatedItems.find(item => item.linkId === el.id);
-      const getNodeId = (id: string) =>
-        currentExpandedItem.topicId === id
-          ? getExpandedEventNodeId(relatedItem.eventId, currentExpandedItem.topicId)
-          : id;
-
-      edges.push({
-        id: el.id,
-        source: getNodeId(el.fromId),
-        target: getNodeId(el.toId),
-        type: linkType,
-        data: getLinkData(el),
-      });
-    }
+    if (isExpanded) {}
   });
 
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should expand grouped links when isExpanded=true with correct link types
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 1

[Killed] ConditionalExpression
src/helpers/adapters/adapt-diagram-links.tsx:78:9
       }
     }
 
-    if (isExpanded) {
+    if (true) {
       const relatedItem = currentExpandedItem.relatedItems.find(item => item.linkId === el.id);
       const getNodeId = (id: string) =>
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 3

[Killed] ArrowFunction
src/helpers/adapters/adapt-diagram-links.tsx:79:65
     }
 
     if (isExpanded) {
-      const relatedItem = currentExpandedItem.relatedItems.find(item => item.linkId === el.id);
+      const relatedItem = currentExpandedItem.relatedItems.find(() => undefined);
       const getNodeId = (id: string) =>
         currentExpandedItem.topicId === id
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: TypeError: Cannot read properties of undefined (reading 'eventId')

[Killed] EqualityOperator
src/helpers/adapters/adapt-diagram-links.tsx:79:73
     }
 
     if (isExpanded) {
-      const relatedItem = currentExpandedItem.relatedItems.find(item => item.linkId === el.id);
+      const relatedItem = currentExpandedItem.relatedItems.find(item => item.linkId !== el.id);
       const getNodeId = (id: string) =>
         currentExpandedItem.topicId === id
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should expand grouped links when isExpanded=true with correct link types
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "b2c3d4e5-f678-9012-3456-7890abcdef01+c3d4e5f6-7890-1234-5678-90abcdef0123"
Received string:    "b2c3d4e5-f678-9012-3456-7890abcdef01+b61208c8-09d4-4e4d-89c0-b1da4e8b7d17"

[Killed] EqualityOperator
src/helpers/adapters/adapt-diagram-links.tsx:81:9
     if (isExpanded) {
       const relatedItem = currentExpandedItem.relatedItems.find(item => item.linkId === el.id);
       const getNodeId = (id: string) =>
-        currentExpandedItem.topicId === id
+        currentExpandedItem.topicId !== id
           ? getExpandedEventNodeId(relatedItem.eventId, currentExpandedItem.topicId)
           : id;
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should expand grouped links when isExpanded=true with correct link types
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "b2c3d4e5-f678-9012-3456-7890abcdef01+c3d4e5f6-7890-1234-5678-90abcdef0123"
Received string:    "b2c3d4e5-f678-9012-3456-7890abcdef01"

[Killed] ConditionalExpression
src/helpers/adapters/adapt-diagram-links.tsx:81:9
     if (isExpanded) {
       const relatedItem = currentExpandedItem.relatedItems.find(item => item.linkId === el.id);
       const getNodeId = (id: string) =>
-        currentExpandedItem.topicId === id
+        false
           ? getExpandedEventNodeId(relatedItem.eventId, currentExpandedItem.topicId)
           : id;
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should expand grouped links when isExpanded=true with correct link types
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "b2c3d4e5-f678-9012-3456-7890abcdef01+c3d4e5f6-7890-1234-5678-90abcdef0123"
Received string:    "b2c3d4e5-f678-9012-3456-7890abcdef01"
