[Killed] ArrowFunction
src/helpers/adapters/adapt-diagram-nodes.tsx:15:49
   existingNodes: TNode[] = EMPTY_ARRAY
 ): TOptionalPosition<TNode>[] {
   // Фильтруем расширяемые элементы, оставляя только те, которые "раскрыты" (isExpanded === true)
-  const expandedItems = expandableItems?.filter(el => el.isExpanded);
+  const expandedItems = expandableItems?.filter(() => undefined);
 
   // Форматируем как обычные узлы если нет расширяемых элементов
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 5
Received length: 2

[Killed] MethodExpression
src/helpers/adapters/adapt-diagram-nodes.tsx:15:25
   existingNodes: TNode[] = EMPTY_ARRAY
 ): TOptionalPosition<TNode>[] {
   // Фильтруем расширяемые элементы, оставляя только те, которые "раскрыты" (isExpanded === true)
-  const expandedItems = expandableItems?.filter(el => el.isExpanded);
+  const expandedItems = expandableItems;
 
   // Форматируем как обычные узлы если нет расширяемых элементов
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position
statusReason: TypeError: Cannot read properties of null (reading 'width')

[Killed] ConditionalExpression
src/helpers/adapters/adapt-diagram-nodes.tsx:18:7
   const expandedItems = expandableItems?.filter(el => el.isExpanded);
 
   // Форматируем как обычные узлы если нет расширяемых элементов
-  if (!expandableItems || !expandedItems.length) {
+  if (false) {
     return formatSimpleNodes(rawData.nodes);
   }
killedBy: /src/helpers/adapters/adapt-diagram-nodes.tsx should correctly transform nodes into TCustomNode array
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ConditionalExpression
src/helpers/adapters/adapt-diagram-nodes.tsx:18:7
   const expandedItems = expandableItems?.filter(el => el.isExpanded);
 
   // Форматируем как обычные узлы если нет расширяемых элементов
-  if (!expandableItems || !expandedItems.length) {
+  if (true) {
     return formatSimpleNodes(rawData.nodes);
   }
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 5
Received length: 2

[Killed] BlockStatement
src/helpers/adapters/adapt-diagram-nodes.tsx:26:31
   const eventsByTopicId: Record<string, EventDTO[]> = {};
 
   // Создаем маппинг id-топика и эвентов
-  expandedItems.forEach(el => {
-    const eventIds = el.relatedItems.map(item => item.eventId);
-    eventsByTopicId[el.topicId] = eventIds
-      .map(eventId => rawData.events.find(event => event.id === eventId))
-      .filter(Boolean) as EventDTO[];
-  });
+  expandedItems.forEach(el => {});
 
   return formatExpandableNodes(rawData.nodes, eventsByTopicId, existingNodes);
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 5
Received length: 2

[Killed] ArrowFunction
src/helpers/adapters/adapt-diagram-nodes.tsx:27:42
 
   // Создаем маппинг id-топика и эвентов
   expandedItems.forEach(el => {
-    const eventIds = el.relatedItems.map(item => item.eventId);
+    const eventIds = el.relatedItems.map(() => undefined);
     eventsByTopicId[el.topicId] = eventIds
       .map(eventId => rawData.events.find(event => event.id === eventId))
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 5
Received length: 2
