[Killed] LogicalOperator
src/helpers/diagram-helpers/node-formatters.ts:28:7
  * Форматирует массив простых узлов.
  */
 export function formatSimpleNodes(rawData: NodeDTO[]): TOptionalPosition<TCustomNode>[] {
-  if (!rawData || !rawData.length) return [];
+  if (!rawData && !rawData.length) return [];
 
   return rawData.map(node => formatSimpleNode(node));
killedBy: /src/helpers/adapters/adapt-diagram-nodes.tsx should return an empty array if no nodes are provided
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] BooleanLiteral
src/helpers/diagram-helpers/node-formatters.ts:28:7
  * Форматирует массив простых узлов.
  */
 export function formatSimpleNodes(rawData: NodeDTO[]): TOptionalPosition<TCustomNode>[] {
-  if (!rawData || !rawData.length) return [];
+  if (rawData || !rawData.length) return [];
 
   return rawData.map(node => formatSimpleNode(node));
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: Error: ELK is not properly initialized

[Killed] ArrowFunction
src/helpers/diagram-helpers/node-formatters.ts:30:22
 export function formatSimpleNodes(rawData: NodeDTO[]): TOptionalPosition<TCustomNode>[] {
   if (!rawData || !rawData.length) return [];
 
-  return rawData.map(node => formatSimpleNode(node));
+  return rawData.map(() => undefined);
 }
 
killedBy: /src/helpers/adapters/adapt-diagram-nodes.tsx should correctly transform nodes into TCustomNode array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  2

  Array [
-   Object {
-     "data": Object {

[Survived] ObjectLiteral
src/helpers/diagram-helpers/node-formatters.ts:43:12
       relatedNodeId: rawNode.id,
     },
     type: ENodeTypes.GROUP,
-    style: {
-      backgroundColor: 'rgb(77, 102, 139, 0.1)',
-      borderColor: '#4D668B',
-    },
+    style: {},
   };
 }

[Survived] StringLiteral
src/helpers/diagram-helpers/node-formatters.ts:45:20
     type: ENodeTypes.GROUP,
     style: {
       backgroundColor: 'rgb(77, 102, 139, 0.1)',
-      borderColor: '#4D668B',
+      borderColor: "",
     },
   };

[Killed] OptionalChaining
src/helpers/diagram-helpers/node-formatters.ts:63:10
   nodes.forEach(node => {
     const relatedExpandedEvents = expandedEvents[node.id];
 
-    if (!relatedExpandedEvents?.length) {
+    if (!relatedExpandedEvents.length) {
       result = [...result, formatSimpleNode(node)];
       return;
killedBy: /src/helpers/adapters/adapt-diagram-nodes.tsx should add expanded nodes for event correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/helpers/diagram-helpers/node-formatters.ts:63:9
   nodes.forEach(node => {
     const relatedExpandedEvents = expandedEvents[node.id];
 
-    if (!relatedExpandedEvents?.length) {
+    if (true) {
       result = [...result, formatSimpleNode(node)];
       return;
killedBy: /src/helpers/adapters/adapt-diagram-nodes.tsx should add expanded nodes for event correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/helpers/diagram-helpers/node-formatters.ts:68:49
       return;
     }
 
-    const relatedNode = existingNodes.find(n => n.id === node.id);
+    const relatedNode = existingNodes.find(n => false);
     // Существующий узел группы
     const existingGroup = existingNodes
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "x": 290,
-   "y": 190,

[Killed] EqualityOperator
src/helpers/diagram-helpers/node-formatters.ts:68:49
       return;
     }
 
-    const relatedNode = existingNodes.find(n => n.id === node.id);
+    const relatedNode = existingNodes.find(n => n.id !== node.id);
     // Существующий узел группы
     const existingGroup = existingNodes
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "x": 290,
-   "y": 190,

[Survived] MethodExpression
src/helpers/diagram-helpers/node-formatters.ts:70:27
 
     const relatedNode = existingNodes.find(n => n.id === node.id);
     // Существующий узел группы
-    const existingGroup = existingNodes
-      .filter(el => el.type === 'group')
+    const existingGroup = existingNodes
       .find(group => group.id === generateBaseGroupNodeId(node.id));
 

[Survived] EqualityOperator
src/helpers/diagram-helpers/node-formatters.ts:71:21
     const relatedNode = existingNodes.find(n => n.id === node.id);
     // Существующий узел группы
     const existingGroup = existingNodes
-      .filter(el => el.type === 'group')
+      .filter(el => el.type !== 'group')
       .find(group => group.id === generateBaseGroupNodeId(node.id));
 

[Survived] ConditionalExpression
src/helpers/diagram-helpers/node-formatters.ts:71:21
     const relatedNode = existingNodes.find(n => n.id === node.id);
     // Существующий узел группы
     const existingGroup = existingNodes
-      .filter(el => el.type === 'group')
+      .filter(el => false)
       .find(group => group.id === generateBaseGroupNodeId(node.id));
 

[Survived] ArrowFunction
src/helpers/diagram-helpers/node-formatters.ts:72:13
     // Существующий узел группы
     const existingGroup = existingNodes
       .filter(el => el.type === 'group')
-      .find(group => group.id === generateBaseGroupNodeId(node.id));
+      .find(() => undefined);
 
     const parentNode = existingGroup || {

[NoCoverage] ConditionalExpression
src/helpers/diagram-helpers/node-formatters.ts:72:22
     // Существующий узел группы
     const existingGroup = existingNodes
       .filter(el => el.type === 'group')
-      .find(group => group.id === generateBaseGroupNodeId(node.id));
+      .find(group => false);
 
     const parentNode = existingGroup || {

[Killed] LogicalOperator
src/helpers/diagram-helpers/node-formatters.ts:74:24
       .filter(el => el.type === 'group')
       .find(group => group.id === generateBaseGroupNodeId(node.id));
 
-    const parentNode = existingGroup || {
-      ...formatBaseGroupNode(node),
-      position: {
-        // Отнимаем отступы 10px, чтобы нода была визуально на месте
-        x: relatedNode?.position?.x != null ? relatedNode.position.x - GROUP_NODE_PADDING : 0,
-        y: relatedNode?.position?.y != null ? relatedNode.position.y - GROUP_NODE_PADDING : 0,
-      },
-    };
+    const parentNode = existingGroup && {
+  ...formatBaseGroupNode(node),
+  position: {
+    // Отнимаем отступы 10px, чтобы нода была визуально на месте
+    x: relatedNode?.position?.x != null ? relatedNode.position.x - GROUP_NODE_PADDING : 0,
+    y: relatedNode?.position?.y != null ? relatedNode.position.y - GROUP_NODE_PADDING : 0
+  }
+};
 
     const expandedTopicNode = {
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: TypeError: Cannot read properties of undefined (reading 'parentId')

[Killed] ConditionalExpression
src/helpers/diagram-helpers/node-formatters.ts:78:12
       ...formatBaseGroupNode(node),
       position: {
         // Отнимаем отступы 10px, чтобы нода была визуально на месте
-        x: relatedNode?.position?.x != null ? relatedNode.position.x - GROUP_NODE_PADDING : 0,
+        x: true ? relatedNode.position.x - GROUP_NODE_PADDING : 0,
         y: relatedNode?.position?.y != null ? relatedNode.position.y - GROUP_NODE_PADDING : 0,
       },
killedBy: /src/helpers/adapters/adapt-diagram-nodes.tsx should add expanded nodes for event correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'position')

[Killed] ArithmeticOperator
src/helpers/diagram-helpers/node-formatters.ts:78:47
       ...formatBaseGroupNode(node),
       position: {
         // Отнимаем отступы 10px, чтобы нода была визуально на месте
-        x: relatedNode?.position?.x != null ? relatedNode.position.x - GROUP_NODE_PADDING : 0,
+        x: relatedNode?.position?.x != null ? relatedNode.position.x + GROUP_NODE_PADDING : 0,
         y: relatedNode?.position?.y != null ? relatedNode.position.y - GROUP_NODE_PADDING : 0,
       },
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "x": 290,
+   "x": 310,

[Killed] EqualityOperator
src/helpers/diagram-helpers/node-formatters.ts:79:12
       position: {
         // Отнимаем отступы 10px, чтобы нода была визуально на месте
         x: relatedNode?.position?.x != null ? relatedNode.position.x - GROUP_NODE_PADDING : 0,
-        y: relatedNode?.position?.y != null ? relatedNode.position.y - GROUP_NODE_PADDING : 0,
+        y: relatedNode?.position?.y == null ? relatedNode.position.y - GROUP_NODE_PADDING : 0,
       },
     };
killedBy: /src/helpers/adapters/adapt-diagram-nodes.tsx should add expanded nodes for event correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'position')

[Killed] OptionalChaining
src/helpers/diagram-helpers/node-formatters.ts:79:12
       position: {
         // Отнимаем отступы 10px, чтобы нода была визуально на месте
         x: relatedNode?.position?.x != null ? relatedNode.position.x - GROUP_NODE_PADDING : 0,
-        y: relatedNode?.position?.y != null ? relatedNode.position.y - GROUP_NODE_PADDING : 0,
+        y: relatedNode.position?.y != null ? relatedNode.position.y - GROUP_NODE_PADDING : 0,
       },
     };
killedBy: /src/helpers/adapters/adapt-diagram-nodes.tsx should add expanded nodes for event correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'position')

[Survived] BooleanLiteral
src/helpers/diagram-helpers/node-formatters.ts:87:18
       ...formatSimpleNode(node),
       position: INITIAL_POSITION_INSIDE_GROUP,
       parentId: generateBaseGroupNodeId(node.id),
-      draggable: false,
+      draggable: true,
     };
 

[Killed] ConditionalExpression
src/helpers/diagram-helpers/node-formatters.ts:93:22
     const expandedEventsNodes = relatedExpandedEvents.map((event, index) => {
       // Существующие узлы событий
       const existingExpandedEvent = existingNodes.find(
-        eventNode => eventNode.id === getExpandedEventNodeId(event.id, node.id)
+        eventNode => true
       );
 
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: TypeError: Cannot read properties of undefined (reading 'position')

[Killed] EqualityOperator
src/helpers/diagram-helpers/node-formatters.ts:93:22
     const expandedEventsNodes = relatedExpandedEvents.map((event, index) => {
       // Существующие узлы событий
       const existingExpandedEvent = existingNodes.find(
-        eventNode => eventNode.id === getExpandedEventNodeId(event.id, node.id)
+        eventNode => eventNode.id !== getExpandedEventNodeId(event.id, node.id)
       );
 
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: TypeError: Cannot read properties of undefined (reading 'position')

[Killed] LogicalOperator
src/helpers/diagram-helpers/node-formatters.ts:97:9
       );
 
       return (
-        existingExpandedEvent || {
-          id: getExpandedEventNodeId(event.id, node.id),
-          data: {
-            name: event.name,
-            brokerType: node.brokerType,
-          },
-          type: ENodeTypes.EXPANDED_EVENT,
-          parentId: generateBaseGroupNodeId(node.id),
-          position: {
-            x: INITIAL_POSITION_INSIDE_GROUP.x,
-            y: INITIAL_POSITION_INSIDE_GROUP.y + NODE_HEIGHT + GROUP_NODE_GAP + index * (NODE_HEIGHT + GROUP_NODE_GAP),
-          },
-          draggable: false,
-        }
+        existingExpandedEvent && {
+  id: getExpandedEventNodeId(event.id, node.id),
+  data: {
+    name: event.name,
+    brokerType: node.brokerType
+  },
+  type: ENodeTypes.EXPANDED_EVENT,
+  parentId: generateBaseGroupNodeId(node.id),
+  position: {
+    x: INITIAL_POSITION_INSIDE_GROUP.x,
+    y: INITIAL_POSITION_INSIDE_GROUP.y + NODE_HEIGHT + GROUP_NODE_GAP + index * (NODE_HEIGHT + GROUP_NODE_GAP)
+  },
+  draggable: false
+}
       );
     });
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: TypeError: Cannot read properties of undefined (reading 'parentId')

[Killed] ArithmeticOperator
src/helpers/diagram-helpers/node-formatters.ts:107:16
           parentId: generateBaseGroupNodeId(node.id),
           position: {
             x: INITIAL_POSITION_INSIDE_GROUP.x,
-            y: INITIAL_POSITION_INSIDE_GROUP.y + NODE_HEIGHT + GROUP_NODE_GAP + index * (NODE_HEIGHT + GROUP_NODE_GAP),
+            y: INITIAL_POSITION_INSIDE_GROUP.y - NODE_HEIGHT + GROUP_NODE_GAP + index * (NODE_HEIGHT + GROUP_NODE_GAP),
           },
           draggable: false,
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "x": 10,
-   "y": 78,

[Killed] ArithmeticOperator
src/helpers/diagram-helpers/node-formatters.ts:107:16
           parentId: generateBaseGroupNodeId(node.id),
           position: {
             x: INITIAL_POSITION_INSIDE_GROUP.x,
-            y: INITIAL_POSITION_INSIDE_GROUP.y + NODE_HEIGHT + GROUP_NODE_GAP + index * (NODE_HEIGHT + GROUP_NODE_GAP),
+            y: INITIAL_POSITION_INSIDE_GROUP.y + NODE_HEIGHT - GROUP_NODE_GAP + index * (NODE_HEIGHT + GROUP_NODE_GAP),
           },
           draggable: false,
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "x": 10,
-   "y": 78,

[Survived] BooleanLiteral
src/helpers/diagram-helpers/node-formatters.ts:109:22
             x: INITIAL_POSITION_INSIDE_GROUP.x,
             y: INITIAL_POSITION_INSIDE_GROUP.y + NODE_HEIGHT + GROUP_NODE_GAP + index * (NODE_HEIGHT + GROUP_NODE_GAP),
           },
-          draggable: false,
+          draggable: true,
         }
       );
