[Killed] ConditionalExpression
src/helpers/diagram-helpers/event-graph-helpers.tsx:12:57
   existingItems: TExpandableItem[] = EMPTY_ARRAY // Уже созданные расщиряемые элементы
 ): TExpandableItem[] {
   // Извлекаем ID узлов типа 'TOPIC'
-  const topicNodeIds = eventGraph.nodes?.filter(node => node.type === 'TOPIC').map(node => node.id);
+  const topicNodeIds = eventGraph.nodes?.filter(node => false).map(node => node.id);
 
   // Создаем карту связей, обрабатывая обратные связи как одинаковые
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"data": {"color": "#a63aaa", "eventId": "1"}, "id": "1", "source": "a", "target": "b", "type": "expandable"}, {"data": {"color": "#a63aaa", "eventId": "1"}, "id": "2", "source": "b", "target": "a", "type": "expandable"}]

[Killed] ArrowFunction
src/helpers/diagram-helpers/event-graph-helpers.tsx:12:49
   existingItems: TExpandableItem[] = EMPTY_ARRAY // Уже созданные расщиряемые элементы
 ): TExpandableItem[] {
   // Извлекаем ID узлов типа 'TOPIC'
-  const topicNodeIds = eventGraph.nodes?.filter(node => node.type === 'TOPIC').map(node => node.id);
+  const topicNodeIds = eventGraph.nodes?.filter(() => undefined).map(node => node.id);
 
   // Создаем карту связей, обрабатывая обратные связи как одинаковые
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"data": {"color": "#a63aaa", "eventId": "1"}, "id": "1", "source": "a", "target": "b", "type": "expandable"}, {"data": {"color": "#a63aaa", "eventId": "1"}, "id": "2", "source": "b", "target": "a", "type": "expandable"}]

[Survived] OptionalChaining
src/helpers/diagram-helpers/event-graph-helpers.tsx:15:26
   const topicNodeIds = eventGraph.nodes?.filter(node => node.type === 'TOPIC').map(node => node.id);
 
   // Создаем карту связей, обрабатывая обратные связи как одинаковые
-  const connectionsMap = eventGraph.links?.reduce((map, link) => {
+  const connectionsMap = eventGraph.links.reduce((map, link) => {
     const key = getExpandableLinkId(link); // Создаем уникальный ключ
 

[Killed] BlockStatement
src/helpers/diagram-helpers/event-graph-helpers.tsx:18:23
   const connectionsMap = eventGraph.links?.reduce((map, link) => {
     const key = getExpandableLinkId(link); // Создаем уникальный ключ
 
-    if (map.has(key)) {
-      const entry = map.get(key); // Получаем текущее значение
-      entry.count += 1; // Обновляем счетчик
-      entry.relatedItems = [...entry.relatedItems, {linkId: link.id, eventId: link.eventId}]; // Обновляем массив связей
-      map.set(key, entry); // Обновляем запись в Map
-    } else {
+    if (map.has(key)) {} else {
       map.set(key, {count: 1, relatedItems: [{linkId: link.id, eventId: link.eventId}]}); // Инициализируем новую запись
     }
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"data": {"color": "#a63aaa", "eventId": "1"}, "id": "1", "source": "a", "target": "b", "type": "expandable"}, {"data": {"color": "#a63aaa", "eventId": "1"}, "id": "2", "source": "b", "target": "a", "type": "expandable"}]

[Killed] ConditionalExpression
src/helpers/diagram-helpers/event-graph-helpers.tsx:18:9
   const connectionsMap = eventGraph.links?.reduce((map, link) => {
     const key = getExpandableLinkId(link); // Создаем уникальный ключ
 
-    if (map.has(key)) {
+    if (true) {
       const entry = map.get(key); // Получаем текущее значение
       entry.count += 1; // Обновляем счетчик
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: TypeError: Cannot read properties of undefined (reading 'count')

[Killed] AssignmentOperator
src/helpers/diagram-helpers/event-graph-helpers.tsx:20:7
 
     if (map.has(key)) {
       const entry = map.get(key); // Получаем текущее значение
-      entry.count += 1; // Обновляем счетчик
+      entry.count -= 1; // Обновляем счетчик
       entry.relatedItems = [...entry.relatedItems, {linkId: link.id, eventId: link.eventId}]; // Обновляем массив связей
       map.set(key, entry); // Обновляем запись в Map
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"data": {"color": "#a63aaa", "eventId": "1"}, "id": "1", "source": "a", "target": "b", "type": "expandable"}, {"data": {"color": "#a63aaa", "eventId": "1"}, "id": "2", "source": "b", "target": "a", "type": "expandable"}]

[Killed] BlockStatement
src/helpers/diagram-helpers/event-graph-helpers.tsx:23:12
       entry.count += 1; // Обновляем счетчик
       entry.relatedItems = [...entry.relatedItems, {linkId: link.id, eventId: link.eventId}]; // Обновляем массив связей
       map.set(key, entry); // Обновляем запись в Map
-    } else {
-      map.set(key, {count: 1, relatedItems: [{linkId: link.id, eventId: link.eventId}]}); // Инициализируем новую запись
-    }
+    } else {}
 
     return map;
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"data": {"color": "#a63aaa", "eventId": "1"}, "id": "1", "source": "a", "target": "b", "type": "expandable"}, {"data": {"color": "#a63aaa", "eventId": "1"}, "id": "2", "source": "b", "target": "a", "type": "expandable"}]

[Survived] MethodExpression
src/helpers/diagram-helpers/event-graph-helpers.tsx:31:10
   }, new Map());
 
   // Фильтруем связи с count > 1 и извлекаем ID узлов-топиков
-  return Array.from(connectionsMap.entries())
-    .filter(([, value]) => value.count > 1) // Оставляем только связи с count > 1
+  return Array.from(connectionsMap.entries()) // Оставляем только связи с count > 1
     .flatMap(([key, {relatedItems}]) =>
       key

[Killed] ArrowFunction
src/helpers/diagram-helpers/event-graph-helpers.tsx:32:13
 
   // Фильтруем связи с count > 1 и извлекаем ID узлов-топиков
   return Array.from(connectionsMap.entries())
-    .filter(([, value]) => value.count > 1) // Оставляем только связи с count > 1
+    .filter(() => undefined) // Оставляем только связи с count > 1
     .flatMap(([key, {relatedItems}]) =>
       key
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"data": {"color": "#a63aaa", "eventId": "1"}, "id": "1", "source": "a", "target": "b", "type": "expandable"}, {"data": {"color": "#a63aaa", "eventId": "1"}, "id": "2", "source": "b", "target": "a", "type": "expandable"}]

[Killed] EqualityOperator
src/helpers/diagram-helpers/event-graph-helpers.tsx:32:28
 
   // Фильтруем связи с count > 1 и извлекаем ID узлов-топиков
   return Array.from(connectionsMap.entries())
-    .filter(([, value]) => value.count > 1) // Оставляем только связи с count > 1
+    .filter(([, value]) => value.count <= 1) // Оставляем только связи с count > 1
     .flatMap(([key, {relatedItems}]) =>
       key
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"data": {"color": "#a63aaa", "eventId": "1"}, "id": "1", "source": "a", "target": "b", "type": "expandable"}, {"data": {"color": "#a63aaa", "eventId": "1"}, "id": "2", "source": "b", "target": "a", "type": "expandable"}]

[Killed] ArrowFunction
src/helpers/diagram-helpers/event-graph-helpers.tsx:33:14
   // Фильтруем связи с count > 1 и извлекаем ID узлов-топиков
   return Array.from(connectionsMap.entries())
     .filter(([, value]) => value.count > 1) // Оставляем только связи с count > 1
-    .flatMap(([key, {relatedItems}]) =>
-      key
-        .split('&') // Разделяем ключи на отдельные ID
-        .filter((id: string) => topicNodeIds.includes(id)) // Оставляем только ID, которые являются узлами-топиками
-        // Форматируем результат
-        .map((topicId: string) => {
-          // Находим существующий элемент по topicId и compoundLinkId
-          const existingItem = existingItems.find(item => item.topicId === topicId && item.compoundLinkId === key);
-
-          // Если элемент существует, берем его isExpanded, иначе устанавливаем false
-          const isExpanded = existingItem ? existingItem.isExpanded : false;
-
-          return {
-            isExpanded,
-            topicId,
-            relatedItems,
-            compoundLinkId: key,
-          };
-        })
+    .flatMap(() => undefined
     );
 }
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: TypeError: Cannot read properties of undefined (reading 'compoundLinkId')

[Survived] MethodExpression
src/helpers/diagram-helpers/event-graph-helpers.tsx:34:7
   return Array.from(connectionsMap.entries())
     .filter(([, value]) => value.count > 1) // Оставляем только связи с count > 1
     .flatMap(([key, {relatedItems}]) =>
-      key
-        .split('&') // Разделяем ключи на отдельные ID
-        .filter((id: string) => topicNodeIds.includes(id)) // Оставляем только ID, которые являются узлами-топиками
+      key.split('&') // Разделяем ключи на отдельные ID // Оставляем только ID, которые являются узлами-топиками
         // Форматируем результат
         .map((topicId: string) => {

[Killed] BlockStatement
src/helpers/diagram-helpers/event-graph-helpers.tsx:38:35
         .split('&') // Разделяем ключи на отдельные ID
         .filter((id: string) => topicNodeIds.includes(id)) // Оставляем только ID, которые являются узлами-топиками
         // Форматируем результат
-        .map((topicId: string) => {
-          // Находим существующий элемент по topicId и compoundLinkId
-          const existingItem = existingItems.find(item => item.topicId === topicId && item.compoundLinkId === key);
-
-          // Если элемент существует, берем его isExpanded, иначе устанавливаем false
-          const isExpanded = existingItem ? existingItem.isExpanded : false;
-
-          return {
-            isExpanded,
-            topicId,
-            relatedItems,
-            compoundLinkId: key,
-          };
-        })
+        .map((topicId: string) => {})
     );
 }
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: TypeError: Cannot read properties of undefined (reading 'compoundLinkId')

[NoCoverage] EqualityOperator
src/helpers/diagram-helpers/event-graph-helpers.tsx:40:59
         // Форматируем результат
         .map((topicId: string) => {
           // Находим существующий элемент по topicId и compoundLinkId
-          const existingItem = existingItems.find(item => item.topicId === topicId && item.compoundLinkId === key);
+          const existingItem = existingItems.find(item => item.topicId !== topicId && item.compoundLinkId === key);
 
           // Если элемент существует, берем его isExpanded, иначе устанавливаем false

[NoCoverage] LogicalOperator
src/helpers/diagram-helpers/event-graph-helpers.tsx:40:59
         // Форматируем результат
         .map((topicId: string) => {
           // Находим существующий элемент по topicId и compoundLinkId
-          const existingItem = existingItems.find(item => item.topicId === topicId && item.compoundLinkId === key);
+          const existingItem = existingItems.find(item => item.topicId === topicId || item.compoundLinkId === key);
 
           // Если элемент существует, берем его isExpanded, иначе устанавливаем false

[Killed] BooleanLiteral
src/helpers/diagram-helpers/event-graph-helpers.tsx:43:71
           const existingItem = existingItems.find(item => item.topicId === topicId && item.compoundLinkId === key);
 
           // Если элемент существует, берем его isExpanded, иначе устанавливаем false
-          const isExpanded = existingItem ? existingItem.isExpanded : false;
+          const isExpanded = existingItem ? existingItem.isExpanded : true;
 
           return {
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 3

[Survived] ObjectLiteral
src/helpers/diagram-helpers/event-graph-helpers.tsx:45:18
           // Если элемент существует, берем его isExpanded, иначе устанавливаем false
           const isExpanded = existingItem ? existingItem.isExpanded : false;
 
-          return {
-            isExpanded,
-            topicId,
-            relatedItems,
-            compoundLinkId: key,
-          };
+          return {};
         })
     );
