[Survived] BlockStatement
src/helpers/adapters/apply-layout.tsx:30:24
 
   // Создаем мапу дочерних элементов для каждого родительского элемента
   const parentChildrenMap = nodes.reduce<Record<string, {children: string[]; childCount: number}>>((acc, node) => {
-    if (node.parentId) {
-      if (!acc[node.parentId]) {
-        acc[node.parentId] = {children: [], childCount: 0};
-      }
-
-      acc[node.parentId].children.push(node.id);
-      acc[node.parentId].childCount++;
-    }
+    if (node.parentId) {}
     return acc;
   }, {});

[Survived] ConditionalExpression
src/helpers/adapters/apply-layout.tsx:30:9
 
   // Создаем мапу дочерних элементов для каждого родительского элемента
   const parentChildrenMap = nodes.reduce<Record<string, {children: string[]; childCount: number}>>((acc, node) => {
-    if (node.parentId) {
+    if (true) {
       if (!acc[node.parentId]) {
         acc[node.parentId] = {children: [], childCount: 0};

[Killed] BooleanLiteral
src/helpers/adapters/apply-layout.tsx:31:11
   // Создаем мапу дочерних элементов для каждого родительского элемента
   const parentChildrenMap = nodes.reduce<Record<string, {children: string[]; childCount: number}>>((acc, node) => {
     if (node.parentId) {
-      if (!acc[node.parentId]) {
+      if (acc[node.parentId]) {
         acc[node.parentId] = {children: [], childCount: 0};
       }
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: TypeError: Cannot read properties of undefined (reading 'children')

[Killed] ConditionalExpression
src/helpers/adapters/apply-layout.tsx:31:11
   // Создаем мапу дочерних элементов для каждого родительского элемента
   const parentChildrenMap = nodes.reduce<Record<string, {children: string[]; childCount: number}>>((acc, node) => {
     if (node.parentId) {
-      if (!acc[node.parentId]) {
+      if (false) {
         acc[node.parentId] = {children: [], childCount: 0};
       }
killedBy: /src/helpers/adapters/applyLayout.tsx should return correct nodes with calculated position when expandable item is open
statusReason: TypeError: Cannot read properties of undefined (reading 'children')

[Survived] ArrayDeclaration
src/helpers/adapters/apply-layout.tsx:32:41
   const parentChildrenMap = nodes.reduce<Record<string, {children: string[]; childCount: number}>>((acc, node) => {
     if (node.parentId) {
       if (!acc[node.parentId]) {
-        acc[node.parentId] = {children: [], childCount: 0};
+        acc[node.parentId] = {children: ["Stryker was here"], childCount: 0};
       }
 

[Survived] UpdateOperator
src/helpers/adapters/apply-layout.tsx:36:7
       }
 
       acc[node.parentId].children.push(node.id);
-      acc[node.parentId].childCount++;
+      acc[node.parentId].childCount--;
     }
     return acc;

[Killed] OptionalChaining
src/helpers/adapters/apply-layout.tsx:45:24
     id: 'root',
     layoutOptions: elkLayoutOptions,
     children: nodes.map(node => {
-      const isParent = parentChildrenMap[node.id]?.children?.length > 0;
+      const isParent = parentChildrenMap[node.id].children?.length > 0;
 
       const dimensions = isParent
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of undefined (reading 'children')

[Survived] EqualityOperator
src/helpers/adapters/apply-layout.tsx:45:24
     id: 'root',
     layoutOptions: elkLayoutOptions,
     children: nodes.map(node => {
-      const isParent = parentChildrenMap[node.id]?.children?.length > 0;
+      const isParent = parentChildrenMap[node.id]?.children?.length <= 0;
 
       const dimensions = isParent

[Survived] OptionalChaining
src/helpers/adapters/apply-layout.tsx:48:36
       const isParent = parentChildrenMap[node.id]?.children?.length > 0;
 
       const dimensions = isParent
-        ? calculateGroupDimensions(parentChildrenMap[node.id]?.childCount || 0)
+        ? calculateGroupDimensions(parentChildrenMap[node.id].childCount || 0)
         : {
             width: NODE_WIDTH,

[Survived] LogicalOperator
src/helpers/adapters/apply-layout.tsx:48:36
       const isParent = parentChildrenMap[node.id]?.children?.length > 0;
 
       const dimensions = isParent
-        ? calculateGroupDimensions(parentChildrenMap[node.id]?.childCount || 0)
+        ? calculateGroupDimensions(parentChildrenMap[node.id]?.childCount && 0)
         : {
             width: NODE_WIDTH,

[Survived] ConditionalExpression
src/helpers/adapters/apply-layout.tsx:60:64
         height: dimensions.height,
         layoutOptions: {
           // Распределяем сервисы слева, а все остальные узлы справа
-          'partitioning.partition': 'nodeType' in node.data && node.data.nodeType === 'SERVICE' ? '0' : '1',
+          'partitioning.partition': 'nodeType' in node.data && true ? '0' : '1',
         },
       };

[Survived] ConditionalExpression
src/helpers/adapters/apply-layout.tsx:60:37
         height: dimensions.height,
         layoutOptions: {
           // Распределяем сервисы слева, а все остальные узлы справа
-          'partitioning.partition': 'nodeType' in node.data && node.data.nodeType === 'SERVICE' ? '0' : '1',
+          'partitioning.partition': true ? '0' : '1',
         },
       };

[Killed] ArrowFunction
src/helpers/adapters/apply-layout.tsx:66:22
 
       return elkNode;
     }),
-    edges: edges.map(edge => ({
-      id: edge.id,
-      sources: [edge.source],
-      targets: [edge.target],
-    })),
+    edges: edges.map(() => undefined),
   };
 
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: Error: ELK is not properly initialized

[Killed] BlockStatement
src/helpers/adapters/apply-layout.tsx:74:7
   };
 
   let layout: ElkNode = null;
-  try {
-    layout = await window.elk.layout(elkGraph);
-  } catch {
+  try {} catch {
     throw new Error('ELK is not properly initialized');
   }
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: TypeError: Cannot read properties of null (reading 'children')

[NoCoverage] BlockStatement
src/helpers/adapters/apply-layout.tsx:76:11
   let layout: ElkNode = null;
   try {
     layout = await window.elk.layout(elkGraph);
-  } catch {
-    throw new Error('ELK is not properly initialized');
-  }
+  } catch {}
 
   const existingGroups = existingNodes.filter(el => el.type === 'group') as TGroupNode[];

[NoCoverage] StringLiteral
src/helpers/adapters/apply-layout.tsx:77:21
   try {
     layout = await window.elk.layout(elkGraph);
   } catch {
-    throw new Error('ELK is not properly initialized');
+    throw new Error("");
   }
 
