[Killed] OptionalChaining
src/helpers/diagram-helpers/edge-formatters.ts:9:5
 
 export function formatBaseLinks(rawData: EventGraphDTO): Edge[] {
   return (
-    rawData.links?.map((el, index) => ({
+    rawData.links.map((el, index) => ({
       id: el.id || `${el.fromId}->${el.toId}.${index}`,
       source: el.fromId,
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should return an empty array if no links are provided
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ArrowFunction
src/helpers/diagram-helpers/edge-formatters.ts:9:24
 
 export function formatBaseLinks(rawData: EventGraphDTO): Edge[] {
   return (
-    rawData.links?.map((el, index) => ({
-      id: el.id || `${el.fromId}->${el.toId}.${index}`,
-      source: el.fromId,
-      target: el.toId,
-      type: getLinkType(el, rawData),
-      data: {
-        color: stc(el.eventId || ''),
-        eventId: el.eventId,
-      },
-    })) || []
+    rawData.links?.map(() => undefined) || []
   );
 }
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should correctly transform links into Edge array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

  Array [
-   Object {
-     "data": Object {

[Killed] LogicalOperator
src/helpers/diagram-helpers/edge-formatters.ts:10:11
 export function formatBaseLinks(rawData: EventGraphDTO): Edge[] {
   return (
     rawData.links?.map((el, index) => ({
-      id: el.id || `${el.fromId}->${el.toId}.${index}`,
+      id: el.id && `${el.fromId}->${el.toId}.${index}`,
       source: el.fromId,
       target: el.toId,
killedBy: /src/components/diagram/Diagram.tsx should render diagram, control buttons and background
statusReason: Error: ELK is not properly initialized

[Killed] ConditionalExpression
src/helpers/diagram-helpers/edge-formatters.ts:15:20
       target: el.toId,
       type: getLinkType(el, rawData),
       data: {
-        color: stc(el.eventId || ''),
+        color: stc(true),
         eventId: el.eventId,
       },
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should correctly transform links into Edge array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Object {

[Killed] LogicalOperator
src/helpers/diagram-helpers/edge-formatters.ts:15:20
       target: el.toId,
       type: getLinkType(el, rawData),
       data: {
-        color: stc(el.eventId || ''),
+        color: stc(el.eventId && ''),
         eventId: el.eventId,
       },
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should correctly transform links into Edge array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Array [
    Object {
