[NoCoverage] ObjectLiteral
src/components/jsonEditor/JsonSchemaContent.tsx:25:20
           defaultLanguage="json"
           defaultValue={schema}
           onChange={onChange}
-          options={{
-            minimap: {enabled: false},
-            stickyScroll: {enabled: false},
-            scrollBeyondLastLine: false,
-            wordWrap: 'on',
-          }}
+          options={{}}
         />
         <Button type="primary" onClick={onSave}>

[NoCoverage] ObjectLiteral
src/components/jsonEditor/JsonSchemaContent.tsx:27:27
           onChange={onChange}
           options={{
             minimap: {enabled: false},
-            stickyScroll: {enabled: false},
+            stickyScroll: {},
             scrollBeyondLastLine: false,
             wordWrap: 'on',
