[NoCoverage] OptionalChaining
src/helpers/json-editor/buildJsonEditorSidebar.tsx:9:30
 import {EventDTO, EventGraphDTO} from '@/shared/api/event-graph-api';
 
 export const buildJsonEditorSidebar = (eventGraph: EventGraphDTO) => {
-  const events: EventDTO[] = eventGraph?.events?.map(event => event) || [];
+  const events: EventDTO[] = eventGraph.events?.map(event => event) || [];
 
   const items: ItemType[] = events.map(event => ({

[NoCoverage] ArrowFunction
src/helpers/json-editor/buildJsonEditorSidebar.tsx:9:54
 import {EventDTO, EventGraphDTO} from '@/shared/api/event-graph-api';
 
 export const buildJsonEditorSidebar = (eventGraph: EventGraphDTO) => {
-  const events: EventDTO[] = eventGraph?.events?.map(event => event) || [];
+  const events: EventDTO[] = eventGraph?.events?.map(() => undefined) || [];
 
   const items: ItemType[] = events.map(event => ({

[NoCoverage] ArrowFunction
src/helpers/json-editor/buildJsonEditorSidebar.tsx:11:40
 export const buildJsonEditorSidebar = (eventGraph: EventGraphDTO) => {
   const events: EventDTO[] = eventGraph?.events?.map(event => event) || [];
 
-  const items: ItemType[] = events.map(event => ({
-    key: event.id,
-    label: (
-      <Dropdown
-        trigger={['contextMenu']}
-        menu={{
-          items: [
-            {
-              label: 'Delete',
-              key: `del:${event.id}`,
-              onClick: e => {
-                e.domEvent.stopPropagation();
-                removeEvent(event.id);
-              },
-            },
-          ],
-        }}
-      >
-        {event.name}
-      </Dropdown>
-    ),
-    onClick: () => selectMenuItem(event),
-  }));
+  const items: ItemType[] = events.map(() => undefined);
 
   return items;

[NoCoverage] BlockStatement
src/helpers/json-editor/buildJsonEditorSidebar.tsx:21:29
             {
               label: 'Delete',
               key: `del:${event.id}`,
-              onClick: e => {
-                e.domEvent.stopPropagation();
-                removeEvent(event.id);
-              },
+              onClick: e => {},
             },
           ],

[NoCoverage] ArrowFunction
src/helpers/json-editor/buildJsonEditorSidebar.tsx:32:14
         {event.name}
       </Dropdown>
     ),
-    onClick: () => selectMenuItem(event),
+    onClick: () => undefined,
   }));
 
