[NoCoverage] BlockStatement
helpers/json-editor/json-form-helpers/parseOpenapi.ts:13:54
   const {anyOf, oneOf, ...schemaObject} = schema;
 
   // Обрабатываем элементы массива
-  if ('items' in schemaObject && schemaObject.items) {
-    schemaObject.items = removeUnionSchemas(schemaObject.items);
-  }
+  if ('items' in schemaObject && schemaObject.items) {}
 
   // Обрабатываем свойства объекта (заменили for на Object.fromEntries)

[NoCoverage] ConditionalExpression
helpers/json-editor/json-form-helpers/parseOpenapi.ts:18:7
   }
 
   // Обрабатываем свойства объекта (заменили for на Object.fromEntries)
-  if ('properties' in schemaObject && schemaObject.properties) {
+  if (true) {
     schemaObject.properties = Object.fromEntries(
       Object.entries(schemaObject.properties).map(([key, value]) => [key, removeUnionSchemas(value)])

[NoCoverage] BlockStatement
helpers/json-editor/json-form-helpers/parseOpenapi.ts:18:64
   }
 
   // Обрабатываем свойства объекта (заменили for на Object.fromEntries)
-  if ('properties' in schemaObject && schemaObject.properties) {
-    schemaObject.properties = Object.fromEntries(
-      Object.entries(schemaObject.properties).map(([key, value]) => [key, removeUnionSchemas(value)])
-    );
-  }
+  if ('properties' in schemaObject && schemaObject.properties) {}
 
   // Обрабатываем дополнительные свойства

[NoCoverage] ArrowFunction
helpers/json-editor/json-form-helpers/parseOpenapi.ts:20:51
   // Обрабатываем свойства объекта (заменили for на Object.fromEntries)
   if ('properties' in schemaObject && schemaObject.properties) {
     schemaObject.properties = Object.fromEntries(
-      Object.entries(schemaObject.properties).map(([key, value]) => [key, removeUnionSchemas(value)])
+      Object.entries(schemaObject.properties).map(() => undefined)
     );
   }

[NoCoverage] ArrayDeclaration
helpers/json-editor/json-form-helpers/parseOpenapi.ts:20:69
   // Обрабатываем свойства объекта (заменили for на Object.fromEntries)
   if ('properties' in schemaObject && schemaObject.properties) {
     schemaObject.properties = Object.fromEntries(
-      Object.entries(schemaObject.properties).map(([key, value]) => [key, removeUnionSchemas(value)])
+      Object.entries(schemaObject.properties).map(([key, value]) => [])
     );
   }

[NoCoverage] ConditionalExpression
helpers/json-editor/json-form-helpers/parseOpenapi.ts:28:5
   if (
     'additionalProperties' in schemaObject &&
     typeof schemaObject.additionalProperties === 'object' &&
-    schemaObject.additionalProperties !== null
+    true
   ) {
     schemaObject.additionalProperties = removeUnionSchemas(schemaObject.additionalProperties);

[NoCoverage] EqualityOperator
helpers/json-editor/json-form-helpers/parseOpenapi.ts:28:5
   if (
     'additionalProperties' in schemaObject &&
     typeof schemaObject.additionalProperties === 'object' &&
-    schemaObject.additionalProperties !== null
+    schemaObject.additionalProperties === null
   ) {
     schemaObject.additionalProperties = removeUnionSchemas(schemaObject.additionalProperties);

[NoCoverage] BlockStatement
helpers/json-editor/json-form-helpers/parseOpenapi.ts:29:5
     'additionalProperties' in schemaObject &&
     typeof schemaObject.additionalProperties === 'object' &&
     schemaObject.additionalProperties !== null
-  ) {
-    schemaObject.additionalProperties = removeUnionSchemas(schemaObject.additionalProperties);
-  }
+  ) {}
 
   // Обрабатываем allOf путём объединения схем (заменили for на reduce)

[NoCoverage] BlockStatement
helpers/json-editor/json-form-helpers/parseOpenapi.ts:34:54
   }
 
   // Обрабатываем allOf путём объединения схем (заменили for на reduce)
-  if ('allOf' in schemaObject && schemaObject.allOf) {
-    const mergedSchema = schemaObject.allOf.reduce((acc, subSchema) => {
-      const processed = removeUnionSchemas(subSchema);
-      if (!('$ref' in processed)) {
-        Object.assign(acc, processed);
-      }
-      return acc;
-    }, {} as TSchemaObject);
-
-    // Объединяем с родительской схемой (исключая allOf)
-    const {...rest} = schemaObject;
-    return {...mergedSchema, ...rest};
-  }
+  if ('allOf' in schemaObject && schemaObject.allOf) {}
 
   // Обрабатываем объединённые схемы (anyOf/oneOf), беря первый вариант

[NoCoverage] ConditionalExpression
helpers/json-editor/json-form-helpers/parseOpenapi.ts:34:7
   }
 
   // Обрабатываем allOf путём объединения схем (заменили for на reduce)
-  if ('allOf' in schemaObject && schemaObject.allOf) {
+  if (false) {
     const mergedSchema = schemaObject.allOf.reduce((acc, subSchema) => {
       const processed = removeUnionSchemas(subSchema);

[NoCoverage] ConditionalExpression
helpers/json-editor/json-form-helpers/parseOpenapi.ts:37:11
   if ('allOf' in schemaObject && schemaObject.allOf) {
     const mergedSchema = schemaObject.allOf.reduce((acc, subSchema) => {
       const processed = removeUnionSchemas(subSchema);
-      if (!('$ref' in processed)) {
+      if (false) {
         Object.assign(acc, processed);
       }

[NoCoverage] BooleanLiteral
helpers/json-editor/json-form-helpers/parseOpenapi.ts:37:11
   if ('allOf' in schemaObject && schemaObject.allOf) {
     const mergedSchema = schemaObject.allOf.reduce((acc, subSchema) => {
       const processed = removeUnionSchemas(subSchema);
-      if (!('$ref' in processed)) {
+      if ('$ref' in processed) {
         Object.assign(acc, processed);
       }

[NoCoverage] ObjectLiteral
helpers/json-editor/json-form-helpers/parseOpenapi.ts:45:12
 
     // Объединяем с родительской схемой (исключая allOf)
     const {...rest} = schemaObject;
-    return {...mergedSchema, ...rest};
+    return {};
   }
 

[NoCoverage] LogicalOperator
helpers/json-editor/json-form-helpers/parseOpenapi.ts:49:24
   }
 
   // Обрабатываем объединённые схемы (anyOf/oneOf), беря первый вариант
-  const unionOptions = anyOf || oneOf;
+  const unionOptions = anyOf && oneOf;
   if (unionOptions && unionOptions.length > 0) {
     const firstOption = removeUnionSchemas(unionOptions[0]);

[NoCoverage] EqualityOperator
helpers/json-editor/json-form-helpers/parseOpenapi.ts:50:23
 
   // Обрабатываем объединённые схемы (anyOf/oneOf), беря первый вариант
   const unionOptions = anyOf || oneOf;
-  if (unionOptions && unionOptions.length > 0) {
+  if (unionOptions && unionOptions.length <= 0) {
     const firstOption = removeUnionSchemas(unionOptions[0]);
 

[NoCoverage] LogicalOperator
helpers/json-editor/json-form-helpers/parseOpenapi.ts:50:7
 
   // Обрабатываем объединённые схемы (anyOf/oneOf), беря первый вариант
   const unionOptions = anyOf || oneOf;
-  if (unionOptions && unionOptions.length > 0) {
+  if (unionOptions || unionOptions.length > 0) {
     const firstOption = removeUnionSchemas(unionOptions[0]);
 

[NoCoverage] ConditionalExpression
helpers/json-editor/json-form-helpers/parseOpenapi.ts:53:9
   if (unionOptions && unionOptions.length > 0) {
     const firstOption = removeUnionSchemas(unionOptions[0]);
 
-    if ('$ref' in firstOption) {
+    if (true) {
       return firstOption;
     }

[NoCoverage] ConditionalExpression
helpers/json-editor/json-form-helpers/parseOpenapi.ts:53:9
   if (unionOptions && unionOptions.length > 0) {
     const firstOption = removeUnionSchemas(unionOptions[0]);
 
-    if ('$ref' in firstOption) {
+    if (false) {
       return firstOption;
     }

[NoCoverage] BlockStatement
helpers/json-editor/json-form-helpers/parseOpenapi.ts:88:17
     const parsedSchema = JSON.parse(schema);
 
     return removeUnionSchemas(parsedSchema);
-  } catch (err) {
-    // eslint-disable-next-line no-console
-    console.error('Error parsing OpenAPI schema:', err);
-  }
+  } catch (err) {}
 }
 
