[Killed] ArrowFunction
src/helpers/diagram-helpers/edge-helpers.tsx:10:48
  * Проверяет существование узлов с id === fromId и id === toId в наборе узлов графа.
  */
 export function isTargetAndSourceNodeExist(link: LinkDTO, rawData: EventGraphDTO): boolean {
-  const isTargetNodeExist = rawData.nodes.some(node => node.id === link.toId);
+  const isTargetNodeExist = rawData.nodes.some(() => undefined);
   const isSourceNodeExist = rawData.nodes.some(node => node.id === link.fromId);
 
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/helpers/diagram-helpers/edge-helpers.tsx:10:56
  * Проверяет существование узлов с id === fromId и id === toId в наборе узлов графа.
  */
 export function isTargetAndSourceNodeExist(link: LinkDTO, rawData: EventGraphDTO): boolean {
-  const isTargetNodeExist = rawData.nodes.some(node => node.id === link.toId);
+  const isTargetNodeExist = rawData.nodes.some(node => true);
   const isSourceNodeExist = rawData.nodes.some(node => node.id === link.fromId);
 
killedBy: /src/helpers/diagram-helpers/edge-helpers.tsx/isTargetAndSourceNodeExist should return false when target node does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/helpers/diagram-helpers/edge-helpers.tsx:11:56
  */
 export function isTargetAndSourceNodeExist(link: LinkDTO, rawData: EventGraphDTO): boolean {
   const isTargetNodeExist = rawData.nodes.some(node => node.id === link.toId);
-  const isSourceNodeExist = rawData.nodes.some(node => node.id === link.fromId);
+  const isSourceNodeExist = rawData.nodes.some(node => true);
 
   return isTargetNodeExist && isSourceNodeExist;
killedBy: /src/helpers/diagram-helpers/edge-helpers.tsx/isTargetAndSourceNodeExist should return false when source node does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/helpers/diagram-helpers/edge-helpers.tsx:11:48
  */
 export function isTargetAndSourceNodeExist(link: LinkDTO, rawData: EventGraphDTO): boolean {
   const isTargetNodeExist = rawData.nodes.some(node => node.id === link.toId);
-  const isSourceNodeExist = rawData.nodes.some(node => node.id === link.fromId);
+  const isSourceNodeExist = rawData.nodes.some(() => undefined);
 
   return isTargetNodeExist && isSourceNodeExist;
killedBy: /src/helpers/diagram-helpers/edge-helpers.tsx/isTargetAndSourceNodeExist should return true when both source and target nodes exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/helpers/diagram-helpers/edge-helpers.tsx:13:10
   const isTargetNodeExist = rawData.nodes.some(node => node.id === link.toId);
   const isSourceNodeExist = rawData.nodes.some(node => node.id === link.fromId);
 
-  return isTargetNodeExist && isSourceNodeExist;
+  return true;
 }
 
killedBy: /src/helpers/diagram-helpers/edge-helpers.tsx/getLinkType should return DISCONNECTED when nodes do not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "disconnectedEdge"
Received: "custom"

[Killed] ConditionalExpression
src/helpers/diagram-helpers/edge-helpers.tsx:13:10
   const isTargetNodeExist = rawData.nodes.some(node => node.id === link.toId);
   const isSourceNodeExist = rawData.nodes.some(node => node.id === link.fromId);
 
-  return isTargetNodeExist && isSourceNodeExist;
+  return false;
 }
 
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/helpers/diagram-helpers/edge-helpers.tsx:22:5
 export function isEdgeExpandable(link: LinkDTO, rawData: EventGraphDTO): boolean {
   // Существует ли несколько связей в одном направлении
   const isMultiple =
-    rawData.links.filter(linkEl => linkEl.fromId === link.fromId && linkEl.toId === link.toId).length > 1;
+    false;
 
   // Существуют ли двунаправленные связи
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should correctly transform links into Edge array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -5,18 +5,18 @@
        "eventId": "c3d4e5f6-7890-1234-5678-90abcdef0123",
      },

[Killed] EqualityOperator
src/helpers/diagram-helpers/edge-helpers.tsx:22:36
 export function isEdgeExpandable(link: LinkDTO, rawData: EventGraphDTO): boolean {
   // Существует ли несколько связей в одном направлении
   const isMultiple =
-    rawData.links.filter(linkEl => linkEl.fromId === link.fromId && linkEl.toId === link.toId).length > 1;
+    rawData.links.filter(linkEl => linkEl.fromId !== link.fromId && linkEl.toId === link.toId).length > 1;
 
   // Существуют ли двунаправленные связи
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/helpers/diagram-helpers/edge-helpers.tsx:26:5
 
   // Существуют ли двунаправленные связи
   const isBidirectional =
-    rawData.links.filter(linkEl => linkEl.fromId === link.toId && linkEl.toId === link.fromId).length >= 1;
+    true;
 
   return isMultiple || isBidirectional;
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/helpers/diagram-helpers/edge-helpers.tsx:26:5
 
   // Существуют ли двунаправленные связи
   const isBidirectional =
-    rawData.links.filter(linkEl => linkEl.fromId === link.toId && linkEl.toId === link.fromId).length >= 1;
+    false;
 
   return isMultiple || isBidirectional;
killedBy: /src/helpers/diagram-helpers/edge-helpers.tsx/isEdgeExpandable should return true when bidirectional link exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/helpers/diagram-helpers/edge-helpers.tsx:28:10
   const isBidirectional =
     rawData.links.filter(linkEl => linkEl.fromId === link.toId && linkEl.toId === link.fromId).length >= 1;
 
-  return isMultiple || isBidirectional;
+  return isMultiple && isBidirectional;
 }
 
killedBy: /src/helpers/diagram-helpers/edge-helpers.tsx/getLinkType should return EXPANDABLE when multiple links exist and not expanded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "expandable"
Received: "custom"

[Killed] ConditionalExpression
src/helpers/diagram-helpers/edge-helpers.tsx:28:10
   const isBidirectional =
     rawData.links.filter(linkEl => linkEl.fromId === link.toId && linkEl.toId === link.fromId).length >= 1;
 
-  return isMultiple || isBidirectional;
+  return false;
 }
 
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should correctly transform links into Edge array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -5,18 +5,18 @@
        "eventId": "c3d4e5f6-7890-1234-5678-90abcdef0123",
      },

[Killed] BooleanLiteral
src/helpers/diagram-helpers/edge-helpers.tsx:35:7
  * Возвращает тип связи в зависимости от условий
  */
 export function getLinkType(link: LinkDTO, rawData: EventGraphDTO, isExpanded?: boolean): EEdgeTypes {
-  if (!isTargetAndSourceNodeExist(link, rawData)) return EEdgeTypes.DISCONNECTED;
+  if (isTargetAndSourceNodeExist(link, rawData)) return EEdgeTypes.DISCONNECTED;
 
   if (isEdgeExpandable(link, rawData) && !isExpanded) return EEdgeTypes.EXPANDABLE;
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/helpers/diagram-helpers/edge-helpers.tsx:35:7
  * Возвращает тип связи в зависимости от условий
  */
 export function getLinkType(link: LinkDTO, rawData: EventGraphDTO, isExpanded?: boolean): EEdgeTypes {
-  if (!isTargetAndSourceNodeExist(link, rawData)) return EEdgeTypes.DISCONNECTED;
+  if (false) return EEdgeTypes.DISCONNECTED;
 
   if (isEdgeExpandable(link, rawData) && !isExpanded) return EEdgeTypes.EXPANDABLE;
killedBy: /src/helpers/diagram-helpers/edge-helpers.tsx/getLinkType should return DISCONNECTED when nodes do not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "disconnectedEdge"
Received: "custom"

[Killed] ConditionalExpression
src/helpers/diagram-helpers/edge-helpers.tsx:37:7
 export function getLinkType(link: LinkDTO, rawData: EventGraphDTO, isExpanded?: boolean): EEdgeTypes {
   if (!isTargetAndSourceNodeExist(link, rawData)) return EEdgeTypes.DISCONNECTED;
 
-  if (isEdgeExpandable(link, rawData) && !isExpanded) return EEdgeTypes.EXPANDABLE;
+  if (true) return EEdgeTypes.EXPANDABLE;
 
   return EEdgeTypes.CUSTOM;
killedBy: /src/components/diagram/Diagram.tsx should render correct count of service nodes, topic nodes and edges
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BooleanLiteral
src/helpers/diagram-helpers/edge-helpers.tsx:37:42
 export function getLinkType(link: LinkDTO, rawData: EventGraphDTO, isExpanded?: boolean): EEdgeTypes {
   if (!isTargetAndSourceNodeExist(link, rawData)) return EEdgeTypes.DISCONNECTED;
 
-  if (isEdgeExpandable(link, rawData) && !isExpanded) return EEdgeTypes.EXPANDABLE;
+  if (isEdgeExpandable(link, rawData) && isExpanded) return EEdgeTypes.EXPANDABLE;
 
   return EEdgeTypes.CUSTOM;
killedBy: /src/helpers/diagram-helpers/edge-helpers.tsx/getLinkType should return EXPANDABLE when multiple links exist and not expanded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "expandable"
Received: "custom"

[NoCoverage] ArrowFunction
src/helpers/diagram-helpers/edge-helpers.tsx:46:26
  * Возвращает id временного узла, связанного с разорванной связью
  */
 export function getRelatedGhostNodeId(ghostNodes: Node[], fromId: string, toId: string) {
-  return ghostNodes.find(({id}) => id === toId || id === fromId)?.id;
+  return ghostNodes.find(() => undefined)?.id;
 }
 

[NoCoverage] OptionalChaining
src/helpers/diagram-helpers/edge-helpers.tsx:46:10
  * Возвращает id временного узла, связанного с разорванной связью
  */
 export function getRelatedGhostNodeId(ghostNodes: Node[], fromId: string, toId: string) {
-  return ghostNodes.find(({id}) => id === toId || id === fromId)?.id;
+  return ghostNodes.find(({
+  id
+}) => id === toId || id === fromId).id;
 }
 

[Killed] MethodExpression
src/helpers/diagram-helpers/edge-helpers.tsx:54:10
  * Пример: 1&2
  */
 export function getExpandableLinkId(link: LinkDTO): string {
-  return [link.fromId, link.toId].sort().join('&');
+  return [link.fromId, link.toId].join('&');
 }
 
killedBy: /src/helpers/adapters/adapt-diagram-links.tsx should merge bidirectional edges between same nodes into one
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"data": {"color": "#a63aaa", "eventId": "1"}, "id": "1", "source": "a", "target": "b", "type": "expandable"}, {"data": {"color": "#a63aaa", "eventId": "1"}, "id": "2", "source": "b", "target": "a", "type": "expandable"}]

[Survived] BlockStatement
src/helpers/diagram-helpers/edge-helpers.tsx:68:109
 /**
  * Вычисляет угол между начальной и конечной точками. Используется для поворота стрелки в связи.
  */
-export function getArrowAngle(params: {targetY: number; sourceY: number; targetX: number; sourceX: number}) {
-  const {sourceX, sourceY, targetX, targetY} = params;
-
-  return Math.atan2(targetY - sourceY, targetX - sourceX) * (180 / Math.PI);
-}
+export function getArrowAngle(params: {targetY: number; sourceY: number; targetX: number; sourceX: number}) {}
 

[Survived] ArithmeticOperator
src/helpers/diagram-helpers/edge-helpers.tsx:71:10
 export function getArrowAngle(params: {targetY: number; sourceY: number; targetX: number; sourceX: number}) {
   const {sourceX, sourceY, targetX, targetY} = params;
 
-  return Math.atan2(targetY - sourceY, targetX - sourceX) * (180 / Math.PI);
+  return Math.atan2(targetY - sourceY, targetX - sourceX) / (180 / Math.PI);
 }
 

[Survived] ArithmeticOperator
src/helpers/diagram-helpers/edge-helpers.tsx:71:40
 export function getArrowAngle(params: {targetY: number; sourceY: number; targetX: number; sourceX: number}) {
   const {sourceX, sourceY, targetX, targetY} = params;
 
-  return Math.atan2(targetY - sourceY, targetX - sourceX) * (180 / Math.PI);
+  return Math.atan2(targetY - sourceY, targetX + sourceX) * (180 / Math.PI);
 }
 
