[NoCoverage] MethodExpression
src/helpers/utils.ts:2:13
 export const Capitalize = (input: string) => {
-  const s = input.toLowerCase();
+  const s = input.toUpperCase();
   return String(s[0]).toUpperCase() + String(s).slice(1);
 };

[NoCoverage] MethodExpression
src/helpers/utils.ts:3:39
 export const Capitalize = (input: string) => {
   const s = input.toLowerCase();
-  return String(s[0]).toUpperCase() + String(s).slice(1);
+  return String(s[0]).toUpperCase() + String(s);
 };
 

[NoCoverage] MethodExpression
src/helpers/utils.ts:3:10
 export const Capitalize = (input: string) => {
   const s = input.toLowerCase();
-  return String(s[0]).toUpperCase() + String(s).slice(1);
+  return String(s[0]).toLowerCase() + String(s).slice(1);
 };
 
