[NoCoverage] ArrowFunction
src/pages/json-editor-page/JsonEditorPage.tsx:10:44
 /**
  * Json editor page.
  */
-export const JsonEditorPageComponent: FC = () => (
-  <div className="flex h-full w-full flex-row" data-testid="json-editor-page">
-    <ReactFlowProvider>
-      <JsonEditorSidebar />
-      <JsonEditorContent />
-    </ReactFlowProvider>
-  </div>
-);
+export const JsonEditorPageComponent: FC = () => undefined;
 
