[NoCoverage] ArrowFunction
src/pages/visualiser-page/VisualiserPage.tsx:10:35
 /**
  * Visualiser page.
  */
-export const VisualiserPage: FC = () => (
-  <div className="flex h-full w-full flex-row" data-testid="visualiser-page">
-    <ReactFlowProvider>
-      <Sidebar />
-      <Diagram />
-    </ReactFlowProvider>
-  </div>
-);
+export const VisualiserPage: FC = () => undefined;
 
